{"retrieved-date":"2025-9-10","actions-date":"Tuesday, September 9, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, September  9)","actionItem":"S.Res. 377 (Sen. Thune):\n        An executive resolution authorizing the en bloc consideration in Executive Session of certain nominations on the Executive Calendar.\n\n        -- Point of order by Senator Schumer that the motion to proceed to Executive Calendar No. 1, S.Res. 377, is not in order because legislation that provides for the en bloc consideration of individual nominations is legislative business and such resolution should be required to be considered in legislative session raised in Senate.\n\n        -- The Chair, under the provisions of Rule XX, submits the question to the Senate for its decision: Is a resolution for the en bloc consideration of specific nominations on the executive calendar requireed to be considered in legislative session?.\n\n        -- Motion to table the point of order made by Senator Schumer, the question being: Is a resolution for the en bloc consideration of specific nominations on the executive calendar required to be considered in legislative session? agreed to in Senate by Yea-Nay Vote. 53 - 46. Record Vote Number: 510 \n\n\n        -- Ruling of the Chair that the point of order raised by Senator Schumer that a resolution for the en bloc consideration of specific nominations on the executive calendar required to be considered in legislative session not sustained.\n\n        -- Motion to proceed to executive session to consideration of measure agreed to in Senate by Yea-Nay Vote. 53 - 45. Record Vote Number: 511 \n\n\n        -- Measure laid before Senate by motion.\n\n        -- Cloture motion on the measure presented in Senate.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, September  9)","actionItem":"PN12-21:\n        Jacob Helberg, of Florida, to be an Under Secretary of State (Economic Growth, Energy, and the Environment)\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN22-9:\n        Neil Jacobs, of North Carolina, to be Under Secretary of Commerce for Oceans and Atmosphere\n\n        -- Recommitted to Senate Committee on Commerce, Science, and Transportation on a point of order.\n\n\n PN25-5:\n        Benjamin Black, of New York, to be Chief Executive Officer of the United States International Development Finance Corporation\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN25-10:\n        Thomas DiNanno, of Florida, to be Under Secretary of State for Arms Control and International Security\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN25-24:\n        Paul Kapur, of California, to be Assistant Secretary of State for South Asian Affairs\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN25-37:\n        Caleb Orr, of Texas, to be an Assistant Secretary of State (Economic and Business Affairs)\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN25-41:\n        Chris Pratt, of Utah, to be an Assistant Secretary of State (Political-Military Affairs)\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN25-49:\n        Sarah Rogers, of New York, to be Under Secretary of State for Public Diplomacy\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN26-17:\n        Somers Farkas, of New York, to be Ambassador to the Republic of Malta\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN26-30:\n        Nicole McGraw, of Florida, to be Ambassador to the Republic of Croatia\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN26-41:\n        Leandro Rizzuto, of Florida, to be Permanent Representative of the United States of America to the Organization of American States, with the rank of Ambassador\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN54-2:\n        Stacey Feinberg, of California, to be Ambassador to the Grand Duchy of Luxembourg\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN54-3:\n        Kenneth Howery, of Texas, to be Ambassador to the Kingdom of Denmark\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN55-8:\n        Lynda Blanchard, of Alabama, to be U.S. Representative to the United Nations Agencies for Food and Agriculture, with the rank of Ambassador\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN55-11:\n        Howard Brodie, of Florida, to be Ambassador to the Republic of Finland\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN55-15:\n        Michael DeSombre, of Illinois, to be an Assistant Secretary of State (East Asian and Pacific Affairs)\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN55-19:\n        Arthur Fisher, of North Carolina, to be Ambassador to the Republic of Austria\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN55-29:\n        Nicholas Merrick, of Texas, to be Ambassador to the Czech Republic\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN55-32:\n        Roman Pipko, of Florida, to be Ambassador to the Republic of Estonia\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN55-37:\n        Thomas Rose, of Florida, to be Ambassador to the Republic of Poland\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN129-10:\n        Robert Law, of the District of Columbia, to be Under Secretary for Strategy, Policy, and Plans, Department of Homeland Security\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 46. Record Vote Number: 506 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 49 - 46. Record Vote Number: 507 \n\n\n\n PN129-14:\n        Anjani Sinha, of Florida, to be Ambassador to the Republic of Singapore\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN150-4:\n        Maria A. Lanahan, of Missouri, to be United States District Judge for the Eastern District of Missouri\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 45. Record Vote Number: 505 \n\n\n\n PN342:\n        Michael G. Waltz, of Florida, to be Representative of the United States of America to the Sessions of the General Assembly of the United Nations during his tenure of service as Representative of the United States of America to the United Nations\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN343:\n        Michael G. Waltz, of Florida, to be the Representative of the United States of America to the United Nations, with the Rank of Ambassador, and the Representative of the United States of America in the Security Council of the United Nations\n\n        -- Recommitted to Senate Committee on Foreign Relations on a point of order.\n\n\n PN346-3:\n        Kyle Christopher Dudek, of Florida, to be United States District Judge for the Middle District of Florida\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 44. Record Vote Number: 508 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 45. Record Vote Number: 509","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  8:17 p.m, the Presiding Officer (Ms. Lummis in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}