{"retrieved-date":"2025-1-22","actions-date":"Monday, January 20, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Friday, January 17, 2025,  the Journal      of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Friday, January 17, 2025,      the morning hour being deemed expired, and the times for the recognition      of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, January 20)","actionItem":"S. 5 (Sen. Britt):\n                A bill to require the Secretary of Homeland Security to take into custody aliens who have been charged in the United States with theft, and for other purposes.      \n\n        --        Considered by Senate.      \n\n        --        Passed Senate with an amendment by Yea-Nay Vote. 64 - 35. Record Vote        Number:        7      \n\n         \n\n S.Amdt. 8 (Sen. Ernst):\n                    To include crimes resulting in death or serious bodily injury to the list of offenses that, if committed by an inadmissiblealien, require mandatory detention.          \n\n        --            Considered by Senate.          \n\n        --            Amendment SA 8 agreed to in Senate by Yea-Nay Vote. 75 - 24. Record Vote            Number:          \n      \n\n    \n\n S. 6 (Sen. Lankford):\n                A bill to amend title 18, United States Code, to prohibit a health care practitioner from failing to exercise the proper degree of care in the case of a child who survives an abortion or attemptedabortion.      \n\n        --        Motion to proceed to consideration of measure made in Senate.      \n\n        --        Cloture motion on the motion to proceed to the measure presented in Senate.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Monday, January 20)","actionItem":"--      Reported by Senator Risch, Committee on Foreign Relations, without printed      report.        \n\n        --      Placed on Senate Executive Calendar. Calendar No. 2.        \n\n        --      By unanimous consent agreement, debate and vote 1/20/2025.        \n\n        --      Considered by Senate.        \n\n        --      Confirmed by the Senate by Yea-Nay Vote. 99 - 0. Record Vote Number:      8","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at      6:53 p.m., the Senate adjourned, under its order of today, until      11 a.m. tomorrow.","actionTimeStamp":"--"}]}