{"retrieved-date":"2023-9-28","actions-date":"Wednesday, September 27, 2023","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, September 27)","actionItem":"H.R. 3935 (Rep. Graves):\n        A bill to amend title 49, United States Code, to reauthorize and improve the Federal Aviation Administration and other civil aviation programs, and for other purposes.\n\n        -- Motion to proceed to measure considered in Senate.\n\n\n H.R. 5110 (Rep. Green):\n        A bill to amend the Elementary and Secondary Education Act of 1965 to clarify that the prohibition on the use of Federal education funds for certain weapons does not apply to the use of such weapons for training in archery, hunting, or other shooting sports.\n\n        -- Received in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.\n\n\n S.Res. 370 (Sen. Schumer):\n        A resolution to constitute the majority party's membership on certain committees for the One Hundred Eighteenth Congress, or until their successors are chosen.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.\n\n\n S.Res. 373 (Sen. Brown):\n        A resolution designating the week of September 17 through September 23, 2023, as \"Community School Coordinators Appreciation Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 374 (Sen. Moran):\n        A resolution designating September 2023 as \"National Student Parent Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 375 (Sen. Boozman):\n        A resolution supporting the designation of September 21, 2023, as \"National Teach Ag Day\" and celebrating 75 years of the National Association of Agricultural Educators.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 376 (Sen. Manchin):\n        A resolution clarifying the dress code for the floor of the Senate.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.\n\n\n S.Res. 377 (Sen. Bennet):\n        A resolution recognizing Hispanic Restaurant Week and the contributions of Hispanic restaurant owners and employees to the restaurant industry.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Recess","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  6:54 p.m., the Senate recessed, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}