{"retrieved-date":"2024-1-11","actions-date":"Wednesday, January 10, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, January 10)","actionItem":"S.J.Res. 32 (Sen. Kennedy):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Bureau of Consumer Financial Protection relating to \"Small Business Lending Under the Equal Credit Opportunity Act (Regulation B)\".\n\n        -- Veto Message considered in Senate.\n\n        -- Failed of passage in Senate over veto by Yea-Nay Vote. 54 - 45. Record Vote Number: 5","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, January 10)","actionItem":"PN376:\n        S. Kato Crews, of Colorado, to be United States District Judge for the District of Colorado\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 47. Record Vote Number: 3 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 48. Record Vote Number: 4 \n\n\n\n PN816:\n        Karoline Mehalchick, of Pennsylvania, to be United States District Judge for the Middle District of Pennsylvania\n\n        -- Considered by Senate.\n\n        -- Cloture motion withdrawn by unanimous consent in Senate.\n\n\n PN837:\n        Erika L. McEntarfer, of the District of Columbia, to be Commissioner of Labor Statistics, Department of Labor, for a term of four years\n\n        -- By unanimous consent agreement, debate 1/10/2024.\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate 1/11/2024.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  5:21 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}