{"retrieved-date":"2024-6-18","actions-date":"Thursday, June 13, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, June 13)","actionItem":"S. 4445 (Sen. Duckworth):\n        A bill to protect and expand nationwide access to fertility treatment, including in vitro fertilization.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture on the motion to proceed to the measure not invoked in Senate by Yea-Nay Vote. 48 - 47. Record Vote Number: 197 \n\n\n        -- Motion by Senator Schumer to reconsider the vote by which cloture on the motion to proceed to the measure was not invoked (Record Vote No. 197) made in Senate.\n\n\n S. 4548 (Sen. Whitehouse):\n        A bill to make a technical correction to the National Defense Authorization Act for Fiscal Year 2024 by repealing section 5101 and enacting an updated version of the Foreign Extortion Prevention Act.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.\n\n\n S.Res. 732 (Sen. Braun):\n        A resolution celebrating the 247th anniversary of the creation of the flag of the United States and expressing support for the Pledge of Allegiance.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 735 (Sen. Graham):\n        A resolution designating July 17, 2024, as \"Glioblastoma Awareness Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, June 13)","actionItem":"PN1244:\n        Mustafa Taher Kasubhai, of Oregon, to be United States District Judge for the District of Oregon\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN1353:\n        Katherine E. Oler, of the District of Columbia, to be an Associate Judge of the Superior Court of the District of Columbia for the term of fifteen years\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- By unanimous consent agreement, debate 6/17/2024.\n\n\n PN1469:\n        Judy W. Chang, of Massachusetts, to be a Member of the Federal Energy Regulatory Commission for a term expiring June 30, 2029\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 63 - 33. Record Vote Number: 196","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  3:09 p.m, the Presiding Officer ( in the chair) declared the Senate adjourned, under its order of today, until  3:30 p.m. on Monday, June 17, 2024.","actionTimeStamp":"--"}]}