{"retrieved-date":"2024-4-24","actions-date":"Friday, April 19, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday,the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Friday, April 19)","actionItem":"H.R. 7888 (Rep. Lee):\n        A bill to reform the Foreign Intelligence Surveillance Act of 1978.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 62 - 30. Record Vote Number: 143 \n\n\n        -- Measure laid before Senate by motion.\n\n        -- Passed Senate, under the order of 4/19/2024, having achieved 60 votes in the affirmative, without amendment by Yea-Nay Vote. 60 - 34. Record Vote Number: 150 \n\n\n        -- Message on Senate action sent to the House.\n \n\n S.Amdt. 1820 (Sen. Wyden):\n        To strike section 25, relating to definition of electronic communication service provider.\n\n        --Amendment SA 1820 proposed by Senator Wyden.\n\n        --Amendment SA 1820 not agreed to in Senate by Yea-Nay Vote. 34 - 58. Record Vote Number: \n\n\n S.Amdt. 1828 (Sen. Paul):\n        To prohibit the use of authorities under the Foreign Intelligence Surveillance Act of 1978 to surveil United States persons, to prohibit queries under such Act using search terms associated with United States persons, and to prohibit the use of information acquiredunder such Act in any criminal, civil, or administrative proceeding or as part of any criminal, civil, or administrative investigation.\n\n        --Amendment SA 1828 proposed by Senator Paul.\n\n        --Amendment SA 1828, under the order of 4/19/2024, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 11 - 81. Record Vote Number: \n\n\n S.Amdt. 1829 (Sen. Paul):\n        To append the Fourth Amendment Is Not For Sale Act.\n\n        --Amendment SA 1829 proposed by Senator Paul.\n\n        --Amendment SA 1829, under the order of 4/19/2024, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 31 - 61. Record Vote Number: \n\n\n S.Amdt. 1834 (Sen. Marshall):\n        To strike the prohibition on political appointees being involved in the approval of queries by the Federal Bureau of Investigation.\n\n        --Amendment SA 1834 proposed by Senator Marshall.\n\n        --Amendment SA 1834 not agreed to in Senate by Yea-Nay Vote. 17 - 75. Record Vote Number: \n\n\n S.Amdt. 1840 (Sen. Lee):\n        To appropriately address the use of amici curiae in Foreign Intelligence Surveillance Court proceedings and to require adequate disclosure of relevant information in Foreign Intelligence Surveillance Act of 1978 applications.\n\n        --Amendment SA 1840 proposed by Senator Lee.\n\n        --Amendment SA 1840 not agreed to in Senate by Yea-Nay Vote. 40 - 53. Record Vote Number: \n\n\n S.Amdt. 1841 (Sen. Durbin):\n        To prohibit warrantless access to the communications and other information of United States persons.\n\n        --Amendment SA 1841 proposed by Senator Durbin.\n\n        --Amendment SA 1841 not agreed to in Senate by Yea-Nay Vote. 42 - 50. Record Vote Number:","actionTimeStamp":"--"},{"index":5,"header":"Legislative Business (Saturday, April 20)","actionItem":"H.R. 3935 (Rep. Graves):\n        A bill to amend title 49, United States Code, to reauthorize and improve the Federal Aviation Administration and other civilaviation programs, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate by Unanimous Consent.\n\n\n S. 3687 (Sen. Ossoff):\n        A bill to direct the Office for Victims of Crime of the Department of Justice to implement anti-trafficking recommendations of the Government Accountability Office.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 3998 (Sen. Cruz):\n        A bill to provide for the permanent appointment ofcertain temporary district judgeships.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 657 (Sen. King):\n        A resolution celebrating the 152nd anniversary of Arbor Day.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 658 (Sen. Reed):\n        A resolution designating April 2024 as \"Financial Literacy Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 659 (Sen. Graham):\n        A resolution commending the University of South Carolina Gamecocks women's basketball team for winning the 2024 National Collegiate Athletics Association Women's Basketball National Championship.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  1:29 a.m., the Senate adjourned, under its order of today, until  9 a.m. tomorrow.","actionTimeStamp":"--"}]}