{"retrieved-date":"2024-1-19","actions-date":"Wednesday, January 17, 2024","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, January 17)","actionItem":"H.R. 2872 (Rep. Graves):\n        To amend the Permanent Electronic Duck Stamp Act of 2013 to allow the Secretary of the Interior to issue electronic stamps under such Act, and for other purposes.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Voice Vote.\n\n        -- Measure laid before Senate by motion.\n \n\n S.Amdt. 1381 (Sen. Murray):\n        In the nature of a substitute.\n\n        --Amendment SA 1381 proposed by Senator Schumer for Senator Murray.\n\n\n\n\n S.Res. 520 (Sen. Stabenow):\n        A resolution congratulating the University of Michigan Wolverines football team for winning the 2024 National Collegiate Athletic Association College Football National Championship.\n\n        -- Senate Committee on Commerce, Science, and Transportation discharged Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 525 (Sen. Smith):\n        A resolution expressing support for the designation of October 2023 as \"National Co-Op Month\" and commending the cooperative business model and the member-owners, businesses, employees, farmers, ranchers, and practitioners who use the cooperative business model to positively impact the economy and society.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 526 (Sen. Fischer):\n        A resolution repealing standing orders relating to flowers in the Senate Chamber.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  9:10 p.m., the Senate adjourned, under its order of today, until 11 a.m. tomorrow.","actionTimeStamp":"--"}]}