{"retrieved-date":"2025-12-9","actions-date":"Thursday, December 4, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, December  4)","actionItem":"H.R. 3174 (Rep. Williams):\n        A bill to increase loan limits for loans made to small manufacturers, and for other purposes.\n\n        -- Senate vitiated previous action of 12/02/2025 by Unanimous Consent.\n\n        -- Read twice. Placed on Senate Legislative Calendar under General Orders. Calendar No. 283.\n\n\n H.J.Res. 131 (Rep. Begich):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Bureau of Land Management relating to \"Coastal Plain Oil and Gas Leasing Program Record of Decision\".\n\n        -- Measure laid before Senate by motion.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 49 - 45. Record Vote Number: 632 \n\n\n        -- Message on Senate action sent to the House.\n\n\n H.Con.Res. 62 (Rep. Wittman):\n        A concurrent resolution authorizing the use of Emancipation Hall in the Capitol Visitor Center for an event to unveil the statue of Barbara Rose Johns.\n\n        -- Resolution agreed to in Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S.J.Res. 91 (Sen. Murkowski):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Bureau of Land Management relating to \"Coastal Plain Oil and Gas Leasing Program Record of Decision\".\n\n        -- Indefinitely postponed by Senate by Unanimous Consent.\n\n\n S.Res. 520 (Sen. Thune):\n        An executive resolution authorizing the en bloc consideration in Executive Session of certain nominations on the Executive Calendar.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture, not having achieved 60 votes in the affirmative, was not invoked in Senate by Yea-Nay Vote. 43 - 37. Record Vote Number: 633 \n\n\n\n S.Res. 531 (Sen. Van Hollen):\n        A resolution celebrating the 50th anniversary of the Individuals with Disabilities Education Act on November 29, 2025, and recognizing its transformative impact on the education of children with disabilities.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, December  4)","actionItem":"PN466-1:\n        Robert P. Chamberlin, of Mississippi, to be United States District Judge for the Northern District of Mississippi\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN466-5:\n        James D. Maxwell II, of Mississippi, to be United States District Judge for the Northern District of Mississippi\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN520-4:\n        Susan Courtwright Rodriguez, of North Carolina, to be United States District Judge for the Western District of North Carolina\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 57 - 32. Record Vote Number: 634 \n\n\n\n PN615-1:\n        William J. Crain, of Louisiana, to be United States District Judge for the Eastern District of Louisiana\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.","actionTimeStamp":"--"},{"index":6,"header":"Recess","actionItem":"Under the authority of the order of today, at  3:50 p.m, the Presiding Officer (Mr. Banks in the chair) declared the Senate recessed, under its order of today, until  3 p.m. on Monday, December 8, 2025.","actionTimeStamp":"--"}]}