{"retrieved-date":"2024-9-25","actions-date":"Wed, 25 Sep 2024 13:16:12 -0400","actions-title":"House Floor Proceedings","actions-count":30,"actions-list":[{"index":1,"header":"--","actionItem":"Committee of the Whole House on the state of the Union rises leaving H.R. 3334 as unfinished business.","actionTimeStamp":"Wed, 25 Sep 2024 13:16:12 -0400"},{"index":2,"header":"--","actionItem":"On motion that the committee rise Agreed to by voice vote.","actionTimeStamp":"Wed, 25 Sep 2024 13:16:04 -0400"},{"index":3,"header":"--","actionItem":"Mr. Moylan moved that the committee rise.","actionTimeStamp":"Wed, 25 Sep 2024 13:15:46 -0400"},{"index":4,"header":"--","actionItem":"On agreeing to the Ogles amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 25 Sep 2024 13:15:24 -0400"},{"index":5,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1486, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 4.","actionTimeStamp":"Wed, 25 Sep 2024 13:12:29 -0400"},{"index":6,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 4 printed in Part B of House Report 118-705 to require the President to certify that the PRC and CCP have ceased their oppression of the Tibetan people as a condition of terminating sanctions.","actionTimeStamp":"Wed, 25 Sep 2024 13:12:20 -0400"},{"index":7,"header":"--","actionItem":"On agreeing to the Ogles amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 25 Sep 2024 13:12:09 -0400"},{"index":8,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1486, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 3.","actionTimeStamp":"Wed, 25 Sep 2024 13:05:27 -0400"},{"index":9,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 3 printed in Part B of House Report 118-705 to clarify that alternate members of the Central Committee of the Chinese Communist Party are also subject to the sanctions described in subsection (c) of Section 4.","actionTimeStamp":"Wed, 25 Sep 2024 13:05:17 -0400"},{"index":10,"header":"--","actionItem":"On agreeing to the Amo amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 25 Sep 2024 13:04:43 -0400"},{"index":11,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1486, the Committee of the Whole proceeded with 10 minutes of debate on the Amo amendment No. 2.","actionTimeStamp":"Wed, 25 Sep 2024 13:03:54 -0400"},{"index":12,"header":"--","actionItem":"An amendment, offered by Mr. Amo,  numbered 2 printed in Part B of House Report 118-705 to add engaging in efforts to interfere in U.S. federal, state, and local elections to List of Qualifications for \"SANCTIONABLE CONDUCT.\"","actionTimeStamp":"Wed, 25 Sep 2024 13:03:36 -0400"},{"index":13,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Nunn (IA) amendment No. 1, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Amo demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 25 Sep 2024 13:03:10 -0400"},{"index":14,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1486, the Committee of the Whole proceeded with 10 minutes of debate on the Nunn (IA) amendment No. 1.","actionTimeStamp":"Wed, 25 Sep 2024 12:57:19 -0400"},{"index":15,"header":"--","actionItem":"An amendment, offered by Mr. Nunn (IA),  numbered 1 printed in Part B of House Report 118-705 to add to the sanction list under section 4 any Chinese State-Owned Enterprise that knowingly manufactures or distributes any chemicals used in the production of illicit fentanyl.","actionTimeStamp":"Wed, 25 Sep 2024 12:57:09 -0400"},{"index":16,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 3334.","actionTimeStamp":"Wed, 25 Sep 2024 12:32:39 -0400"},{"index":17,"header":"--","actionItem":"The Speaker designated the Honorable Virginia Foxx to act as Chairwoman of the Committee.","actionTimeStamp":"Wed, 25 Sep 2024 12:32:04 -0400"},{"index":18,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 1486 and Rule XVIII.","actionTimeStamp":"Wed, 25 Sep 2024 12:32:03 -0400"},{"index":19,"header":"--","actionItem":"Rule provides for consideration of H.R. 3334, H.R. 8205, H.R. 8790 and H. Res. 1469. The resolution provides for consideration of H.R. 3334 and H.R. 8790 under a structured rule and H.R. 8205 and H. Res. 1469 under a closed rule. The resolution provides for one hour of general debate on each measure with one motion to recommit on H.R. 3334, H.R. 8790, and H.R. 8205.","actionTimeStamp":"Wed, 25 Sep 2024 12:32:02 -0400"},{"index":20,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 1486. H.R. 3334 — \"To provide for the imposition of sanctions on members of the National Communist Party Congress of the People's Republic of China, and for other purposes.\"","actionTimeStamp":"Wed, 25 Sep 2024 12:32:01 -0400"},{"index":21,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair would be limited to 15 per side of the aisle.","actionTimeStamp":"Wed, 25 Sep 2024 12:02:23 -0400"},{"index":22,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mrs. Lesko to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 25 Sep 2024 12:01:47 -0400"},{"index":23,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 25 Sep 2024 12:01:43 -0400"},{"index":24,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Wed, 25 Sep 2024 12:00:45 -0400"},{"index":25,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of September 25.","actionTimeStamp":"Wed, 25 Sep 2024 12:00:00 -0400"},{"index":26,"header":"--","actionItem":"The Speaker announced that the House do now recess for a period of less than 15 minutes.","actionTimeStamp":"Wed, 25 Sep 2024 11:49:36 -0400"},{"index":27,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Wed, 25 Sep 2024 10:03:08 -0400"},{"index":28,"header":"--","actionItem":"The House received a message from the Senate. The Senate passed H.R. 6513 amended.","actionTimeStamp":"Wed, 25 Sep 2024 10:02:54 -0400"},{"index":29,"header":"--","actionItem":"The Speaker designated the Honorable Greg Lopez to act as Speaker pro tempore for today.","actionTimeStamp":"Wed, 25 Sep 2024 10:02:07 -0400"},{"index":30,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 25 Sep 2024 10:00:00 -0400"}]}