{"retrieved-date":"2023-3-3","actions-date":"Wednesday, March 1, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, March  1)","actionItem":"H.J.Res. 30 (Rep. Barr):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Department of Labor relating to \"Prudence and Loyalty in Selecting Plan Investments and Exercising Shareholder Rights\".\n\n        -- Received in the Senate, read twice.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 50 - 46. Record Vote Number: 35 \n\n\n\n S. 619 (Sen. Hawley):\n        A bill to require the Director of National Intelligence to declassify information relating to the origin of COVID-19, and for other purposes.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.\n\n\n S.Res. 86 (Sen. Cruz):\n        A resolution commemorating the bicentennial of the Texas Ranger Division of the Texas Department of Public Safety, the oldest State law enforcement agency in North America, and honoring the men and women, past and present, of the Texas Rangers.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, March  1)","actionItem":"PN77:\n        Margaret R. Guzman, of Massachusetts, to be United States District Judge for the District of Massachusetts\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 49 - 48. Record Vote Number: 32 \n\n\n\n PN170:\n        Colleen R. Lawless, of Illinois, to be United States District Judge for the Central District of Illinois\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 43. Record Vote Number: 33 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate and vote 3/2/2023.\n\n\n PN171:\n        Jonathan James Canada Grey, of Michigan, to be United States District Judge for the Eastern District of Michigan\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 44. Record Vote Number: 34 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, vote 3/2/2023.\n\n\n PN175:\n        James Edward Simmons, Jr., of California, to be United States District Judge for the Southern District of California\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 45. Record Vote Number: 36 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, vote to be determined.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  7:11 p.m, the Presiding Officer (Ms. Hassan in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}