{"retrieved-date":"2024-9-18","actions-date":"Tuesday, September 17, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, September 17)","actionItem":"S. 3187 (Sen. Cornyn):\n        A bill to require the Department of Homeland Security to publish various publications and reports regarding the number of aliens seeking entry along the southern border of the United States.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 4445 (Sen. Duckworth):\n        A bill to protect and expand nationwide access to fertility treatment, including in vitro fertilization.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Motion to proceed to consideration of the motion to reconsider the vote by which cloture on the motion to proceed to S. 4445 was not invoked (Record Vote No. 197) agreed to in Senate by Voice Vote.\n\n        -- Motion by Senator Schumer to reconsider the vote by which cloture on the motion to proceed to S. 4445 was not invoked (Record Vote No. 197) agreed to in Senate by Voice Vote.\n\n        -- Upon reconsideration, cloture on the motion to proceed to the measure not invoked in Senate by Yea-Nay Vote. 51 - 44. Record Vote Number: 242 \n\n\n\n S.Res. 815 (Sen. Padilla):\n        A resolution designating the week beginning on September 9, 2024, as \"National Hispanic-Serving Institutions Week\".\n\n        -- Senate Committee on Health, Education, Labor, and Pensions discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 823 (Sen. Cortez Masto):\n        A resolution recognizing Hispanic Heritage Month and celebrating the heritage and culture of Latinos in the United States and the immense contributions of Latinos to the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, September 17)","actionItem":"PN1573:\n        Rebecca L. Pennell, of Washington, to be United States District Judge for the Eastern District of Washington\n\n        -- Cloture motion withdrawn by unanimous consent in Senate.\n\n\n PN1825:\n        Mary Kathleen Costello, of Pennsylvania, to be United States District Judge for the Eastern District of Pennsylvania\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 54 - 42. Record Vote Number: 241 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 41. Record Vote Number: 243","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Merkley, at  7:34 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}