{"retrieved-date":"2023-8-7","actions-date":"Thursday, July 27, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, July 27)","actionItem":"H.R. 2544 (Rep. Bucshon):\n        A bill to improve the Organ Procurement and Transplantation Network, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 2670 (Rep. Rogers):\n        A bill to authorize appropriations for fiscal year 2024 for military activities of the Department of Defense and for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Senate struck all after the Enacting Clause and substituted the language of S. 2226, as amended.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n        -- See also S. 2226.\n\n\n S. 788 (Sen. Boozman):\n        A bill to amend the Permanent Electronic Duck Stamp Act of 2013 to allow States to issue fully electronic stamps under that Act, and for other purposes.\n\n        -- Senate Committee on Environment and Public Works discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 1089 (Sen. Boozman):\n        In the nature of a substitute.\n\n        --Amendment SA 1089 proposed by Senator Schumer for Senator Boozman.\n\n        --Amendment SA 1089 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 992 (Sen. Cruz):\n        A bill to amend the Intermodal Surface Transportation Efficiency Act of 1991 to designate the Texas and New Mexico portions of the future Interstate-designated segments of the Port-to-Plains Corridor as Interstate Route 27, and for other purposes.\n\n        -- Senate Committee on Environment and Public Works discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 1090 (Sen. Cruz):\n        In the nature of a substitute.\n\n        --Amendment SA 1090 proposed by Senator Schumer for Senator Cruz.\n\n        --Amendment SA 1090 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 1528 (Sen. Peters):\n        A bill to streamline the sharing of information among Federal disaster assistance agencies, to expedite the delivery of life-saving assistance to disaster survivors, to speed the recovery of communities from disasters, to protect the security and privacy of information provided by disaster survivors, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee amendments agreed to by Unanimous Consent.\n\n        -- Passed Senate with amendments by Unanimous Consent.\n \n\n S.Amdt. 1088 (Sen. Peters):\n        To improve the bill.\n\n        --Amendment SA 1088 proposed by Senator Schumer for Senator Peters.\n\n        --Amendment SA 1088 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 1608 (Sen. Cornyn):\n        A bill to provide for the expansion of the Starr-Camargo Bridge near Rio Grande City, Texas, and for other purposes.\n\n        -- Senate Committee on Environment and Public Works discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 1858 (Sen. Peters):\n        A bill to amend the Robert T. Stafford Disaster Relief and Emergency Assistance Act to establish a deadline for applying for disaster unemployment assistance.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 1091 (Sen. Peters):\n        To add an applicability provision.\n\n        --Amendment SA 1091 proposed by Senator Schumer for Senator Peters.\n\n        --Amendment SA 1091 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 2226 (Sen. Reed):\n        An original bill to authorize appropriations for fiscal year 2024 for military activities of the Department of Defense, for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\n\n        -- Considered by Senate.\n\n        -- Cloture motion on the measure withdrawn by unanimous consent in Senate.\n\n        -- Passed Senate under the order of 7/27/2023, having achieved 60 votes in the affirmative, with an amendment by Yea-Nay Vote. 86 - 11. Record Vote Number: 212 \n\n\n        -- Senate incorporated this measure in H.R. 2670 as an amendment.\n\n        -- See also H.R. 2670.\n\n        -- Indefinitely postponed by Senate by Unanimous Consent.\n\n        -- Senate ordered measure printed as passed.\n \n\n S.Amdt. 230 (Sen. Young):\n        To ensure that the Department of Defense has received an unqualified opinion on its financial statements by October 1, 2027.\n\n        --Amendment SA 230 proposed by Senator Young to Amendment SA 935.\n\n        --Amendment SA 230 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 523 (Sen. Rubio):\n        To provide that sums in the Thrift Savings Fund may not be invested in securities that are listed on certain foreign exchanges.\n\n        --Amendment SA 523 proposed by Senator Rubio to Amendment SA 935.\n\n        --Amendment SA 523 under the order of 7/27/2023, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 55 - 42. Record Vote Number: \n\n\n S.Amdt. 638 (Sen. Menendez):\n        To reauthorize the Firefighter Cancer Registry Act of 2018.\n\n        --Amendment SA 638 proposed by Senator Menendez to Amendment SA 935.\n\n        --Amendment SA 638 under the order of 7/26/2023, having achieved 60 votes in the affirmative, was agreed to in Senate by Yea-Nay Vote. 96 - 2. Record Vote Number: \n\n\n S.Amdt. 705 (Sen. Cardin):\n        To identify countries that are champions in the battle to combat global corruption, and for other purposes.\n\n        --Amendment SA 705 proposed by Senator Cardin to Amendment SA 935.\n\n        --Amendment SA 705 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 874 (Sen. Marshall):\n        To prohibit the flying, draping, or other display of any flag other than the flag of the United States at public buildings.\n\n        --Amendment SA 874 proposed by Senator Marshall to Amendment SA 935.\n\n        --Amendment SA 874 under the order of 7/26/2023, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: \n\n\n S.Amdt. 935 (Sen. Reed):\n        In the nature of a substitute.\n\n        --Considered by Senate.\n\n        --Cloture motion on amendment SA 935 withdrawn by unanimous consent in Senate.\n\n        --Amendment SA 935, as amended, agreed to in Senate by Unanimous Consent.\n\n\n S.Amdt. 936 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate.\n\n        --Proposed amendment SA 936 withdrawn in Senate.\n\n\n S.Amdt. 944 (Sen. Scott, of SC):\n        To require an assessment of the impact and feasibility of restricting gifts and grants to United States institutions of higher education from entities on the Non-SDN Chinese Military-Industrial Complex Companies List.\n\n        --Amendment SA 944 proposed by Senator Scott SC to Amendment SA 935.\n\n        --Amendment SA 944 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 999 (Sen. Barrasso):\n        To require the Secretary of Energy to establish a Nuclear Fuel Security Program, expand the American Assured Fuel Supply Program, establish an HALEU for Advanced Nuclear Reactor Demonstration Projects Program, and submit a report on a civil nuclear credit program, and to enhance programs to build workforce capacity to meet critical mission needs of the Department of Energy.\n\n        --Amendment SA 999 proposed by Senator Barrasso to Amendment SA 935.\n\n        --Amendment SA 999 under the order of 7/26/2023, having achieved 60 votes in the affirmative, was agreed to in Senate by Yea-Nay Vote. 96 - 3. Record Vote Number: \n\n\n S.Amdt. 1030 (Sen. Sanders):\n        To reduce military spending.\n\n        --Amendment SA 1030 proposed by Senator Sanders to Amendment SA 935.\n\n        --Amendment SA 1030 under the order of 7/26/2023, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 11 - 88. Record Vote Number: \n\n\n S.Amdt. 1034 (Sen. Kennedy):\n        To prohibit allocations of Special Drawing Rights at the International Monetary Fund for perpetrators of genocide and state sponsors of terrorism without congressional authorization.\n\n        --Amendment SA 1034 proposed by Senator Kennedy to Amendment SA 935.\n\n        --Amendment SA 1034 under the order of 7/26/2023, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 51 - 47. Record Vote Number: \n\n\n S.Amdt. 1058 (Sen. Hawley):\n        To extend the period for filing claims under the Radiation Exposure Compensation Act and to provide for compensation under such Act for claims relating to Manhattan Project waste, and to improve compensation for workers involved in uranium mining.\n\n        --Amendment SA 1058 proposed by Senator Hawley to Amendment SA 935.\n\n        --Amendment SA 1058 under the order of 7/26/2023, having achieved 60 votes in the affirmative, was agreed to in Senate by Yea-Nay Vote. 61 - 37. Record Vote Number: \n\n\n S.Amdt. 1065 (Sen. Gillibrand):\n        To amend title XXXIII of the Public Health Service Act with respect to funding for the World Trade Center Health Program.\n\n        --Amendment SA 1065 proposed by Senator Gillibrand to Amendment SA 935.\n\n        --Amendment SA 1065 under the order of 7/26/2023, having achieved 60 votes in the affirmative, was agreed to in Senate by Yea-Nay Vote. 94 - 4. Record Vote Number: \n\n\n S.Amdt. 1078 (Sen. Schatz):\n        To reauthorize the Native American Housing Assistance and Self-Determination Act of 1996.\n\n        --Amendment SA 1078 proposed by Senator Schatz to Amendment SA 935.\n\n        --Amendment SA 1078 under the order of 7/27/2023, having achieved 60 votes in the affirmative, was agreed to in Senate by Yea-Nay Vote. 86 - 11. Record Vote Number: \n\n\n S.Amdt. 1084 (Sen. Daines):\n        To provide for the settlement of the water rights claims of the Fort Belknap Indian Community.\n\n        --Amendment SA 1084 proposed by Senator Daines to Amendment SA 935.\n\n        --Amendment SA 1084 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1087 (Sen. Reed):\n        To provide for a manager's amendment.\n\n        --Amendment SA 1087 proposed by Senator Reed to Amendment SA 935.\n\n        --Amendment SA 1087 agreed to in Senate by Yea-Nay Vote. 94 - 3. Record Vote Number: \n\n\n\n\n S.Res. 322 (Sen. Schumer):\n        A resolution commemorating the life, legacy, and entertainment career of Tony Bennett.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 323 (Sen. Grassley):\n        A resolution supporting the goals and ideals of Fentanyl Prevention and Awareness Day on August 21, 2023.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 324 (Sen. Padilla):\n        A resolution designating the week of August 6 through August 12, 2023, as \"National Farmers Market Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 325 (Sen. Coons):\n        A resolution recognizing the importance of trademarks in the economy and the role of trademarks in protecting consumer safety, by designating the month of August as \"National Anti-Counterfeiting and Consumer Education and Awareness Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 326 (Sen. Klobuchar):\n        A resolution recognizing August 23, 2023, as \"National Poll Worker Recruitment Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, July 27)","actionItem":"PN38:\n        Eric W. Kneedler, of Pennsylvania, to be Ambassador to the Republic of Rwanda\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN40:\n        Hugo Yue-Ho Yon, of California, to be Ambassador to the Republic of Maldives\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN43:\n        Kathleen A. FitzGibbon, of New York, to be Ambassador to the Republic of Niger\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN45:\n        Matthew D. Murray, of Maryland, a Career Member of the Senior Foreign Service, Class of Counselor, for the rank of Ambassador during his tenure of service as United States Senior Official for the Asia-Pacific Economic Cooperation (APEC)\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN49:\n        Ervin Jose Massinga, of Washington, to be Ambassador to the Federal Democratic Republic of Ethiopia\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN51:\n        Yael Lempert, of New York, to be Ambassador to the Hashemite Kingdom of Jordan\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN52:\n        Martina Anna Tkadlec Strong, of Texas, to be Ambassador to the United Arab Emirates\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN54:\n        Nicole D. Theriot, of Louisiana, to be Ambassador to the Co-operative Republic of Guyana\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN136:\n        Jennifer L. Johnson, of New York, a Career Member of the Senior Foreign Service, Class of Minister-Counselor,  to be Ambassador  to the Federated States of Micronesia\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN137:\n        Julie Turner, of Maryland, to be Special Envoy on North Korean Human Rights Issues, with the rank of Ambassador\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN146:\n        Gerald H. Acker, of Michigan, to be a Commissioner on the part of the United States on the International Joint Commission, United States and Canada\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN283-1:\n        3 nominations in the Foreign Service beginning with Michael J. Fitzpatrick and ending with Thomas Laszlo Vajda\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN305:\n        Robin Dunnigan, of California, to be Ambassador to Georgia\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN356:\n        5 nominations in the Foreign Service beginning with Christopher M. Cushing and ending with Ryan G. Washburn\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN357:\n        30 nominations in the Foreign Service beginning with Maura E. Barry Boyle and ending with Jaidev Singh\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN375:\n        William W. Popp, of Missouri, to be Ambassador to the Republic of Uganda\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN385:\n        Bryan David Hunt, of Virginia, to be Ambassador to the Republic of Sierra Leone\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN443:\n        Joel Ehrendreich, of New York, to be Ambassador to the Republic of Palau\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN483:\n        Nisha Desai Biswal, of Virginia, to be Deputy Chief Executive Officer of the United States International Development Finance Corporation\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN495:\n        Ali Abdi, in the Foreign Service\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN496:\n        2 nominations in the Foreign Service beginning with Mark Petry and ending with Kimberly Sawatzki\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN599:\n        83 nominations in the Air Force beginning with Julie L. Airhart and ending with Terri L. Wright\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN644:\n        Lisa DeNell Cook, of Michigan, to be a Member of the Board of Governors of the Federal Reserve System for a term of fourteen years from February 1, 2024\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN645:\n        Philip Nathan Jefferson, of North Carolina, to be Vice Chairman of the Board of Governors of the Federal Reserve System for a term of four years\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN646:\n        Adriana Debora Kugler, of Maryland, to be a Member of the Board of Governors of the Federal Reserve System for the unexpired term of fourteen years from February 1, 2012\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN647:\n        Jack A. Markell, of Delaware, to be Ambassador to the Italian Republic, and to serve concurrently and without additional compensation as Ambassador to the Republic of San Marino\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN673:\n        Anna M. Gomez, of Virginia, to be a Member of the Federal Communications Commission for a term of five years from July 1, 2021\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN696:\n        30 nominations in the Air Force beginning with Justin V. Ahrens and ending with Ryan E. Wilson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN737:\n        100 nominations in the Foreign Service beginning with Ihuoma A. Akamiro and ending with Jeffrey Paul Lodinsky\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN743:\n        Gwynne A. Wilcox, of New York, to be a Member of the National Labor Relations Board for the term of five years expiring August 27, 2028\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN777:\n        Oliver E. Barfield, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN778:\n        2 nominations in the Air Force beginning with Ashley L. Shull and ending with Sean M. Williams\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN779:\n        73 nominations in the Air Force beginning with Ronald Mark Alligood and ending with Matthew David Woolums\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN780:\n        158 nominations in the Air Force beginning with Brian Charles Anderson and ending with Jerry Wayne Zollman, Jr.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN781:\n        Paul A. Stelzer, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN783:\n        Leron E. Lane, in the Marine Corps, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN784:\n        Andres S. Piscoya, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN789:\n        Andrew R. Updike, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN791:\n        Erica L. Kane, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN792:\n        31 nominations in the Army beginning with Joshua T. Ade and ending with Everett E. Zachary\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN793:\n        William M. Schweitzer, in the Marine Corps, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN839:\n        Ryan C. Boyle, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN840:\n        359 nominations in the Air Force beginning with Feysel A. Abdulkaf and ending with Nancy M. Zimmerman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN841:\n        49 nominations in the Air Force beginning with Scott A. Abuso and ending with Robert Zavala, Jr.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN842:\n        391 nominations in the Air Force beginning with Nanlisha T. Abdullai and ending with Steven Zimmer\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN843:\n        160 nominations in the Air Force beginning with Matthew N. Alombro and ending with Garrett C. Zupan\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN844:\n        1201 nominations in the Air Force beginning with Kevin B. Abbott and ending with Kaitlin E. Zito\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN845:\n        James H. Gutzman, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN846:\n        53 nominations in the Air Force beginning with Danielle N. Anderson and ending with Brian J. Welch\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN847:\n        Ryan C. Caguillo, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN848:\n        Mary M. Gutierrez, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN849:\n        Edward W. Hale, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN850:\n        Charles K. Djou, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN851:\n        Nicholas C. Molczyk, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN852:\n        David Hernandez, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN853:\n        Clydellia S. Prichard-Allen, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN854:\n        Espada J. Ruiz, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN856:\n        4 nominations in the Navy beginning with Mary M. Ayres and ending with Rebecca M. Rieger\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN857:\n        Daniel I. Morrison, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN858:\n        Alan A. Gutberlet, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN859:\n        Guillermo M. Arguello, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN860:\n        Christopher S. Williams, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN861:\n        Kristopher M. Brazil, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN862:\n        10 nominations in the Navy beginning with Joshua P. Corbin and ending with Nathan S. Wemett\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN863:\n        14 nominations in the Navy beginning with Nicholas B. Artabazon and ending with Sara A. Zanitsch\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN864:\n        39 nominations in the Navy beginning with Mary H. Baker and ending with Trent A. Warner\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN865:\n        Peter J. Maculan, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at 11:04 p.m., the Senate adjourned, under its order of today, until 11:45 a.m. tomorrow.","actionTimeStamp":"--"}]}