{"retrieved-date":"2025-10-29","actions-date":"Tuesday, October 28, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, October 28)","actionItem":"H.R. 5371 (Rep. Cole):\n        A bill making continuing appropriations and extensions for fiscal year 2026, and for other purposes .\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Motion to proceed to consideration of the motion to reconsider the vote by which the fourth cloture on the motion to proceed to H.R. 5371 was not invoked (Record Vote No. 571) agreed to in Senate by Voice Vote.\n\n        -- Motion by Senator Thune to reconsider the vote by which the fourth cloture on the motion to proceed to H.R. 5371 was not invoked (Record Vote No. 571) agreed to in Senate by Voice Vote.\n\n        -- Upon reconsideration, the fourth cloture on the motion to proceed to H.R. 5371 not invoked in Senate by Yea-Nay Vote. 54 - 45. Record Vote Number: 590 \n\n\n\n S.J.Res. 81 (Sen. Kaine):\n        A joint resolution terminating the national emergency declared to impose duties on articles imported from Brazil .\n\n        -- Senate Committee on Finance discharged pursuant to the order of 10/07/2025.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 52 - 48. Record Vote Number: 594 \n\n\n\n S.Res. 454 (Sen. Welch):\n        A resolution expressing support for the designation of the week of October 24, 2025, to October 31, 2025, as \"Bat Week\".\n\n        -- Senate Committee on Environment and Public Works discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 471 (Sen. Cassidy):\n        A resolution calling on Congress, schools, and State and local educational agencies to recognize the significant educational implications of dyslexia that must be addressed, and designating October 2025 as \"National Dyslexia Awareness Month\" .\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, October 28)","actionItem":"PN346-6:\n        Jordan Emery Pratt, of Florida, to be United States District Judge for the Middle District of Florida\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 47. Record Vote Number: 591 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 47. Record Vote Number: 592 \n\n\n\n PN400-1:\n        Joshua D. Dunlap, of Maine, to be United States Circuit Judge for the First Circuit\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN466-2:\n        Edmund G. LaCour, Jr., of Alabama, to be United States District Judge for the Northern District of Alabama\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 46. Record Vote Number: 593 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, vote 10/29/2025.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  7:17 p.m, the Presiding Officer (Mr. Curtis in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow .","actionTimeStamp":"--"}]}