{"retrieved-date":"2024-3-18","actions-date":"Thursday, March 14, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Tuesday, March 12, 2024,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Tuesday, March 12, 2024, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, March 14)","actionItem":"H.Con.Res. 84 (Rep. Kuster):\n        A concurrent resolution authorizing the use of Emancipation Hall in the Capitol Visitor Center for a ceremony to present the Congressional Gold Medal collectively to the 23d Headquarters Special Troops and the 3133d Signal Services Company, known collectively as the \"Ghost Army\", in recognition of unique and highly distinguished service during World War II.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, March 14)","actionItem":"PN675:\n        Dennis B. Hankins, of Minnesota, to be Ambassador to the Republic of Haiti\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 89 - 1. Record Vote Number: 92 \n\n\n\n PN1241:\n        Nicole G. Berner, of Maryland, to be United States Circuit Judge for the Fourth Circuit\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 48 - 40. Record Vote Number: 93 \n\n\n        -- By unanimous consent agreement, debate and vote 3/19/2024.\n\n\n PN1245:\n        Edward Sunyol Kiel, of New Jersey, to be United States District Judge for the District of New Jersey\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN1248:\n        Eumi K. Lee, of California, to be United States District Judge for the Northern District of California\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  5:00 p.m, the Presiding Officer (Mr. Fetterman in the chair) declared the Senate adjourned, under its order of today, until  9:25 a.m. tomorrow.","actionTimeStamp":"--"}]}