{"retrieved-date":"2023-4-26","actions-date":"Tuesday, April 25, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Friday, April 21, 2023,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Friday, April 21, 2023, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, April 25)","actionItem":"S.J.Res. 4 (Sen. Cardin):\n        A joint resolution removing the deadline for the ratification of the Equal Rights Amendment.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, April 25)","actionItem":"PN89:\n        Anthony Devos Johnstone, of Montana, to be United States Circuit Judge for the Ninth Circuit\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN195:\n        Joshua David Jacobs, of Washington, to be Under Secretary for Benefits of the Department of Veterans Affairs\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 72 - 22. Record Vote Number: 95 \n\n\n        -- By unanimous consent agreement, debate 4/26/2023.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Menendez, at 6:39 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}