{"retrieved-date":"2023-11-9","actions-date":"Thu, 09 Nov 2023 09:47:25 -0500","actions-title":"House Floor Proceedings","actions-count":18,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Williams (TX) amendment No. 104.","actionTimeStamp":"Thu, 09 Nov 2023 09:47:25 -0500"},{"index":2,"header":"--","actionItem":"An amendment, offered by Mr. Williams (TX),  numbered 104 printed in Part B of House Report 118-269 to prohibit funding for the Small Business Administration to create any new business lending program.","actionTimeStamp":"Thu, 09 Nov 2023 09:47:04 -0500"},{"index":3,"header":"--","actionItem":"On agreeing to the Wagner amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 09 Nov 2023 09:46:43 -0500"},{"index":4,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Wagner amendment No. 102.","actionTimeStamp":"Thu, 09 Nov 2023 09:39:37 -0500"},{"index":5,"header":"--","actionItem":"An amendment, offered by Mrs. Wagner,  numbered 102 printed in Part B of House Report 118-269 to prohibit funding to finalize or implement the proposed interpretive guidance of the Financial Stability Oversight Council titled \"Authority To Require Supervision and Regulation of Certain Nonbank Financial Companies.\"","actionTimeStamp":"Thu, 09 Nov 2023 09:39:26 -0500"},{"index":6,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Tenney amendment No. 101, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Tenney demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 09 Nov 2023 09:38:49 -0500"},{"index":7,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Tenney amendment No. 101.","actionTimeStamp":"Thu, 09 Nov 2023 09:30:58 -0500"},{"index":8,"header":"--","actionItem":"An amendment, offered by Ms. Tenney,  numbered 101 printed in Part B of House Report 118-269 to prohibit funding to finalize, implement, or enforce the FAR Council's proposed \"Federal Acquisition Regulation: Disclosure of Greenhouse Gas Emissions and Climate-Related Financial Risk\" rule.","actionTimeStamp":"Thu, 09 Nov 2023 09:30:46 -0500"},{"index":9,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Tenney amendment No. 100, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Hoyer demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 09 Nov 2023 09:25:26 -0500"},{"index":10,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Tenney amendment No. 100.","actionTimeStamp":"Thu, 09 Nov 2023 09:21:07 -0500"},{"index":11,"header":"--","actionItem":"An amendment, offered by Ms. Tenney,  numbered 100 printed in Part B of House Report 118-269 to reduce the salary of White House Press Secretary Karine Jean-Pierre to $1.","actionTimeStamp":"Thu, 09 Nov 2023 09:20:56 -0500"},{"index":12,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Thu, 09 Nov 2023 09:19:58 -0500"},{"index":13,"header":"--","actionItem":"Considered as unfinished business. H.R. 4664 — \"Making appropriations for financial services and general government for the fiscal year ending September 30, 2024, and for other purposes.\"","actionTimeStamp":"Thu, 09 Nov 2023 09:19:39 -0500"},{"index":14,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair would be limited to 5 per side of the aisle.","actionTimeStamp":"Thu, 09 Nov 2023 09:06:06 -0500"},{"index":15,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Kildee to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 09 Nov 2023 09:04:35 -0500"},{"index":16,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Thu, 09 Nov 2023 09:04:30 -0500"},{"index":17,"header":"--","actionItem":"Today's prayer was offered by His Holiness Aram the First Catholicos, Armenian Apostolic Church of the Holy See of Cilicia.","actionTimeStamp":"Thu, 09 Nov 2023 09:01:11 -0500"},{"index":18,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 09 Nov 2023 09:00:00 -0500"}]}