{"retrieved-date":"2023-6-23","actions-date":"Fri, 23 Jun 2023 10:29:20 -0400","actions-title":"House Floor Proceedings","actions-count":22,"actions-list":[{"index":1,"header":"On agreeing to the Pettersen amendment (A004) Roll Call 287","actionItem":"Recorded vote pending.","actionTimeStamp":"Fri, 23 Jun 2023 10:29:20 -0400"},{"index":2,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 524, the Committee of the Whole proceeded with 10 minutes of debate on the Pettersen amendment No. 4.","actionTimeStamp":"Fri, 23 Jun 2023 10:22:21 -0400"},{"index":3,"header":"--","actionItem":"An amendment, offered by Ms. Pettersen,  numbered 4 printed in House Report 118-115 to prevent the legislation from being enacted if the FHFA Director determines that Sec. 2 would increase fees on middle class borrowers.","actionTimeStamp":"Fri, 23 Jun 2023 10:20:48 -0400"},{"index":4,"header":"--","actionItem":"On agreeing to the Lee (NV) amendment; Agreed to by voice vote.","actionTimeStamp":"Fri, 23 Jun 2023 10:20:33 -0400"},{"index":5,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 524, the Committee of the Whole proceeded with 10 minutes of debate on the Lee (NV) amendment No. 3.","actionTimeStamp":"Fri, 23 Jun 2023 10:17:50 -0400"},{"index":6,"header":"--","actionItem":"An amendment, offered by Ms. Lee (NV),  numbered 3 printed in Part B of House Report 118-115 to require that the GAO study assess the recalibrated single-family pricing framework's impact on affordable housing preservation, rural housing, and manufactured housing.","actionTimeStamp":"Fri, 23 Jun 2023 10:16:57 -0400"},{"index":7,"header":"--","actionItem":"On agreeing to the Lee (NV) amendment; Agreed to by voice vote.","actionTimeStamp":"Fri, 23 Jun 2023 10:16:41 -0400"},{"index":8,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 524, the Committee of the Whole proceeded with 10 minutes of debate on the Lee (NV) amendment No. 2.","actionTimeStamp":"Fri, 23 Jun 2023 10:11:53 -0400"},{"index":9,"header":"--","actionItem":"An amendment, offered by Ms. Lee (NV),  numbered 2 printed in Part B of House Report 118-115 to require that the GAO study assess the recalibrated single-family pricing frameworks impact on first-time, low-income homebuyers.","actionTimeStamp":"Fri, 23 Jun 2023 10:11:40 -0400"},{"index":10,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Fri, 23 Jun 2023 10:11:28 -0400"},{"index":11,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 524, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 1.","actionTimeStamp":"Fri, 23 Jun 2023 10:07:00 -0400"},{"index":12,"header":"--","actionItem":"An amendment, offered by Mrs. Boebert,  numbered 1 printed in Part B of House Report 118-115 to require the GAO Study in Section 5 to also be made available to the public online.","actionTimeStamp":"Fri, 23 Jun 2023 10:06:10 -0400"},{"index":13,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 3564.","actionTimeStamp":"Fri, 23 Jun 2023 09:17:06 -0400"},{"index":14,"header":"--","actionItem":"The Speaker designated the Honorable Dan Newhouse to act as Chairman of the Committee.","actionTimeStamp":"Fri, 23 Jun 2023 09:16:56 -0400"},{"index":15,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 524 and Rule XVIII.","actionTimeStamp":"Fri, 23 Jun 2023 09:16:56 -0400"},{"index":16,"header":"--","actionItem":"Rule provides for consideration of H.R. 3564, H.R. 3799 and H. Res. 461. The resolution provides for consideration of H.R. 3564 under a structured rule with one hour of general debate; H.R. 3799 under a structured rule with eighty minutes of general debate; and H. Res. 461, under a closed rule with one hour of general debate. The resolution provides for a motion to recommit on H.R. 3564 and H.R. 3799.","actionTimeStamp":"Fri, 23 Jun 2023 09:16:35 -0400"},{"index":17,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 524. H.R. 3564 — \"To cancel recent changes made by the Federal Housing Finance Agency to the up-front loan level pricing adjustments charged by Fannie Mae and Freddie Mac for guarantee of single-family mortgages, and for other purposes.\"","actionTimeStamp":"Fri, 23 Jun 2023 09:16:30 -0400"},{"index":18,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair, would be limited to 5 per side of the aisle.","actionTimeStamp":"Fri, 23 Jun 2023 09:04:51 -0400"},{"index":19,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Carl to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Fri, 23 Jun 2023 09:03:06 -0400"},{"index":20,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Fri, 23 Jun 2023 09:03:02 -0400"},{"index":21,"header":"--","actionItem":"Today's prayer was offered by Pastor David Bullock, Luke 4:18 Fellowship, Mobile, Alabama.","actionTimeStamp":"Fri, 23 Jun 2023 09:01:00 -0400"},{"index":22,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Fri, 23 Jun 2023 09:00:00 -0400"}]}