{"retrieved-date":"2024-7-12","actions-date":"Thursday, July 11, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, July 11)","actionItem":"H.R. 1105 (Rep. Wagner):\n        A bill to amend the DNA Analysis Backlog Elimination Act of 2000 to reauthorize the Debbie Smith DNA Backlog Grant Program, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 150 (Sen. Cornyn):\n        A bill to amend the Federal Trade Commission Act to prohibit product hopping, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 2399 (Sen. Cornyn):\n        In the nature of a substitute.\n\n        --Amendment SA 2399 proposed by Senator Cornyn.\n\n        --Amendment SA 2399 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 159 (Sen. Cornyn):\n        A bill to amend the Internal Revenue Code of 1986 to provide an exemption from gross income for mandatory restitution or civil damages as recompense for trafficking in persons.\n\n        -- Senate Committee on Finance discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 3068 (Sen. Braun):\n        A bill to require each enterprise to include on the Uniform Residential Loan Application a disclaimer to increase awareness of the direct and guaranteed home loan programs of the Department of Veterans Affairs, and for other purposes.\n\n        -- Senate Committee on Banking, Housing, and Urban Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 4351 (Sen. Murray):\n        A bill to amend the Public Health Service Act to reauthorize certain poison control programs.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 4554 (Sen. Murray):\n        A bill to express support for protecting access to reproductive health care after the Dobbs v. Jackson decision on June 24, 2022.\n\n        -- Motion to proceed to measure considered in Senate.\n\n\n S.J.Res. 89 (Sen. Cruz):\n        A joint resolution to direct the termination of the use of United States Armed Forces for the construction, maintenance, and operation of the Joint Logistics Over-the-Shore pier on the coast of the Gaza Strip that has not been authorized by Congress .\n\n        -- Point of order that the measure is not entitled to expedited procedures under 50 U.S.C. 1546(a) against the measure agreed to in Senate by Yea-Nay Vote. 48 - 46. Record Vote Number: 212 \n\n\n\n S.Res. 765 (Sen. Lankford):\n        A resolution relating to the death of the Honorable James Mountain Inhofe, former Senator for the State of Oklahoma .\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 766 (Sen. Klobuchar):\n        A resolution recognizing September 17, 2024, as \"National Voter Registration Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, July 11)","actionItem":"PN1293:\n        Robin Michelle Meriweather, of Virginia, to be a Judge of the United States Court of Federal Claims for a term of fifteen years\n\n        -- By unanimous consent agreement, debate and vote today.\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 39. Record Vote Number: 213 \n\n\n\n PN1344:\n        Margaret L. Taylor, of Maryland, to be Legal Adviser of the Department of State\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII be waived.\n\n\n PN1400:\n        Kashi Way, of Maryland, to be a Judge of the United States Tax Court for a term of fifteen years\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII be waived.\n\n        -- By unanimous consent agreement, debate 7/23/2024.\n\n\n PN1401:\n        Adam B. Landy, of South Carolina, to be a Judge of the United States Tax Court for a term of fifteen years\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII be waived.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  4:49 p.m., the Senate adjourned, under its order of today, until 11:15 a.m. on Monday, July 15, 2024.","actionTimeStamp":"--"}]}