{"retrieved-date":"2024-11-19","actions-date":"Thursday, November 14, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, November 14)","actionItem":"H.R. 6324 (Rep. Bost):\n        A bill to authorize major medical facility projects for the Department of Veterans Affairs for fiscal year 2024, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S. 4716 (Sen. Peters):\n        A bill to amend section 7504 of title 31, United States Code, to improve the single audit requirements.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S.Res. 874 (Sen. Scott, of FL):\n        A resolution honoring the Southeast Region Little League baseball team from Lake Mary, Florida, for winning the 2024 Little League Baseball World Series.\n\n        -- Senate Committee on Commerce, Science, and Transportation discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 889 (Sen. Murray):\n        A resolution designating October 30, 2024, as a national day of remembrance for the workers of the nuclear weapons program of the United States.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, November 14)","actionItem":"PN923:\n        David Huitema, of Maryland, to be Director of the Office of Government Ethics for a term of five years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 46. Record Vote Number: 262 \n\n\n\n PN1244:\n        Mustafa Taher Kasubhai, of Oregon, to be United States District Judge for the District of Oregon\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN1253:\n        Sarah French Russell, of Connecticut, to be United States District Judge for the District of Connecticut\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN1573:\n        Rebecca L. Pennell, of Washington, to be United States District Judge for the Eastern District of Washington\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN1744:\n        Cathy Fung, of California, to be a Judge of the United States Tax Court for a term of fifteen years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 59 - 37. Record Vote Number: 261 \n\n\n\n PN1749:\n        Embry J. Kidd, of Florida, to be United States Circuit Judge for the Eleventh Circuit\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 49 - 44. Record Vote Number: 263 \n\n\n        -- By unanimous consent agreement, debate 11/18/2024.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  3:47 p.m., the Senate adjourned, under its order of today, until  3 p.m. on Monday, November 18, 2024.","actionTimeStamp":"--"}]}