{"retrieved-date":"2023-11-10","actions-date":"Thursday, November 9, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, November  9)","actionItem":"H.R. 815 (Rep. Rodgers):\n        A bill to amend title 38, United States Code, to make certain improvements relating to the eligibility of veterans to receive reimbursement for emergency treatment furnished through the Veterans Community Care program, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.\n\n\n S.Res. 408 (Sen. Rosen):\n        A resolution condemning Hamas for its premeditated , coordinated, and brutal terrorist attacks on Israel and demanding that Hamas immediately release all hostages and return them to safety, and for other purposes.\n\n        -- Senate Committee on Foreign Relations discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Resolution agreed to in Senate with an amendment and an amended preamble by Unanimous Consent.\n \n\n S.Amdt. 1364 (Sen. Rosen):\n        In the nature of a substitute.\n\n        --Amendment SA 1364 proposed by Senator Kaine for Senator Rosen.\n\n        --Amendment SA 1364 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 459 (Sen. Schatz):\n        A resolution recognizing National Native American Heritage Month and celebrating the heritages and cultures of Native Americans and the contributions of Native Americans to the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, November  9)","actionItem":"PN165:\n        Monica Ramirez Almadani, of California, to be United States District Judge for the Central District of California\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 44. Record Vote Number: 305 \n\n\n\n PN499:\n        Ana de Alba, of California, to be United States Circuit Judge for the Ninth Circuit\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 49 - 42. Record Vote Number: 307 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate 11/13/2023.\n\n\n PN813:\n        Brandy R. McMillion, of Michigan, to be United States District Judge for the Eastern District of Michigan\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 42. Record Vote Number: 306","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Kaine, at  4:28 p.m., the Senate adjourned, under its order of today, until  3 p.m. on Monday, November 13, 2023.","actionTimeStamp":"--"}]}