{"retrieved-date":"2024-7-11","actions-date":"Wednesday, July 10, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday,the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, July 10)","actionItem":"H.R. 3019 (Rep. McBath):\n        A bill to establish an inspections regime for the Bureau of Prisons, and for other purposes.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 412 (Sen. Klobuchar):\n        A bill to provide that it is unlawful to knowinglydistribute private intimate visual depictions with reckless disregard for the individual's lack of consent to the distribution, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute withdrawn by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Voice Vote.\n \n\n S.Amdt. 2248 (Sen. Klobuchar):\n        In the nature of a substitute.\n\n        --Amendment SA 2248 proposed by Senator Welch for Senator Klobuchar.\n\n        --Amendment SA 2248 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 612 (Sen. Cortez Masto):\n        A bill to reauthorize the Lake Tahoe Restoration Act, and for other purposes.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n S. 912 (Sen. Barrasso):\n        A bill to require the Secretary of Energy to provide technology grants to strengthen domestic mining education, and for other purposes.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n S. 4554 (Sen. Murray):\n        A bill to express support for protecting access toreproductive health care after the Dobbs v. Jackson decision on June 24, 2022.\n\n        -- Motion to proceed to consideration of measure in Senate.\n\n        -- Cloture on the motion to proceed to the measure not invoked in Senate by Yea-Nay Vote. 49 - 44. Record Vote Number: 211 \n\n\n        -- Motion by Senator Schumer to reconsider the vote by which cloture on the motion to proceed to the measure was not invoked (Record Vote No. 211) madein Senate.\n\n\n S.Res. 746 (Sen. Rubio):\n        A resolution commemorating the passage of 3 years since the tragic building collapse in Surfside, Florida, on June 24, 2021.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 760 (Sen. Cortez Masto):\n        A resolution expressing support for the designation of July 10, 2024, as Journeyman Lineworkers Recognition Day.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 761 (Sen. Sullivan):\n        A resolution expressing support for the designation of the month of June 2024 as \"National Post-Traumatic Stress Awareness Month\" and June 27, 2024, as \"National Post-Traumatic Stress Awareness Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 762 (Sen. Barrasso):\n        A resolution designating July 27, 2024, as \"National Day of the American Cowboy\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, July 10)","actionItem":"PN1236:\n        Colleen Duffy Kiko, of North Dakota, to be a Member of the Federal Labor Relations Authority for a term of five years expiring July 29, 2027\n\n        -- Cloture motion withdrawn by unanimous consent in Senate.\n\n        -- By unanimous consent agreement, vote to be determined.\n\n\n PN1351:\n        Danny Lam Hoan Nguyen, of the District of Columbia, to be an Associate Judge of the Superior Court of the District of Columbia for the term of fifteen years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1355:\n        Charles J. Willoughby, Jr., of the District of Columbia, to be an Associate Judge of the Superior Court of the District ofColumbia for the term of fifteen years, William M. Jackson, retired\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 43. Record Vote Number: 208 \n\n\n\n PN1357:\n        Anne Marie Wagner, of Virginia, to be a Member of the Federal Labor Relations Authority for a term of five years expiring July 1, 2029\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 55 - 38. Record Vote Number: 209 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 55 - 37. Record Vote Number: 210","actionTimeStamp":"--"},{"index":6,"header":"Recess","actionItem":"By unanimous consent, on the request of Mr. Welch, at  6:53 p.m., the Senate recessed, under its order of today, until 10a.m. tomorrow.","actionTimeStamp":"--"}]}