{"retrieved-date":"2023-5-22","actions-date":"Mon, 22 May 2023 14:13:31 -0400","actions-title":"House Floor Proceedings","actions-count":16,"actions-list":[{"index":1,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is subject to the call of the Chair.","actionTimeStamp":"Mon, 22 May 2023 14:13:31 -0400"},{"index":2,"header":"Commission on Reform and Modernization of the Department of State","actionItem":"Pursuant to section 9803(d)(1)(C) and (E) of the James M. Inhofe National Defense Authorization Act for Fiscal Year 2023 (Public Law 117-263), the Democratic Leader appointed the following member of the House to the Commission on Reform and Modernization of the Department of State: Mr. Quigley.","actionTimeStamp":"Mon, 22 May 2023 14:13:01 -0400"},{"index":3,"header":"Board of Visitors to the United States Naval Academy","actionItem":"Pursuant to 10 U.S.C. 8468(a), and the order of the House of January 9, 2023, the Speaker appointed the following member of the House to the Board of Visitors to the United States Naval Academy: Mr. Ruppersberger.","actionTimeStamp":"Mon, 22 May 2023 14:12:25 -0400"},{"index":4,"header":"Health Information Technology Advisory Committee","actionItem":"Pursuant to section 4003(e) of the 21st Century Cures Act (Public Law 114-255), and the order of the House of January 9, 2023, the Speaker appointed Dr. Jim Jirjis, Nashville, Tennessee.","actionTimeStamp":"Mon, 22 May 2023 14:12:10 -0400"},{"index":5,"header":"Board of Visitors to the United States Air Force Academy","actionItem":"Pursuant to 10 U.S.C. 9455(a), and the order of the House of January 9, 2023, the Speaker appointed the following member of the House to the Board of Visitors to the United States Air Force Academy: Mr. Davis of North Carolina.","actionTimeStamp":"Mon, 22 May 2023 14:11:26 -0400"},{"index":6,"header":"Board of Visitors to the United States Coast Guard Academy","actionItem":"Pursuant to 14 U.S.C. 1903(b), and the order of the House of January 9, 2023, the Speaker appointed the following member of the House to the Board of Visitors to the United States Coast Guard Academy: Mr. Courtney.","actionTimeStamp":"Mon, 22 May 2023 14:11:08 -0400"},{"index":7,"header":"--","actionItem":"The House received a message from the Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Representatives, the Clerk received the following message from the Secretary of the Senate on May 18, 2023, at 4:02 p.m.: That the Senate passed S.J. Res. 18.","actionTimeStamp":"Mon, 22 May 2023 14:10:49 -0400"},{"index":8,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches.","actionTimeStamp":"Mon, 22 May 2023 14:03:00 -0400"},{"index":9,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Allen to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Mon, 22 May 2023 14:02:53 -0400"},{"index":10,"header":"SPEAKER'S APPROVAL OF THE JOURNAL","actionItem":"The Chair announced that he had examined the Journal of the last day's proceedings and had approved it. Mr. Allen demanded that the question be put on agreeing to the Speaker's approval of the Journal and by voice vote, the Chair announced that the ayes had prevailed. Mr. Allen objected to the voice vote based upon the absence of a quorum and the Chair postponed further proceedings on the question of agreeing to the Speaker's approval of the Journal until a time to be announced.","actionTimeStamp":"Mon, 22 May 2023 14:02:04 -0400"},{"index":11,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Mon, 22 May 2023 14:00:04 -0400"},{"index":12,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of May 22.","actionTimeStamp":"Mon, 22 May 2023 14:00:00 -0400"},{"index":13,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 2:00 P.M. today.","actionTimeStamp":"Mon, 22 May 2023 12:17:00 -0400"},{"index":14,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 2:00 p.m. for the start of legislative business.","actionTimeStamp":"Mon, 22 May 2023 12:00:27 -0400"},{"index":15,"header":"--","actionItem":"The Speaker designated the Honorable Barry Moore to act as Speaker pro tempore for today.","actionTimeStamp":"Mon, 22 May 2023 12:00:07 -0400"},{"index":16,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Mon, 22 May 2023 12:00:00 -0400"}]}