{"retrieved-date":"2023-12-21","actions-date":"Wednesday, December 20, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, December 20)","actionItem":"S.Res. 517 (Sen. Brown):\n        A resolution congratulating the Columbus Crew for winning the 2023 Major League Soccer Cup.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, December 20)","actionItem":"PN548:\n        Tobin John Bradley, of California, to be Ambassador to the Republic of Guatemala\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN740:\n        Mark Toshiro Uyeda, of California, to be a Member of the Securities and Exchange Commission for a term expiring June 5, 2028\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN742:\n        David E. White, Jr., of New York, to be Deputy Director of the Peace Corps\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN805:\n        Bradford Pentony Wilson, of New Jersey, to be a Member of the Board of Trustees of the James Madison Memorial Fellowship Foundation for a term expiring September 27, 2026\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN831:\n        Claudia Slacik, of New York, to be a Director of the Securities Investor Protection Corporation for a term expiring December 31, 2026\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN832:\n        Tadd M. Johnson, of Minnesota, to be a Member of the Board of Trustees of the Morris K. Udall and Stewart L. Udall Foundation for a term expiring October 6, 2028\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN871:\n        Rion J. Ramirez, of Washington, to be a Member of the Board of Trustees of the Morris K. Udall and Stewart L. Udall Foundation for a term expiring May 26, 2025\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN918:\n        William Brodsky, of Illinois, to be a Director of the Securities Investor Protection Corporation for a term expiring December 31, 2026\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1025:\n        Jennifer L. Fain, of Virginia, to be Inspector General, Federal Deposit Insurance Corporation\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1044:\n        Spencer Bachus III, of Alabama, to be a Member of the Board of Directors of the Export-Import Bank of the United States for a term expiring January 20, 2027\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1045:\n        Tanya F. Otsuka, of Virginia, to be a Member of the National Credit Union Administration Board for a term expiring August 2 , 2029\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schatz, at  6:27 p.m., the Senate adjourned, under its order of today, until  8 a.m. on Friday, December 22, 2023.","actionTimeStamp":"--"}]}