{"retrieved-date":"2023-7-19","actions-date":"Wed, 19 Jul 2023 13:49:16 -0400","actions-title":"House Floor Proceedings","actions-count":20,"actions-list":[{"index":1,"header":"--","actionItem":"On agreeing to the Graves (MO) amendments Agreed to by voice vote.","actionTimeStamp":"Wed, 19 Jul 2023 13:49:16 -0400"},{"index":2,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 597, the Committee of the Whole proceeded with 30 minutes of debate on the Graves (MO) amendment en bloc No. 1.","actionTimeStamp":"Wed, 19 Jul 2023 13:44:18 -0400"},{"index":3,"header":"--","actionItem":"Amendments en bloc  offered by Mr. Graves (MO),  comprised of the following amendments printed in Part A of House Report 118-147 as en bloc No. 1: Nos. 2, 5, 8, 9, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 24, and 25.","actionTimeStamp":"Wed, 19 Jul 2023 13:43:59 -0400"},{"index":4,"header":"--","actionItem":"On agreeing to the Graves (MO) amendment Agreed to by voice vote.","actionTimeStamp":"Wed, 19 Jul 2023 13:43:29 -0400"},{"index":5,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 597, the Committee of the Whole proceeded with 10 minutes of debate on the Graves (MO) amendment No. 1.","actionTimeStamp":"Wed, 19 Jul 2023 13:40:31 -0400"},{"index":6,"header":"--","actionItem":"An amendment, offered by Mr. Graves (MO),  numbered 1 printed in Part A of House Report 118-147 to make technical, conforming, and clarifying changes throughout the bill.","actionTimeStamp":"Wed, 19 Jul 2023 13:40:18 -0400"},{"index":7,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 3935.","actionTimeStamp":"Wed, 19 Jul 2023 12:38:04 -0400"},{"index":8,"header":"--","actionItem":"The Speaker designated the Honorable Andrew R. Garbarino to act as Chairman of the Committee.","actionTimeStamp":"Wed, 19 Jul 2023 12:37:49 -0400"},{"index":9,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 597 and Rule XVIII.","actionTimeStamp":"Wed, 19 Jul 2023 12:37:48 -0400"},{"index":10,"header":"--","actionItem":"Rule provides for consideration of H.R. 3935 and H.R. 3941. The resolution provides for consideration of H.R. 3935 and H.R. 3941 both under a structured rule with one hour of general debate. The resolution provides for a motion to recommit on each measure.","actionTimeStamp":"Wed, 19 Jul 2023 12:37:25 -0400"},{"index":11,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 597. H.R. 3935 — \"To amend title 49, United States Code, to reauthorize and improve the Federal Aviation Administration and other civil aviation programs, and for other purposes.\"","actionTimeStamp":"Wed, 19 Jul 2023 12:37:20 -0400"},{"index":12,"header":"PRINTING OF PROCEEDINGS IN RECORD","actionItem":"Mr. Graves (MO) asked unanimous consent that the proceedings had during the recess be printed in the Congressional Record of today. Agreed to without objection.","actionTimeStamp":"Wed, 19 Jul 2023 12:37:15 -0400"},{"index":13,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of July 19.","actionTimeStamp":"Wed, 19 Jul 2023 12:37:02 -0400"},{"index":14,"header":"JOINT MEETING DISSOLVED","actionItem":"The Speaker announced that the Joint Meeting was dissolved. The House remains in recess subject to the call of the Chair.","actionTimeStamp":"Wed, 19 Jul 2023 11:54:15 -0400"},{"index":15,"header":"JOINT MEETING","actionItem":"The House convened in Joint Meeting with the Senate to receive an address by His Excellency Isaac Herzog, President of the State of Israel.","actionTimeStamp":"Wed, 19 Jul 2023 10:37:51 -0400"},{"index":16,"header":"--","actionItem":"The Speaker announced that the House do now recess. Pursuant to a previous order of the House, the House will reconvene for a Joint Meeting with the Senate for the purpose of receiving His Excellency Isaac Herzog, President of the State of Israel.","actionTimeStamp":"Wed, 19 Jul 2023 09:03:31 -0400"},{"index":17,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair led the House in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 19 Jul 2023 09:02:03 -0400"},{"index":18,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 19 Jul 2023 09:01:58 -0400"},{"index":19,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Wed, 19 Jul 2023 09:00:21 -0400"},{"index":20,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 19 Jul 2023 09:00:00 -0400"}]}