{"retrieved-date":"2025-10-30","actions-date":"Wednesday, October 29, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, October 29)","actionItem":"H.R. 5371 (Rep. Cole):\n        A bill making continuing appropriations and extensions for fiscal year 2026, and for other purposes .\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n\n S.J.Res. 69 (Sen. Kennedy):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the United States Fish and Wildlife Service relating to \"Record of Decision for the Barred Owl Management Strategy; Washington, Oregon, and California\".\n\n        -- Motion to proceed to consideration of measure rejected in Senate by Yea-Nay Vote. 25 - 72. Record Vote Number: 597 \n\n\n\n S.J.Res. 77 (Sen. Kaine):\n        A joint resolution terminating the national emergency declared to impose duties on articles imported from Canada .\n\n        -- Senate Committee on Finance discharged pursuant to the order of 10/07/2025.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 50 - 46. Record Vote Number: 598 \n\n\n\n S.J.Res. 80 (Sen. Sullivan):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Bureau of Land Management relating to \"National Petroleum Reserve in Alaska Integrated Activity Plan Record of Decision\" .\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 54 - 46. Record Vote Number: 595 \n\n\n\n S.Res. 474 (Sen. Blackburn):\n        A resolution designating October 2025 as \"National Country Music Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 475 (Sen. Hoeven):\n        A resolution designating November 1, 2025, as \"National Bison Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, October 29)","actionItem":"PN466-2:\n        Edmund G. LaCour, Jr., of Alabama, to be United States District Judge for the Northern District of Alabama\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 47. Record Vote Number: 596","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Cassidy, at  6:40 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}