{"retrieved-date":"2024-5-22","actions-date":"Tuesday, May 21, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, May 21)","actionItem":"S. 4361 (Sen. Murphy):\n        A bill making emergency supplemental appropriations for border security and combatting fentanyl for the fiscal year ending September 30, 2024, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.\n\n\n S.J.Res. 58 (Sen. Cruz):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Department of Energy relating to \"Energy Conservation Program: Energy Conservation Standards for Consumer Furnaces\".\n\n        -- Senate Committee on Energy and Natural Resources discharged, by petition, pursuant to 5 U.S.C. 802(c).\n\n        -- Placed on Senate Legislative Calendar under General Orders. Calendar No. 399.\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 50 - 45. Record Vote Number: 176","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, May 21)","actionItem":"PN1460:\n        Krissa M. Lanham, of Arizona, to be United States District Judge for the District of Arizona\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 66 - 27. Record Vote Number: 173 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 66 - 26. Record Vote Number: 174 \n\n\n\n PN1462:\n        Angela M. Martinez, of Arizona, to be United States District Judge for the District of Arizona\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 64 - 29. Record Vote Number: 175 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, vote 05/22/2024.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  7:46 p.m, the Presiding Officer (Mr. Kelly in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}