{"retrieved-date":"2025-10-22","actions-date":"Tuesday, October 21, 2025","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, October 21)","actionItem":"H.R. 5371 (Rep. Cole):\n        A bill making continuing appropriations and extensions for fiscal year 2026, and for other purposes .\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n\n S. 3012 (Sen. Johnson):\n        A bill to appropriate funds for pay and allowances of excepted Federal employees for periods of work performed during a lapse in appropriations, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, October 21)","actionItem":"PN346-5:\n        Anne-Leigh Gaylord Moe, of Florida, to be United States District Judge for the Middle District of Florida\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 46. Record Vote Number: 578 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 46. Record Vote Number: 580 \n\n\n\n PN400-2:\n        William W. Mercer, of Montana, to be United States District Judge for the District of Montana\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 46. Record Vote Number: 579 \n\n\n        -- Considered by Senate.\n\n\n PN466-6:\n        Harold D. Mooty III, of Alabama, to be United States District Judge for the Northern District of Alabama\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 66 - 32. Record Vote Number: 577 \n\n\n\n PN520-5:\n        Rebecca L. Taibleson, of Wisconsin, to be United States Circuit Judge for the Seventh Circuit\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.","actionTimeStamp":"--"}]}