{"retrieved-date":"2025-5-22","actions-date":"Tuesday, May 20, 2025","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, May 20)","actionItem":"S. 97 (Sen. Peters):\n        A bill to require SelectUSA to coordinate with State-level economic development organizations to increase foreign direct investment in semiconductor-related manufacturing and production.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 129 (Sen. Cruz):\n        A bill to amend the Internal Revenue Code of 1986 to eliminate the application of the income tax on qualified tips through a deduction allowed to all individual taxpayers, and for other purposes.\n\n        -- Senate Committee on Finance discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 216 (Sen. Sullivan):\n        A bill to amend the Save Our Seas 2.0 Act to improve the administration of the Marine Debris Foundation, to amend the Marine Debris Act to improve the administration of the Marine Debris Program of the National Oceanic and Atmospheric Administration, and for other purposes.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n S. 1582 (Sen. Hagerty):\n        A bill to provide for the regulation of payment stablecoins, and for other purposes.\n\n        -- Motion to proceed to measure considered in Senate.\n\n\n S.Res. 237 (Sen. Durbin):\n        A resolution honoring the service and memory of Army Staff Sgt. Jose Duenez Jr., Army Staff Sgt. Edvin F. Franco, Army Staff Sgt. Troy S. Knutson-Collins, and Army Pfc. Dante D. Taitano of the 1st Armored Brigade Combat Team, 3rd Infantry Division, who died during a recovery mission in support of a regularly scheduled training exercise while serving in Lithuania.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 238 (Sen. Scott, of SC):\n        A resolution congratulating the students, parents, teachers, and leaders of charter schools across the United States for making ongoing contributions to education and supporting the ideals and goals of the 26th Annual National Charter Schools Week, to be held May 11 through May 17, 2025.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Budd, at  7:07 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}