{"retrieved-date":"2025-10-31","actions-date":"Thursday, October 30, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, October 30)","actionItem":"H.R. 5371 (Rep. Cole):\n        A bill making continuing appropriations and extensions for fiscal year 2026, and for other purposes .\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n\n S.J.Res. 80 (Sen. Sullivan):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Bureau of Land Management relating to \"National Petroleum Reserve in Alaska Integrated Activity Plan Record of Decision\" .\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 52 - 45. Record Vote Number: 599 \n\n\n        -- Message on Senate action sent to the House.\n\n\n S.J.Res. 88 (Sen. Wyden):\n        A joint resolution terminating the national emergency declared to impose global tariffs.\n\n        -- Senate Committee on Finance discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 51 - 47. Record Vote Number: 600 \n\n\n        -- Message on Senate action sent to the House.\n\n\n S.Res. 478 (Sen. Thune):\n        A resolution to authorize testimony, document production, and representation by the Senate Legal Counsel in the case of United States v. Kaminski.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.\n\n\n S.Res. 479 (Sen. Cornyn):\n        A resolution supporting the goals and ideals of Red Ribbon Week during the period of October 23 through October 31, 2025 .\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, October 30)","actionItem":"PN384:\n        18 nominations in the Air Force beginning with Christopher F. Coffman and ending with Joseph J. Zrodlowski\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN385:\n        111 nominations in the Air Force beginning with Jessica L. Adkins and ending with Elithe E. Zoglman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN386:\n        83 nominations in the Air Force beginning with Gabriel Almodovar and ending with Adrian A. Zinnerman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN387:\n        129 nominations in the Air Force beginning with Joseph M. Adams and ending with Kyle G. Yates\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN388:\n        206 nominations in the Air Force beginning with Sean M. Andrews and ending with Mathew Zulauf\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN400-1:\n        Joshua D. Dunlap, of Maine, to be United States Circuit Judge for the First Circuit\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 47. Record Vote Number: 601 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, vote to be determined.\n\n\n PN400-3:\n        Eric Chunyee Tung, of California, to be United States Circuit Judge for the Ninth Circuit\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN441-2:\n        Brig. Gen. Christopher A. Jarratt, in the Air Force, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN441-4:\n        Brig. Gen. Gary R. Charlton II, in the Air Force, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN451:\n        28 nominations in the Air Force beginning with Marissa L. Ammerman and ending with Jonathan R. Wurzelbacher\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN453:\n        18 nominations in the Air Force beginning with Brian R. Blanchard and ending with Andrew J. Wagner\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN476-2:\n        4 nominations in the Space Force beginning with Lt . Gen. David N. Miller, Jr. and ending with Maj. Gen. Steven P. Whitney\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN521:\n        Kelly G. Kilcoyne, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN522:\n        Courtney L. Glass, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN523:\n        Daniel F. Gwosch, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN524:\n        Jennifer D. Cepeda, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN525:\n        Gary L. Helton, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN526:\n        Adam D. Weaver, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN527:\n        Merrill M. Moe, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN528:\n        70 nominations in the Army beginning with Raymond A. Akeriwe and ending with 0003774215\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN529:\n        421 nominations in the Marine Corps beginning with Daniel R. Abney and ending with Matthew S. Zach\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN530:\n        John R. Test, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN531:\n        Andrew E. Paul, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN532:\n        39 nominations in the Navy beginning with Thomas J . Augustine and ending with Stefan Winter\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN533:\n        2 nominations in the Navy beginning with Elijah J. Cox and ending with Patrick N. Matthews\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN534:\n        14 nominations in the Navy beginning with Maryam Al-Hassan and ending with Paul A. Williams\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN535:\n        61 nominations in the Navy beginning with James E. Altidor and ending with Amber R. Zufelt\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN536:\n        Michael G. Garcia, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN537:\n        41 nominations in the Navy beginning with Jerelyn M. Alvis and ending with David J. Wright\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN538:\n        39 nominations in the Navy beginning with Jose C. Almonte and ending with Aaron P. Ybarra\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN539:\n        1361 nominations in the Navy beginning with Alvin A. R. Abes and ending with Frank R. Zimmerman IV\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN540:\n        41 nominations in the Navy beginning with Angel B. Abeyta and ending with Jason M. Xu\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN541:\n        70 nominations in the Navy beginning with Joseph A . Acevedo and ending with Kevin J. Weeks\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN542:\n        18 nominations in the Navy beginning with Jonathan E. Baumgartner and ending with Austin C. Vanarsdall\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN543:\n        22 nominations in the Navy beginning with Theron M . Anderson and ending with Dawn H. Yoo\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN544:\n        55 nominations in the Navy beginning with Alexzandria S. Anderson and ending with David M. Yee\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN545:\n        49 nominations in the Navy beginning with Kiel L. Albarran and ending with Ching Ting Yuan\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN546:\n        73 nominations in the Navy beginning with Thomas B . Admont and ending with Andrew A. Zhao\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN547:\n        5 nominations in the Navy beginning with Dennis M. Devey and ending with Bradley A. Vomocil\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN548:\n        Katherine M. Nelson, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN549:\n        19 nominations in the Navy beginning with Hugo M. Argote and ending with Jennifer S. Wuelzer\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN550:\n        9 nominations in the Navy beginning with Lewis C. Aldridge and ending with Nicholas R. Spaleny\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN551:\n        Christopher J. Freeland, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN553:\n        Gen. Kenneth S. Wilsbach, in the Air Force, to be General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN554-1:\n        6 nominations in the Air Force beginning with Lt. Gen. Jason T. Hinds and ending with Maj. Gen. Jennifer Hammerstedt\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN554-2:\n        Maj. Gen. Dennis O. Bythewood, in the Space Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN556-2:\n        2 nominations in the Navy beginning with Rear Adm. Patrick J. Hannifin and ending with Rear Adm. Michael W. Baze\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN556-5:\n        9 nominations in the Army beginning with Maj. Gen. Michelle A. Schmidt and ending with Maj. Gen. Francisco J. Lozano\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN557:\n        Vice Adm. Karl O. Thomas, in the Navy, to be Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN561:\n        James Hodges, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN562:\n        Pete N. Traylor, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN563:\n        Arron Maniego, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN564:\n        10 nominations in the Army beginning with James A. Clark and ending with Michael P. Swanger\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN565:\n        25 nominations in the Army beginning with Blair T. Anthony and ending with Andre D. Sapp\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN566:\n        2 nominations in the Army beginning with Martin L. Blank and ending with John Chovanes\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN567:\n        19 nominations in the Army beginning with Paulynne H. Bellen and ending with Vicky M. Wright\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN568:\n        99 nominations in the Army beginning with Sarah P. Acklen and ending with Andrew J. Woodward\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN569:\n        139 nominations in the Army beginning with Antonio A. Acevedoguzman and ending with 0002383913\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN570:\n        66 nominations in the Army beginning with Charlie E. Anderson III and ending with 0002493652\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN571:\n        Jennifer D. Tine, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN572:\n        Nathan D. Levy, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN573:\n        Andrew S. Wilhelm, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN574:\n        Billy J. Thomas, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN575:\n        Wai Y. Chau, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN576:\n        Brian S. Knipp, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN577:\n        3 nominations in the Navy beginning with Martha A. Dodson and ending with Steven Vukas\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN578:\n        3 nominations in the Navy beginning with Whoon J. Kil and ending with Jasleen K. Raina\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN579:\n        5 nominations in the Navy beginning with Gabriel Darwish and ending with Oleg Odin\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN580:\n        Jennifer E. Kirschner, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN581:\n        12 nominations in the Navy beginning with Kenneth E. Fore II and ending with Thomas R. Warren II\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN582:\n        6 nominations in the Navy beginning with Eliane F. Eakin and ending with David C. Sahadevan\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN583:\n        Lyla J. Blake-Gumbs, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN592:\n        Brig. Gen. Lisa K. Snyder, in the Air Force, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN594:\n        Brig. Gen. Clinton K. Murray, in the Army, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN596:\n        Rear Adm. (lh) Anthony E. Rossi, in the Navy, to be Rear Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN597:\n        Miri C. Kim, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN598:\n        Boris Elison, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN599:\n        Courtney A. Anderson, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN600:\n        Thomas D. White, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN601:\n        3 nominations in the Army beginning with Phillip W . Gingrich and ending with Andrew J. Richardson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN602:\n        15 nominations in the Army beginning with Owen S. Adams and ending with Michael S. Widner\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN603:\n        Alexis C. Beck, in the Space Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN608:\n        Col. Sonya L. Morrison, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN610:\n        Lt. Gen. Joseph A. Ryan, in the Army, to be General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN612:\n        2 nominations in the Army beginning with Col. Constance L. Jenkins and ending with Col. Mark E. Stackle\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN617-1:\n        Maj. Gen. Lawrence G. Ferguson, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN617-2:\n        Lt. Gen. Michael J. Lutton, in the Air Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN617-3:\n        Rear Adm. Stephen R. Tedford, in the Navy, to be Vice Admiral\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  3:23 p.m., the Senate adjourned, under its order of today, until  3 p.m. on Monday, November 3, 2025.","actionTimeStamp":"--"}]}