{"retrieved-date":"2023-12-1","actions-date":"Thursday, November 30, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, November 30)","actionItem":"S.Res. 481 (Sen. Young):\n        A resolution expressing support for the goals of Stomach Cancer Awareness Month.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, November 30)","actionItem":"PN36:\n        Elizabeth H. Richard, of Virginia, to be Coordinator for Counterterrorism, with the rank and status of Ambassador at Large\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN500:\n        Irma Carrillo Ramirez, of Texas, to be United States Circuit Judge for the Fifth Circuit\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 80 - 17. Record Vote Number: 325 \n\n\n        -- By unanimous consent agreement, debate 12/4/2023.\n\n\n PN588:\n        Loren L. AliKhan, of the District of Columbia, to be United States District Judge for the District of Columbia\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN907:\n        Cole-Christian L. Holinaty, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN908:\n        Vincent W. Flory, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1053:\n        Shanlyn A.S. Park, of Hawaii, to be United States District Judge for the District of Hawaii\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 45. Record Vote Number: 324 \n\n\n\n PN1107:\n        Samuel J. Nirenberg, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1119:\n        Kirsten H. Thompson, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1120:\n        12 nominations in the Army beginning with Thomas T. Booth, Jr. and ending with Ean P. White\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1121:\n        3 nominations in the Army beginning with Moises A. Castillo and ending with Truman L. Tinsley IV\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1122:\n        74 nominations in the Space Force beginning with Kelly N. Alexander and ending with Nicholas Y. Yeung\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1123:\n        48 nominations in the Space Force beginning with Brandon P. Alford and ending with Matthew C. Wroten\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1124:\n        80 nominations in the Space Force beginning with Matthew Guy Adams and ending with Shawn Woodall, Jr.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1125:\n        113 nominations in the Space Force beginning with Elizabeth A. Agnew and ending with Luke G. Wunderlich\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1126:\n        82 nominations in the Space Force beginning with Alexander R. Allard and ending with Tyler T. Williams\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1138:\n        Michael D. McCarthy, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1140:\n        Benjamin T. Fedeles, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1141:\n        Ashly C. Ruf, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1142:\n        Brandon L. Sanders, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1143:\n        2 nominations in the Air Force beginning with Li Zhao Mueckay and ending with Alexander T. Parmater\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1144:\n        2 nominations in the Air Force beginning with Zari N. Cofield and ending with Joshua D. Forsyth\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1145:\n        144 nominations in the Marine Corps beginning with Agur S. Adams and ending with Christina F. Zimmerman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1146:\n        3 nominations in the Navy beginning with John R. Barachie and ending with Sara A. Zanitsch\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1147:\n        27 nominations in the Navy beginning with Michael W. Barber, Jr. and ending with Eric J. Young\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Kaine, at  3:08 p.m., the Senate adjourned, under its order of today, until  3 p.m. on Monday, December 4, 2023.","actionTimeStamp":"--"}]}