{"retrieved-date":"2024-5-23","actions-date":"Wed, 22 May 2024 20:21:53 -0400","actions-title":"House Floor Proceedings","actions-count":48,"actions-list":[{"index":1,"header":"--","actionItem":"The House adjourned pursuant to a previous special order. The next meeting is scheduled for 10:00 a.m. on May 23, 2024.","actionTimeStamp":"Wed, 22 May 2024 20:21:53 -0400"},{"index":2,"header":"--","actionItem":"On motion to adjourn Agreed to by voice vote.","actionTimeStamp":"Wed, 22 May 2024 20:21:52 -0400"},{"index":3,"header":"--","actionItem":"Mr. Schweikert moved that the House do now adjourn.","actionTimeStamp":"Wed, 22 May 2024 20:21:44 -0400"},{"index":4,"header":"SPECIAL ORDER SPEECHES","actionItem":"The House has concluded all anticipated legislative business and has proceeded to Special Order speeches.","actionTimeStamp":"Wed, 22 May 2024 18:00:21 -0400"},{"index":5,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with further one minute speeches.","actionTimeStamp":"Wed, 22 May 2024 17:44:38 -0400"},{"index":6,"header":"--","actionItem":"Mr. Hill asked unanimous consent that when the House adjourns today, it adjourn to meet at 10:00 a.m. on May 23. Agreed to without objection.","actionTimeStamp":"Wed, 22 May 2024 17:43:40 -0400"},{"index":7,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Wed, 22 May 2024 17:41:14 -0400"},{"index":8,"header":"On passage Passed by recorded vote: 279","actionItem":"136 (Roll no. 226).","actionTimeStamp":"Wed, 22 May 2024 17:41:12 -0400"},{"index":9,"header":"--","actionItem":"The House adopted the amendments en gros as agreed to by the Committee of the Whole House on the state of the Union.","actionTimeStamp":"Wed, 22 May 2024 17:34:31 -0400"},{"index":10,"header":"--","actionItem":"The previous question was ordered pursuant to the rule.","actionTimeStamp":"Wed, 22 May 2024 17:34:20 -0400"},{"index":11,"header":"--","actionItem":"The House rose from the Committee of the Whole House on the state of the Union to report H.R. 4763.","actionTimeStamp":"Wed, 22 May 2024 17:33:24 -0400"},{"index":12,"header":"On agreeing to the Perry amendment; Agreed to by recorded vote: 225","actionItem":"191 (Roll no. 225).","actionTimeStamp":"Wed, 22 May 2024 17:33:17 -0400"},{"index":13,"header":"On agreeing to the Norman amendment; Agreed to by recorded vote: 411","actionItem":"0 (Roll no. 224).","actionTimeStamp":"Wed, 22 May 2024 17:28:39 -0400"},{"index":14,"header":"On agreeing to the Casar amendment; Failed by recorded vote: 204","actionItem":"209 (Roll no. 223).","actionTimeStamp":"Wed, 22 May 2024 17:23:46 -0400"},{"index":15,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Perry amendment No. 4, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes prevailed. Ms. Waters demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 22 May 2024 16:47:01 -0400"},{"index":16,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1243, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 4.","actionTimeStamp":"Wed, 22 May 2024 16:35:16 -0400"},{"index":17,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 4 printed in Part B of House Report 118-516 to add a sense of Congress to the end of title V that nothing in this Act or any amendment made by this Act should be interpreted to authorize any entity to regulate any commodity, other than a digital commodity, on any spot market.","actionTimeStamp":"Wed, 22 May 2024 16:35:03 -0400"},{"index":18,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Norman amendment No. 3, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes prevailed. Ms. Waters demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 22 May 2024 16:34:43 -0400"},{"index":19,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1243, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 3.","actionTimeStamp":"Wed, 22 May 2024 16:23:26 -0400"},{"index":20,"header":"--","actionItem":"An amendment, offered by Mr. Norman,  numbered 3 printed in Part B of House Report 118-516 to require a study on the impact of digital asset registrants owned by foreign adversaries.","actionTimeStamp":"Wed, 22 May 2024 16:23:16 -0400"},{"index":21,"header":"--","actionItem":"On agreeing to the Pettersen amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 22 May 2024 16:22:59 -0400"},{"index":22,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1243, the Committee of the Whole proceeded with 10 minutes of debate on the Pettersen amendment No. 2.","actionTimeStamp":"Wed, 22 May 2024 16:16:03 -0400"},{"index":23,"header":"--","actionItem":"An amendment, offered by Ms. Pettersen,  numbered 2 printed in Part B of House Report 118-516 to clarify the application of the Bank Secrecy Act to digital asset and digital commodity entities and to require a Government Accountability Office study on risks posed by centralized intermediaries that are primarily located in foreign jurisdictions without regulatory requirements similar to those of the Bank Secrecy Act.","actionTimeStamp":"Wed, 22 May 2024 16:15:46 -0400"},{"index":24,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Casar amendment No. 1, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes prevailed. Mr. Casar demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 22 May 2024 16:15:20 -0400"},{"index":25,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1243, the Committee of the Whole proceeded with 10 minutes of debate on the Casar amendment No. 1.","actionTimeStamp":"Wed, 22 May 2024 16:06:15 -0400"},{"index":26,"header":"--","actionItem":"An amendment, offered by Mr. Casar,  numbered 1 printed in Part B of House Report 118-516 to change the new crowdfunding exemption from $75 million to $5 million.","actionTimeStamp":"Wed, 22 May 2024 16:06:02 -0400"},{"index":27,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 4763.","actionTimeStamp":"Wed, 22 May 2024 14:49:55 -0400"},{"index":28,"header":"--","actionItem":"The Speaker designated the Honorable Michael Guest to act as Chairman of the Committee.","actionTimeStamp":"Wed, 22 May 2024 14:49:07 -0400"},{"index":29,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 1243 and Rule XVIII.","actionTimeStamp":"Wed, 22 May 2024 14:49:06 -0400"},{"index":30,"header":"--","actionItem":"Rule provides for consideration of H.R. 4763, H.R. 5403 and H.R. 192. The resolution provides for one hour of debate on each bill. H.R. 4763 and H.R. 5403 are considered under a structured rule and H.R. 192 is considered under a closed rule. The resolution provides for one motion to recommit on each bill.","actionTimeStamp":"Wed, 22 May 2024 14:48:20 -0400"},{"index":31,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 1243. H.R. 4763 — \"To provide for a system of regulation of digital assets by the Commodity Futures Trading Commission and the Securities and Exchange Commission, and for other purposes.\"","actionTimeStamp":"Wed, 22 May 2024 14:48:15 -0400"},{"index":32,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Wed, 22 May 2024 14:45:37 -0400"},{"index":33,"header":"On agreeing to the resolution Agreed to by recorded vote: 204","actionItem":"203 (Roll no. 222).","actionTimeStamp":"Wed, 22 May 2024 14:45:36 -0400"},{"index":34,"header":"On ordering the previous question Agreed to by the Yeas and Nays: 205","actionItem":"203 (Roll no. 221).","actionTimeStamp":"Wed, 22 May 2024 14:32:49 -0400"},{"index":35,"header":"DEBATE","actionItem":"The House continued with further debate on H. Res. 1243.","actionTimeStamp":"Wed, 22 May 2024 13:47:45 -0400"},{"index":36,"header":"WORDS TAKEN DOWN","actionItem":"During the course of debate, exception was taken to certain words used and a demand was made to have the words taken down. After review, the Chair ruled that the words were in violation of the spirit of debate. Without objection the words were stricken from the record.","actionTimeStamp":"Wed, 22 May 2024 13:46:58 -0400"},{"index":37,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 1243.","actionTimeStamp":"Wed, 22 May 2024 12:20:56 -0400"},{"index":38,"header":"--","actionItem":"Considered as privileged matter. H. Res. 1243 — \"Providing for consideration of the bill (H.R. 4763) to provide for a system of regulation of digital assets by the Commodity Futures Trading Commission and the Securities and Exchange Commission, and for other purposes; providing for consideration of the bill (H.R. 5403) to amend the Federal Reserve Act to prohibit the Federal reserve banks from offering certain products or services directly to an individual, to prohibit the use of central bank digital currency for monetary policy, and for other purposes; and providing for consideration of the bill (H.R. 192) to prohibit individuals who are not citizens of the United States from voting in elections in the District of Columbia.\"","actionTimeStamp":"Wed, 22 May 2024 12:15:25 -0400"},{"index":39,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches.","actionTimeStamp":"Wed, 22 May 2024 12:04:24 -0400"},{"index":40,"header":"--","actionItem":"The House received a message from the Senate. The Senate passed S.J. Res. 58.","actionTimeStamp":"Wed, 22 May 2024 12:03:40 -0400"},{"index":41,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Takano to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 22 May 2024 12:02:51 -0400"},{"index":42,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 22 May 2024 12:02:40 -0400"},{"index":43,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Wed, 22 May 2024 12:01:02 -0400"},{"index":44,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of May 22.","actionTimeStamp":"Wed, 22 May 2024 12:00:00 -0400"},{"index":45,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Wed, 22 May 2024 11:27:27 -0400"},{"index":46,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Wed, 22 May 2024 10:00:38 -0400"},{"index":47,"header":"--","actionItem":"The Speaker designated the Honorable Chuck Edwards to act as Speaker pro tempore for today.","actionTimeStamp":"Wed, 22 May 2024 10:00:20 -0400"},{"index":48,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 22 May 2024 10:00:00 -0400"}]}