{"retrieved-date":"2023-12-19","actions-date":"Monday, December 18, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Thursday, December 14, 2023,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Thursday, December 14, 2023, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, December 18)","actionItem":"S. 310 (Sen. Scott, of FL):\n        A bill to establish an advisory group to encourage and foster collaborative efforts among individuals and entities engaged in disaster recovery relating to debris removal, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 679 (Sen. Scott, of FL):\n        A bill to amend chapter 8 of title 5, United States Code, to require Federal agencies to submit to the Comptroller General of the United States a report on rules that are revoked, suspended, replaced, amended, or otherwise made ineffective.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 950 (Sen. Cortez Masto):\n        A bill to amend the Omnibus Public Land Management Act of 2009 to make a technical correction to the water rights settlement for the Shoshone-Paiute Tribes of the Duck Valley Reservation, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 1414 (Sen. Cantwell):\n        A bill to improve the instant messaging service used by the National Weather Service, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 1416 (Sen. Cantwell):\n        A bill to provide guidance for and investment in the upgrade and modernization of the National Oceanic and Atmospheric Administration Weather Radio All Hazards Network, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 2073 (Sen. Ossoff):\n        A bill to amend title 31, United States Code, to require agencies to include a list of outdated or duplicative reporting requirements in annual budget justifications, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 2685 (Sen. Peters):\n        A bill to make data and internal guidance on excess personal property publicly available, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 3427 (Sen. Graham):\n        A bill to extend the authority to provide employees of the United States Secret Service with overtime pay beyond other statutory limitations, and for other purposes.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 512 (Sen. Smith):\n        A resolution designating November 2023 as \"National Lung Cancer Awareness Month\" and expressing support for early detection and treatment of lung cancer.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 513 (Sen. Budd):\n        A resolution recognizing December 17 as \"Wright Brothers Day\" and commemorating the 120th anniversary of the first powered flight.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 514 (Sen. Scott, of FL):\n        A resolution congratulating the Florida State University Seminoles for winning the 2023 National Collegiate Athletic Association Division I Women's Soccer Championship.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Monday, December 18)","actionItem":"PN119:\n        Joseph Goffman, of Pennsylvania, to be an Assistant Administrator of the Environmental Protection Agency\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN157:\n        Jose Javier Rodriguez, of Florida, to be an Assistant Secretary of Labor\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN836:\n        David K. Sing, of Hawaii, to be a Member of the National Council on the Humanities for a term expiring January 26, 2026\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN900:\n        Martin O'Malley, of Maryland, to be Commissioner of Social Security for the remainder of the term expiring January 19, 2025\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 11. Record Vote Number: 347 \n\n\n\n PN901:\n        Paul K. Martin, of Maryland, to be Inspector General, United States Agency for International Development\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN981:\n        Christopher Charles Fonzone, of Pennsylvania, to be an Assistant Attorney General\n\n        -- Considered by Senate.\n\n\n PN1106:\n        John David Russell, of Oklahoma, to be United States District Judge for the Northern District of Oklahoma\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  7:18 p.m., the Senate adjourned, under its order of today, until 11 a.m. tomorrow.","actionTimeStamp":"--"}]}