{"retrieved-date":"2025-7-15","actions-date":"Tue, 15 Jul 2025 13:26:39 -0400","actions-title":"House Floor Proceedings","actions-count":15,"actions-list":[{"index":1,"header":"On ordering the previous question Roll Call 194","actionItem":"Yea and Nay vote pending.","actionTimeStamp":"Tue, 15 Jul 2025 13:26:39 -0400"},{"index":2,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 580.","actionTimeStamp":"Tue, 15 Jul 2025 12:28:38 -0400"},{"index":3,"header":"--","actionItem":"Considered as privileged matter. H. Res. 580 — \"Providing for consideration of the bill (H.R. 4016) making appropriations for the Department of Defense for the fiscal year ending September 30, 2026, and for other purposes; providing for consideration of the bill (H.R. 3633) to provide for a system of regulation of the offer and sale of digital commodities by the Securities and Exchange Commission and the Commodity Futures Trading Commission, and for other purposes; providing for consideration of the bill (H.R. 1919) to amend the Federal Reserve Act to prohibit the Federal reserve banks from offering certain products or services directly to an individual, to prohibit the use of central bank digital currency for monetary policy, and for other purposes; providing for consideration of the bill (S. 1582) to provide for the regulation of payment stablecoins, and for other purposes; and waiving a requirement of clause 6(a) of rule XIII with respect to consideration of certain resolutions reported from the Committee on Rules.\"","actionTimeStamp":"Tue, 15 Jul 2025 12:21:27 -0400"},{"index":4,"header":"Congressional-Executive Commission on the People's Republic of China","actionItem":"Pursuant to 22 U.S.C. 6913, and the order of the House of January 3, 2025, the Speaker appointed the following members of the House to the Congressional-Executive Commission on the People's Republic of China: Mr. Suozzi and Mr. Subramanyam.","actionTimeStamp":"Tue, 15 Jul 2025 12:20:22 -0400"},{"index":5,"header":"ONE MINUTE SPEECHES","actionItem":"The House resumed one minute speeches.","actionTimeStamp":"Tue, 15 Jul 2025 12:05:30 -0400"},{"index":6,"header":"--","actionItem":"The House received a message from the Senate. The Senate passed S. 283 and S. 433.","actionTimeStamp":"Tue, 15 Jul 2025 12:05:04 -0400"},{"index":7,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair would be limited to 15 per side of the aisle.","actionTimeStamp":"Tue, 15 Jul 2025 12:02:50 -0400"},{"index":8,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Raskin to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Tue, 15 Jul 2025 12:02:33 -0400"},{"index":9,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Tue, 15 Jul 2025 12:02:24 -0400"},{"index":10,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Tue, 15 Jul 2025 12:01:06 -0400"},{"index":11,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of July 15.","actionTimeStamp":"Tue, 15 Jul 2025 12:00:00 -0400"},{"index":12,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Tue, 15 Jul 2025 10:50:15 -0400"},{"index":13,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Tue, 15 Jul 2025 10:00:48 -0400"},{"index":14,"header":"--","actionItem":"The Speaker designated the Honorable Blake D. Moore to act as Speaker pro tempore for today.","actionTimeStamp":"Tue, 15 Jul 2025 10:00:24 -0400"},{"index":15,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Tue, 15 Jul 2025 10:00:00 -0400"}]}