{"retrieved-date":"2025-10-24","actions-date":"Thursday, October 23, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Tuesday, October 21, 2025,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Tuesday, October 21, 2025, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, October 23)","actionItem":"H.R. 2316 (Rep. Hurd):\n        A bill to amend the Pittman-Robertson Wildlife Restoration Act to provide that interest on obligations held in the Federal aid to wildlife restoration fund shall become available for apportionment at the beginning of fiscal year 2033.\n\n        -- Senate Committee on Environment and Public Works discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n H.R. 5371 (Rep. Cole):\n        A bill making continuing appropriations and extensions for fiscal year 2026, and for other purposes .\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n\n S. 99 (Sen. Peters):\n        A bill to require the Secretary of Commerce to produce a report that provides recommendations to improve the effectiveness , efficiency, and impact of Department of Commerce programs related to supply chain resilience and manufacturing and industrial innovation, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S. 259 (Sen. Fischer):\n        A bill to direct the Federal Communications Commission to publish a list of entities that hold authorizations, licenses , or other grants of authority issued by the Commission and that have certain foreign ownership, and for other purposes.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n        -- Message on Senate action sent to the House.\n\n\n S. 3012 (Sen. Johnson):\n        A bill to appropriate funds for pay and allowances of excepted Federal employees for periods of work performed during a lapse in appropriations, and for other purposes.\n\n        -- Cloture motion on the motion to proceed to the measure not invoked in Senate by Yea-Nay Vote. 54 - 45. Record Vote Number: 585 \n\n\n        -- Motion by Senator Thune to reconsider the vote by which cloture on the motion to proceed to S. 3012 was not invoked (Record Vote No. 585) made in Senate.\n\n\n S.Res. 464 (Sen. Hyde-Smith):\n        A resolution designating September 2025 as \"National Cholesterol Education Month\" and September 30, 2025, as \"LDL-C Awareness Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 465 (Sen. Scott, of SC):\n        A resolution designating September 2025 as \"National Childhood Cancer Awareness Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, October 23)","actionItem":"PN346-6:\n        Jordan Emery Pratt, of Florida, to be United States District Judge for the Middle District of Florida\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN368:\n        Stephen Chad Meredith, of Kentucky, to be United States District Judge for the Eastern District of Kentucky\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 48 - 45. Record Vote Number: 586 \n\n\n\n PN379-7:\n        David Courcelle, of Louisiana, to be United States Attorney for the Eastern District of Louisiana for the term of four years\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN520-5:\n        Rebecca L. Taibleson, of Wisconsin, to be United States Circuit Judge for the Seventh Circuit\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 45. Record Vote Number: 587 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, vote 10/27/2025.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  4:43 p.m, the Presiding Officer (Mr. Husted in the chair) declared the Senate adjourned, under its order of today, until  3 p.m. on Monday, October 27, 2025.","actionTimeStamp":"--"}]}