{"retrieved-date":"2023-7-19","actions-date":"Tuesday, July 18, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Friday, July 14, 2023,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Friday, July 14, 2023, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, July 18)","actionItem":"H.R. 423 (Rep. Issa):\n        A bill to take certain land located in San Diego County, California, into trust for the benefit of the Pala Band of Mission Indians, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 4004 (Rep. Smith):\n        A bill to approve and implement the Agreement between the American Institute in Taiwan and the Taipei Economic and Cultural Representative Office in the United States regarding Trade between the United States of America and Taiwan, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 70 (Sen. Thune):\n        A bill to require the Bureau of Indian Affairs to process and complete all mortgage packages associated with residential and business mortgages on Indian land by certain deadlines, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 460 (Sen. Smith):\n        A bill to amend the Indian Health Care Improvement Act to establish an urban Indian organization confer policy for the Department of Health and Human Services.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 794 (Sen. Cornyn):\n        A bill to require a pilot program on the participation of non-asset-based third-party logistics providers in the Customs-Trade Partnership Against Terrorism.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 934 (Sen. Cornyn):\n        To specify that no additional funds are authorized to be appropriated for the purpose of carrying out the Act.\n\n        --Amendment SA 934 proposed by Senator Schumer for Senator Cornyn.\n\n        --Amendment SA 934 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 1308 (Sen. Hoeven):\n        A bill to amend the Indian Self-Determination and Education Assistance Act to extend the deadline for the Secretary of the Interior to promulgate regulations implementing title IV of that Act, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 2226 (Sen. Reed):\n        An original bill to authorize appropriations for fiscal year 2024 for military activities of the Department of Defense, for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\n\n        -- Cloture on the motion to proceed to the measure invoked in Senate by Yea-Nay Vote. 72 - 25. Record Vote Number: 188 \n\n\n        -- Motion to proceed to measure considered in Senate.\n\n\n S.Res. 246 (Sen. Moran):\n        A resolution honoring the men and women of the Drug Enforcement Administration on the 50th anniversary of the agency.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 269 (Sen. Barrasso):\n        A resolution designating July 22, 2023, as \"National Day of the American Cowboy\".\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 300 (Sen. Tester):\n        A resolution designating July 14, 2023, as \"Collector Car Appreciation Day\" and recognizing that the collection and restoration of historic and classic cars is an important part of preserving the technological achievements and cultural heritage of the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 301 (Sen. Cortez Masto):\n        A resolution expressing support for the designation of Journeyman Lineworkers Recognition Day.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, July 18)","actionItem":"PN94:\n        Rachel Bloomekatz, of Ohio, to be United States Circuit Judge for the Sixth Circuit\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 48. Record Vote Number: 187","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at 10:44 p.m., the Senate adjourned, under its order of today, until 9:45 a.m. tomorrow.","actionTimeStamp":"--"}]}