{"retrieved-date":"2025-7-15","actions-date":"Monday, July 14, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Thursday, July 10, 2025,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Thursday, July 10, 2025, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, July 14)","actionItem":"S. 283 (Sen. Cruz):\n        A bill to require the Under Secretary of Commerce for Standards and Technology and the Administrator of National Oceanic and Atmospheric Administration to develop a standard methodology for identifying the country of origin of seafood to support enforcement against illegal, unreported, and unregulated fishing, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 433 (Sen. Peters):\n        A bill to require the Secretary of Commerce to establish the National Manufacturing Advisory Council within the Department of Commerce, and for other purposes.\n\n        -- Passed Senate with an amendment by Voice Vote.\n\n\n S.Res. 283 (Sen. Merkley):\n        A resolution commemorating the 90th birthday of His Holiness the 14th Dalai Lama on July 6, 2025, as \"A Day of Compassion\" and expressing support for the human rights and distinct religious, cultural, linguistic, and historical identity of the Tibetan people.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Resolution agreed to in Senate with an amendment and with a preamble by Unanimous Consent.\n \n\n S.Amdt. 2852 (Sen. Merkley):\n        To improve the resolution.\n\n        --Amendment SA 2852 proposed by Senator Thune for Senator Merkley.\n\n        --Amendment SA 2852 agreed to in Senate by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Monday, July 14)","actionItem":"PN25-39:\n        Luke Pettit, of the District of Columbia, to be an Assistant Secretary of the Treasury\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 60 - 28. Record Vote Number: 385 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate and vote 7/15/2025.\n\n\n PN150-3:\n        Whitney D. Hermandorfer, of Tennessee, to be United States Circuit Judge for the Sixth Circuit\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 46 - 42. Record Vote Number: 384","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  6:53 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}