{"retrieved-date":"2024-2-1","actions-date":"Thu, 01 Feb 2024 11:06:05 -0500","actions-title":"House Floor Proceedings","actions-count":18,"actions-list":[{"index":1,"header":"SPECIAL ORDER SPEECHES","actionItem":"The House has concluded all anticipated legislative business and has proceeded to Special Order speeches.","actionTimeStamp":"Thu, 01 Feb 2024 11:06:05 -0500"},{"index":2,"header":"NOTIFICATION OF INTENT TO OFFER RESOLUTION","actionItem":"Mrs. Greene (GA) notified the House of her intent to offer a privileged resolution pursuant to clause 2(a)(1) of rule IX. The Chair announced that a determination will be made at the time designated for consideration of the resolution.","actionTimeStamp":"Thu, 01 Feb 2024 11:01:26 -0500"},{"index":3,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with further one minute speeches.","actionTimeStamp":"Thu, 01 Feb 2024 10:36:35 -0500"},{"index":4,"header":"--","actionItem":"The House received a communication from Representative Higgins (NY) wherein he resigns as a member of the House of Representatives effective at 11:59 p.m. on February 2, 2024.","actionTimeStamp":"Thu, 01 Feb 2024 10:36:06 -0500"},{"index":5,"header":"--","actionItem":"Ms. Tenney asked unanimous consent That when the House adjourns on Thursday, February 1, 2024, it adjourn to meet at noon on Monday, February 5, 2024 for Morning-Hour debate and 2:00 p.m. for legislative business. Agreed to without objection.","actionTimeStamp":"Thu, 01 Feb 2024 10:35:03 -0500"},{"index":6,"header":"--","actionItem":"On approving the Journal Agreed to by voice vote.","actionTimeStamp":"Thu, 01 Feb 2024 10:34:45 -0500"},{"index":7,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Thu, 01 Feb 2024 10:34:25 -0500"},{"index":8,"header":"On passage Passed by the Yeas and Nays: 274","actionItem":"150 (Roll no. 31).","actionTimeStamp":"Thu, 01 Feb 2024 10:34:23 -0500"},{"index":9,"header":"--","actionItem":"The previous question was ordered pursuant to the rule.","actionTimeStamp":"Thu, 01 Feb 2024 09:53:09 -0500"},{"index":10,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H.R. 6976.","actionTimeStamp":"Thu, 01 Feb 2024 09:20:47 -0500"},{"index":11,"header":"--","actionItem":"Rule provides for consideration of H.R. 5585, H.R. 6678, H.R. 6679 and H.R. 6976. The resolution provides for consideration of H.R. 5585, H.R. 6678, H.R. 6679, and H.R. 6976 under a structured rule. Rule provides for one hour of general debate and one motion to recommit on each measure.","actionTimeStamp":"Thu, 01 Feb 2024 09:18:52 -0500"},{"index":12,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 980. H.R. 6976 — \"To amend the Immigration and Nationality Act to provide that aliens who have been convicted of or who have committed an offense for driving while intoxicated or impaired are inadmissible and deportable.\"","actionTimeStamp":"Thu, 01 Feb 2024 09:18:47 -0500"},{"index":13,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair would be limited to 5 per side of the aisle.","actionTimeStamp":"Thu, 01 Feb 2024 09:03:09 -0500"},{"index":14,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Ms. Garcia of TX to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 01 Feb 2024 09:02:53 -0500"},{"index":15,"header":"SPEAKERS APPROVAL OF THE JOURNAL","actionItem":"The Chair announced that he had examined the Journal of the last day's proceedings and had approved it. Mr. Hern demanded that the question be put on agreeing to the Speaker's approval of the Journal and by voice vote, the Chair announced that the ayes had prevailed. Mr. Hern objected to the voice vote based upon the absence of a quorum and the Chair postponed further proceedings on the question of agreeing to the Speaker's approval of the Journal until a time to be announced.","actionTimeStamp":"Thu, 01 Feb 2024 09:02:17 -0500"},{"index":16,"header":"--","actionItem":"Today's prayer was offered by Dr. Michael Cramer, New Life Church, Osceola, Indiana.","actionTimeStamp":"Thu, 01 Feb 2024 09:00:46 -0500"},{"index":17,"header":"--","actionItem":"The Speaker designated the Honorable Brandon Williams to act as Speaker pro tempore for today.","actionTimeStamp":"Thu, 01 Feb 2024 09:00:33 -0500"},{"index":18,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 01 Feb 2024 09:00:00 -0500"}]}