{"retrieved-date":"2024-6-5","actions-date":"Wed, 05 Jun 2024 09:35:26 -0400","actions-title":"House Floor Proceedings","actions-count":18,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1269, the Committee of the Whole proceeded with 10 minutes of debate on the Steube amendment No. 46.","actionTimeStamp":"Wed, 05 Jun 2024 09:35:26 -0400"},{"index":2,"header":"--","actionItem":"An amendment, offered by Mr. Steube,  numbered 46 printed in Part B of House Report 118-535 to prohibit the use of funds for the Department of Veterans Affairs to process medical claims for the Immigration and Customs Enforcement Health Service Corps.","actionTimeStamp":"Wed, 05 Jun 2024 09:35:13 -0400"},{"index":3,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Steube Amendment No. 45, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Rutherford demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 05 Jun 2024 09:34:54 -0400"},{"index":4,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1269, the Committee of the Whole proceeded with 10 minutes of debate on the Steube amendment No. 45.","actionTimeStamp":"Wed, 05 Jun 2024 09:28:52 -0400"},{"index":5,"header":"--","actionItem":"An amendment, offered by Mr. Steube,  numbered 45 printed in Part B of House Report 118-535 to prohibit the Department of Veterans Affairs from using its funds to pay bonuses to senior executives in the VA Central Office.","actionTimeStamp":"Wed, 05 Jun 2024 09:28:32 -0400"},{"index":6,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Schweikert Amendment No. 44, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Rutherford demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 05 Jun 2024 09:26:01 -0400"},{"index":7,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1269, the Committee of the Whole proceeded with 10 minutes of debate on the Schweikert amendment No. 44.","actionTimeStamp":"Wed, 05 Jun 2024 09:22:29 -0400"},{"index":8,"header":"--","actionItem":"An amendment, offered by Mr. Schweikert,  numbered 44 printed in Part B of House Report 118-535 to increase and decrease funding by $10 million to conduct a study on the benefits of utilizing artificial intelligence (AI) to streamline oversight, mitigate and reduce fraud, and improve data accuracy and financial management practices at the Department of Veterans Affairs.","actionTimeStamp":"Wed, 05 Jun 2024 09:22:15 -0400"},{"index":9,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Schweikert Amendment No. 43, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Rutherford demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 05 Jun 2024 09:21:59 -0400"},{"index":10,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1269, the Committee of the Whole proceeded with 10 minutes of debate on the Schweikert amendment No. 43.","actionTimeStamp":"Wed, 05 Jun 2024 09:17:05 -0400"},{"index":11,"header":"--","actionItem":"An amendment, offered by Mr. Schweikert,  numbered 43 printed in Part B of House Report 118-535 to increase and decrease funding by $1 million for the Veterans Benefits Administration to provide support for utilizing AI to expedite claims.","actionTimeStamp":"Wed, 05 Jun 2024 09:16:53 -0400"},{"index":12,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Wed, 05 Jun 2024 09:15:58 -0400"},{"index":13,"header":"--","actionItem":"Considered as unfinished business. H.R. 8580 — \"Making appropriations for military construction, the Department of Veterans Affairs, and related agencies for the fiscal year ending September 30, 2025, and for other purposes.\"","actionTimeStamp":"Wed, 05 Jun 2024 09:15:36 -0400"},{"index":14,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair would be limited to 5 per side of the aisle.","actionTimeStamp":"Wed, 05 Jun 2024 09:03:39 -0400"},{"index":15,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Fulcher to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 05 Jun 2024 09:02:14 -0400"},{"index":16,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 05 Jun 2024 09:02:09 -0400"},{"index":17,"header":"--","actionItem":"Today's prayer was offered by Pastor Travis O'Neal, Christ Fellowship Church, Port St. Lucie, Florida.","actionTimeStamp":"Wed, 05 Jun 2024 09:00:42 -0400"},{"index":18,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 05 Jun 2024 09:00:00 -0400"}]}