{"retrieved-date":"2023-11-23","actions-date":"Wednesday, November 15, 2023","actions-title":"Recent Floor Activity","actions-count":7,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday,the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, November 15)","actionItem":"H.R. 2670 (Rep. Rogers):\n        A bill to authorize appropriations for fiscal year2024 for military activities of the Department of Defense and for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Motion to insist on the amendment of the Senate to H.R. 2670, agree to the request for conference, and authorize the Presiding Officer to appoint conferees agreed to by Yea-Nay Vote. 90 - 8. Record Vote Number: 313 \n\n\n        -- Senate insists on its amendment to H.R. 2670, agrees to a conference with the House, and authorizes the Presiding Officer to appoint conferees.\n\n        -- Motion by Senator Reed (for Senator Klobuchar) to instruct Senate confereesmade in Senate.\n\n        -- Motion by Senator Reed (for Senator Klobuchar) to instruct Senate conferees(Afghan refugees) agreed to in Senate by Voice Vote.\n\n        -- Motion by Senator Wicker (for Senator Rubio) to instruct Senate conferees made in Senate.\n\n        -- Motion by Senator Wicker (for Senator Rubio) to instruct Senate conferees (Hamas Visas) rejected in Senate by Voice Vote.\n\n        -- Motion by Senator Reed (for Senator Hickenlooper) to instruct Senate conferees made in Senate.\n\n        -- Motion by Senator Reed (for Senator Hickenlooper) to instruct Senate conferees (Space Command) agreed to in Senate by Voice Vote.\n\n        -- Motion by Senator Wicker (for Senator Blackburn) to instruct Senate conferees made in Senate.\n\n        -- Motion by Senator Wicker (for Senator Blackburn) to instruct Senate conferees (Transfer of Funds) agreed to in Senate by Voice Vote.\n\n        -- Motion by Senator Wicker (for Senator Lankford) to instruct Senate conferees made in Senate.\n\n        -- Motion by Senator Wicker (for Senator Lankford) to instruct Senate conferees (Israel) agreed to in Senate by Voice Vote.\n\n        -- Motion by Senator Lummis to instruct Senate conferees made in Senate.\n\n        -- Motion by Senator Lummis to instruct Senate conferees (Crypto) agreed to inSenate by Voice Vote.\n\n        -- Motion by Senator Wicker (for Senator Cramer) to instruct Senate conferees made in Senate.\n\n        -- Motion by Senator Wicker (for Senator Cramer) to instruct Senate conferees (Air Force Capability) agreed to in Senate by Voice Vote.\n\n        -- Motion by Senator Wicker (for Senator Moran) to instruct Senate conferees made in Senate.\n\n        -- Motion by Senator Wicker (for Senator Moran) to instruct Senate conferees (Commissary) agreed to in Senate by Voice Vote.\n\n        -- Motion by Senator Wicker (for Senator Ernst) to instruct Senate conferees made in Senate.\n\n        -- Motion by Senator Wicker (for Senator Ernst) to instruct Senate conferees (National Security Council) agreed to in Senate by Voice Vote.\n\n        -- Motion by Senator Wicker (for Senator Hagerty) to instruct Senate confereesmade in Senate.\n\n        -- Motion by Senator Wicker (for Senator Hagerty) to instruct Senate conferees(Biotechnology) agreed to in Senate by Voice Vote.\n\n        -- Motion by Senator Wicker (for Senator Braun) to instruct Senate conferees made in Senate.\n\n        -- Motion by Senator Wicker (for Senator Braun) to instruct Senate conferees (Chief Management Officer) agreed to in Senate by Voice Vote.\n\n        -- Motion by Senator Reed (for Senator Manchin) to instruct Senate conferees made in Senate.\n\n        -- Motion by Senator Reed (for Senator Manchin) to instruct Senate conferees (Nuclear Fuel) agreed to in Senate by Voice Vote.\n\n        -- Senate appointed conferees. Reed; Shaheen; Gillibrand; Blumenthal; Hirono; Kaine; King; Warren; Peters; Manchin; Duckworth; Rosen; Kelly; Wicker; Fischer; Cotton; Rounds; Ernst; Sullivan; Cramer; Scott FL; Tuberville; Mullin; Budd; Schmitt.\n\n\n H.R. 6363 (Rep. Granger):\n        A bill making further continuing appropriations for fiscal year 2024, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure withdrawn by unanimous consent in Senate.\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Unanimous Consent.\n\n        -- Measure laid before Senate by motion.\n\n        -- Passed Senate, under the order of 11/15/2023, having achieved 60 votes in the affirmative, without amendment by Yea-Nay Vote. 87 - 11. Record Vote Number: 312 \n\n \n\n S.Amdt. 1366 (Sen. Paul):\n        To reduce continuing funding by 15 percent, exceptfor the Department of Defense, military construction, and the Department ofVeterans Affairs and to rescind $30,000,000,000 from enforcement funds provided to the Internal Revenue Service.\n\n        --Amendment SA 1366 proposed by Senator Paul.\n\n        --Amendment SA 1366 not agreed to in Senate by Yea-Nay Vote. 32 - 65. Record Vote Number: \n\n\n\n\n S. 3000 (Sen. Peters):\n        A bill to repeal Freedom Support Act section 907 waiver authority with respect to assistance to Azerbaijan.\n\n        -- Senate Committee on Foreign Relations discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Voice Vote.\n \n\n S.Amdt. 1367 (Sen. Peters):\n        In the nature of a substitute.\n\n        --Amendment SA 1367 proposed by Senator Peters.\n\n        --Amendment SA 1367 agreed to in Senate by Voice Vote.\n\n\n\n\n S.J.Res. 43 (Sen. Cassidy):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Department of Education relating to \"Improving Income Driven Repayment for the William D. Ford Federal Direct Loan Program and the Federal Family Education Loan (FFEL) Program\".\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Unanimous Consent.\n\n        -- Failed of passage in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 310","actionTimeStamp":"--"},{"index":5,"header":"Legislative Business (Thursday, November 16)","actionItem":"S. 106 (Sen. Baldwin):\n        A bill to amend title 38, United States Code, to authorize the Secretary of Veterans Affairs to award grants to States to improve outreach to veterans, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute withdrawn by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 1368 (Sen. Baldwin):\n        To improve the bill.\n\n        --Amendment SA 1368 proposed by Senator Schumer for Senator Baldwin.\n\n        --Amendment SA 1368 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 1510 (Sen. Braun):\n        A bill to amend provisions relating to the Office of the Inspector General of the Government Accountability Office, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 1369 (Sen. Braun):\n        In the nature of a substitute.\n\n        --Amendment SA 1369 proposed by Senator Schumer for Senator Braun.\n\n        --Amendment SA 1369 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 468 (Sen. Warnock):\n        A resolution designating November 26, 2023, as \"Drive Safer Sunday\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 469 (Sen. Cortez Masto):\n        A resolution commending and congratulating the LasVegas Aces basketball team on winning the 2023 Women's National Basketball Association Championship.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 470 (Sen. Barrasso):\n        A resolution designating November 16th, 2023, as \"National Rural Health Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 471 (Sen. Klobuchar):\n        A resolution expressing support for the goals of National Adoption Day and National Adoption Month by promoting national awareness of adoption and the children awaiting families, celebrating children and families involved in adoption, and encouraging the people of the United States to secure safety, permanency, and well-being for all children.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":6,"header":"Executive Business (Thursday, November 16)","actionItem":"PN58:\n        Roger F. Nyhus, of Washington, to be Ambassador toBarbados, and to serve concurrently and without additional compensation as Ambassador to the Federation of Saint Kitts and Nevis, Saint Lucia, Antiguaand Barbuda, the Commonwealth of Dominica, Grenada, and Saint Vincent and the Grenadines\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN157:\n        Jose Javier Rodriguez, of Florida, to be an Assistant Secretary of Labor\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII.\n\n\n PN817:\n        Margaret M. Garnett, of New York, to be United States District Judge for the Southern District of New York\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN903:\n        Jeffrey M. Bryan, of Minnesota, to be United States District Judge for the District of Minnesota\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- By unanimous consent agreement, debate 11/27/2023.","actionTimeStamp":"--"},{"index":7,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  3:43 a.m, the Presiding Officer (Mr. Welch in the chair) declared the Senateadjourned, under its order of today, until  7:30 a.m. on Friday, November 17, 2023.","actionTimeStamp":"--"}]}