{"retrieved-date":"2025-1-6","actions-date":"Fri, 03 Jan 2025 18:26:05 -0500","actions-title":"House Floor Proceedings","actions-count":75,"actions-list":[{"index":1,"header":"--","actionItem":"The House adjourned pursuant to a previous special order. The next meeting is scheduled for 12:00 p.m. on January 6, 2025.","actionTimeStamp":"Fri, 03 Jan 2025 18:26:05 -0500"},{"index":2,"header":"--","actionItem":"On motion to adjourn Agreed to by voice vote.","actionTimeStamp":"Fri, 03 Jan 2025 18:26:02 -0500"},{"index":3,"header":"--","actionItem":"Mrs. Fischbach moved that the House do now adjourn.","actionTimeStamp":"Fri, 03 Jan 2025 18:26:00 -0500"},{"index":4,"header":"--","actionItem":"Mrs. Fischbach asked unanimous consent when the House adjourns on Friday, January 3, 2025, it adjourn to meet on Monday, January 6, 2025, at noon. Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 18:25:32 -0500"},{"index":5,"header":"--","actionItem":"The Speaker announced that pursuant to S. Con. Res. 1, 119th Congress and the order of the House today, the Chair appointed the following members on the part of the House to the Joint Congressional Committee on Inaugural Ceremonies: Mr. Johnson of Louisiana, Mr. Scalise of Louisiana, and Mr. Jeffries of New York.","actionTimeStamp":"Fri, 03 Jan 2025 18:25:30 -0500"},{"index":6,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 18:24:51 -0500"},{"index":7,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 18:24:50 -0500"},{"index":8,"header":"--","actionItem":"Considered by unanimous consent. S. Con. Res. 3 — \"Authorizing the use of the rotunda of the Capitol for the lying in state of the remains of the late James Earl Carter, Jr., 39th President of the United States.\"","actionTimeStamp":"Fri, 03 Jan 2025 18:24:48 -0500"},{"index":9,"header":"--","actionItem":"Mrs. Fischbach asked unanimous consent to take from the Speaker's table and consider.","actionTimeStamp":"Fri, 03 Jan 2025 18:24:48 -0500"},{"index":10,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 18:23:19 -0500"},{"index":11,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 18:23:17 -0500"},{"index":12,"header":"--","actionItem":"Considered as privileged matter. S. Con. Res. 2 — \"To provide for the counting on January 6, 2025, of the electoral votes for President and Vice President of the United States.\"","actionTimeStamp":"Fri, 03 Jan 2025 18:23:16 -0500"},{"index":13,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 18:21:55 -0500"},{"index":14,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 18:21:21 -0500"},{"index":15,"header":"--","actionItem":"Considered as privileged matter. S. Con. Res. 1 — \"Extending the life of the Joint Congressional Committee on Inaugural Ceremonies.\"","actionTimeStamp":"Fri, 03 Jan 2025 18:21:20 -0500"},{"index":16,"header":"WHOLE NUMBER OF THE HOUSE","actionItem":"Under clause 5(d) of rule 20, the Chair announced to the House that the whole number of the House is 434.","actionTimeStamp":"Fri, 03 Jan 2025 18:21:00 -0500"},{"index":17,"header":"The Chair announced the Speaker's policies with respect to particular aspects of the legislative process and inserted in the Congressional Record announcements concerning: first, privileges of the floor; second, introduction of bills and resolutions; third, unanimous-consent requests for the consideration of legislation; fourth, recognition for 1-minute speeches; fifth, recognition for special-order speeches; sixth, decorum in debate; seventh, conduct of votes by electronic device; eighth, use of handouts on the House floor; ninth, use of electronic equipment on the House floor; and tenth, use of the Chamber. The Chair further announced that these announcements will reiterate the origins of the stated policies and that the Chair intends to continue in the 119th Congress the policies reflected in those statements and that the policy announced in the 102nd Congress with respect to jurisdictional concepts related to clause 5(a) of rule 21","actionItem":"tax and tariff measures","actionTimeStamp":"Fri, 03 Jan 2025 18:20:09 -0500"},{"index":18,"header":"--","actionItem":"The House received a message from the Clerk. Under Clause 2(g) of Rule II of the Rules of the U.S. House of Representatives, the Clerk notified the House that he designated Ms. Lisa P. Grant, Deputy Clerk, Ms. Sarah Meier, Legal Counsel, and Ms. Cheryl H. Muller, Chief Human Resources Officer, to sign any and all papers and do all other acts for him under the name of the Clerk of the House which they would be authorized to do by virtue of this designation, except such as are provided by statute, in case of his temporary absence or disability. This designation shall remain in effect for the 119th Congress or until modified by the Clerk.","actionTimeStamp":"Fri, 03 Jan 2025 18:18:01 -0500"},{"index":19,"header":"SPEAKER PRO TEMPORE","actionItem":"The Speaker appointed the Honorable Adrian Smith, the Honorable Robert Wittman, the Honorable Andy Harris, the Honorable Richard Hudson, the Honorable John Joyce (PA), the Honorable Guy Reschenthaler, and the Honorable Jen Kiggans to act as Speaker pro tempore to sign enrolled bills and joint resolutions through the remainder of the One Hundred Nineteenth Congress.","actionTimeStamp":"Fri, 03 Jan 2025 18:18:00 -0500"},{"index":20,"header":"--","actionItem":"The House received a communication from the Honorable Mike Johnson, Speaker. The Speaker designated Representative Steve Scalise of Louisiana to exercise any authority regarding assembly, reassembly, convening, or reconvening of the House pursuant to H. Con. Res. 1, clause 12 of rule I, and any concurrent resolutions of the current Congress as may contemplate his designation of Members to exercise similar authority. In the event of the death or inability of that designee, the alternate Members of the House listed in the letter bearing this date that he had placed with the Clerk are designated, in turn, for the same purposes.","actionTimeStamp":"Fri, 03 Jan 2025 18:17:05 -0500"},{"index":21,"header":"--","actionItem":"The Chair announced that the Speaker has delivered to the Clerk a letter dated January 3, 2025, listing Members in the order in which each shall act as Speaker pro tempore under clause 8(b)(3) of rule I.","actionTimeStamp":"Fri, 03 Jan 2025 18:17:01 -0500"},{"index":22,"header":"EXTENSIONS OF REMARKS","actionItem":"Mrs. Fischbach asked unanimous consent that during the One Hundred Nineteenth Congress, all Members may be permitted to extend their remarks and to include extraneous material within the permitted limit in that section of the record entitled \"Extensions of Remarks.\" Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 18:15:04 -0500"},{"index":23,"header":"APPOINTMENT AUTHORITY","actionItem":"Mrs. Fischbach asked unanimous consent that during the One Hundred Nineteenth Congress, the Speaker, Majority Leader, and Minority Leader be authorized to accept resignations and to make appointments authorized by law or by the House. Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 18:14:03 -0500"},{"index":24,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 18:13:48 -0500"},{"index":25,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 18:13:34 -0500"},{"index":26,"header":"--","actionItem":"Considered as privileged matter. H. Con. Res. 1 — \"Regarding consent to assemble outside the seat of government.\"","actionTimeStamp":"Fri, 03 Jan 2025 18:13:32 -0500"},{"index":27,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 18:13:30 -0500"},{"index":28,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 18:13:26 -0500"},{"index":29,"header":"--","actionItem":"Considered as privileged matter. H. Res. 6 — \"Fixing the daily hour of meeting of the First Session of the One Hundred Nineteenth Congress.\"","actionTimeStamp":"Fri, 03 Jan 2025 18:13:03 -0500"},{"index":30,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 18:12:02 -0500"},{"index":31,"header":"On agreeing to the resolution Agreed to by the Yeas and Nays: 215","actionItem":"209 (Roll no. 5).","actionTimeStamp":"Fri, 03 Jan 2025 18:12:00 -0500"},{"index":32,"header":"On motion to commit the resolution to a select committee with instructions Failed by the Yeas and Nays: 209","actionItem":"214 (Roll no. 4).","actionTimeStamp":"Fri, 03 Jan 2025 18:06:14 -0500"},{"index":33,"header":"--","actionItem":"The previous question on the motion to commit was ordered without objection.","actionTimeStamp":"Fri, 03 Jan 2025 18:02:11 -0500"},{"index":34,"header":"--","actionItem":"Ms. DeLauro moved to commit the resolution to a select committee composed of the Majority Leader and the Minority Leader with instructions to report the same back to the House forthwith with an amendment.","actionTimeStamp":"Fri, 03 Jan 2025 18:02:10 -0500"},{"index":35,"header":"On ordering the previous question Agreed to by the Yeas and Nays: 216","actionItem":"210 (Roll no. 3).","actionTimeStamp":"Fri, 03 Jan 2025 17:57:16 -0500"},{"index":36,"header":"DEBATE","actionItem":"The House resumed debate on H. Res. 5.","actionTimeStamp":"Fri, 03 Jan 2025 17:23:52 -0500"},{"index":37,"header":"ORDER OF PROCEDURE","actionItem":"Mr. Fishbach asked unanimous consent that the Chair may reduce to 5 minutes the minimum time for electronic voting on any question relating to H. Res. 5 that follows a 15 minute vote. Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 17:23:51 -0500"},{"index":38,"header":"DEBATE","actionItem":"The House resumed debate on H. Res. 5.","actionTimeStamp":"Fri, 03 Jan 2025 16:54:01 -0500"},{"index":39,"header":"--","actionItem":"The House received a message from the Senate. The Senate agreed to S. Con. Res. 1, S. Con. Res. 2, and S. Con. Res. 3.","actionTimeStamp":"Fri, 03 Jan 2025 16:54:00 -0500"},{"index":40,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 5.","actionTimeStamp":"Fri, 03 Jan 2025 16:39:13 -0500"},{"index":41,"header":"--","actionItem":"Considered as privileged matter. H. Res. 5 — \"Adopting the Rules of the House of Representatives for the One Hundred Nineteenth Congress, and for other purposes.\"","actionTimeStamp":"Fri, 03 Jan 2025 16:38:56 -0500"},{"index":42,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 15:47:37 -0500"},{"index":43,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 15:47:17 -0500"},{"index":44,"header":"--","actionItem":"Considered as privileged matter. H. Res. 4 — \"Authorizing the Clerk to inform the President of the election of the Speaker and the Clerk.\"","actionTimeStamp":"Fri, 03 Jan 2025 15:47:07 -0500"},{"index":45,"header":"COMMITTEE TO REPORT","actionItem":"Without objection, pursuant to H. Res. 3, the Chair announced the Speaker's appointment of the following Members to the committee on the part of the House to join a committee on the part of the Senate to notify the President of the United States that a quorum of each House has assembled and that Congress is ready to receive any communication that he may be pleased to make: Mr. Scalise of Louisiana, and Mr. Jeffries of New York.","actionTimeStamp":"Fri, 03 Jan 2025 15:46:56 -0500"},{"index":46,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 15:46:36 -0500"},{"index":47,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 15:46:16 -0500"},{"index":48,"header":"--","actionItem":"Considered as privileged matter. H. Res. 3 — \"Authorizing the Speaker to appoint a committee to notify the President of the assembly of the Congress.\"","actionTimeStamp":"Fri, 03 Jan 2025 15:46:06 -0500"},{"index":49,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 15:45:35 -0500"},{"index":50,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 15:45:15 -0500"},{"index":51,"header":"--","actionItem":"Considered as privileged matter. H. Res. 2 — \"To inform the Senate that a quorum of the House has assembled and of the election of the Speaker and the Clerk.\"","actionTimeStamp":"Fri, 03 Jan 2025 15:45:04 -0500"},{"index":52,"header":"ADMINISTRATION OF THE OATH OF OFFICE","actionItem":"The Speaker administered the Oath of Office to the Officers of the House.","actionTimeStamp":"Fri, 03 Jan 2025 15:41:42 -0500"},{"index":53,"header":"Chaplain of the House of Representatives","actionItem":"Pursuant to the provisions of section 208(a) of the Legislative Reorganization Act of 1946, the Chair appointed Reverend Doctor Margaret Grun Kibben of the Commonwealth of Pennsylvania to act as and to exercise the duties of the Chaplain of the House of Representatives, effective today.","actionTimeStamp":"Fri, 03 Jan 2025 15:41:02 -0500"},{"index":54,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Fri, 03 Jan 2025 15:40:18 -0500"},{"index":55,"header":"--","actionItem":"On agreeing to the resolution Agreed to by voice vote.","actionTimeStamp":"Fri, 03 Jan 2025 15:40:08 -0500"},{"index":56,"header":"--","actionItem":"On agreeing to the Aguilar amendment; Failed by voice vote.","actionTimeStamp":"Fri, 03 Jan 2025 15:40:08 -0500"},{"index":57,"header":"--","actionItem":"An amendment, offered by Mr. Aguilar,  to elect officers of the House.","actionTimeStamp":"Fri, 03 Jan 2025 15:40:07 -0500"},{"index":58,"header":"--","actionItem":"Considered as privileged matter. H. Res. 1 — \"Electing officers of the House of Representatives.\"","actionTimeStamp":"Fri, 03 Jan 2025 15:39:50 -0500"},{"index":59,"header":"ANNOUNCEMENT OF LEADERSHIP POSTS","actionItem":"Mr. Aguilar of California notified the House that, at the direction of the Democratic Caucus, Mr. Jeffries of New York had been elected Minority Leader, and that Ms. Clark of Massachusetts had been elected as Minority Whip.","actionTimeStamp":"Fri, 03 Jan 2025 15:38:56 -0500"},{"index":60,"header":"ANNOUNCEMENT OF LEADERSHIP POSTS","actionItem":"Mrs. McClain of Michigan notified the House that, at the direction of the Republican Conference, Mr. Scalise of Louisiana had been elected as Majority Leader and Mr. Emmer of Minnesota had been elected as Majority Whip.","actionTimeStamp":"Fri, 03 Jan 2025 15:38:00 -0500"},{"index":61,"header":"ADMINISTRATION OF THE OATH OF OFFICE","actionItem":"The Speaker administered the Oath of Office to the Members-elect of the 119th Congress.","actionTimeStamp":"Fri, 03 Jan 2025 15:27:04 -0500"},{"index":62,"header":"ADMINISTRATION OF THE OATH OF OFFICE","actionItem":"The Dean of the House administered the Oath of Office to the Speaker-elect.","actionTimeStamp":"Fri, 03 Jan 2025 15:26:03 -0500"},{"index":63,"header":"ADDRESS BY THE SPEAKER-ELECT","actionItem":"The Speaker-elect addressed the House prior to taking the Oath of Office which will be administered by the Dean of the House, Representative-elect Harold Rogers, Kentucky.","actionTimeStamp":"Fri, 03 Jan 2025 15:05:20 -0500"},{"index":64,"header":"--","actionItem":"The Speaker-elect was escorted into the Chamber by the Escort Committee and introduced by Representative-elect Jeffries, Democratic Leader, before assuming the Chair.","actionTimeStamp":"Fri, 03 Jan 2025 14:50:51 -0500"},{"index":65,"header":"COMMITTEE TO ESCORT THE SPEAKER-ELECT","actionItem":"The Acting Clerk appointed a Committee of Members-elect to escort the Speaker-elect into the Chamber and to the Chair.","actionTimeStamp":"Fri, 03 Jan 2025 14:36:50 -0500"},{"index":66,"header":"Roll call 2","actionItem":"Election of the Speaker. Mr. Johnson (LA) 218, Mr. Jeffries 215, and Mr. Emmer 1 (Roll no. 2). Mr. Johnson (LA) was elected Speaker of the House.","actionTimeStamp":"Fri, 03 Jan 2025 14:36:44 -0500"},{"index":67,"header":"APPOINTMENT OF TELLERS","actionItem":"The Acting Clerk announced the appointment of the following Members-elect to act as Tellers during the Roll Call for Election of Speaker: Ms. Foxx, Mr. Morelle, Mr. Steil, and Mrs. Torres (CA).","actionTimeStamp":"Fri, 03 Jan 2025 12:50:27 -0500"},{"index":68,"header":"NOMINATIONS FOR OFFICE OF SPEAKER","actionItem":"Pursuant to law and precedent, the Acting Clerk announced that the next order of business was the election of the Speaker of the House of Representatives and that nominations would now be in order. Accordingly, the Honorable Lisa C. McClain of Michigan placed the name of the Honorable Mike Johnson into nomination for the Office of Speaker and the Honorable Pete Aguilar of California placed the name of the Honorable Hakeem S. Jeffries into nomination for the Office of Speaker. No other nominations were put forward.","actionTimeStamp":"Fri, 03 Jan 2025 12:49:26 -0500"},{"index":69,"header":"--","actionItem":"The Acting Clerk notified the House that he received a letter from the Honorable Matt Gaetz of Florida indicating that he will not serve in the House in the 119th Congress. Without objection, the letters relating to his resignation will be printed in the record.","actionTimeStamp":"Fri, 03 Jan 2025 12:37:25 -0500"},{"index":70,"header":"ELECTION CREDENTIALS FOR DELEGATES","actionItem":"The Acting Clerk notified the House that election credentials for all Delegates and the Resident Commissioner had been received.","actionTimeStamp":"Fri, 03 Jan 2025 12:36:39 -0500"},{"index":71,"header":"--","actionItem":"Call by States Quorum responded: 433 present (Roll no. 1).","actionTimeStamp":"Fri, 03 Jan 2025 12:36:31 -0500"},{"index":72,"header":"CERTIFICATION OF ELECTION","actionItem":"The Acting Clerk announced that Certificates of Election covering 435 seats in the One Hundred Nineteenth Congress had been received and the names of those persons whose credentials show that they were regularly elected as Representatives in accordance with the laws of their respective States of the United States would be called. Without objection, the Representatives-elect were directed to record their presence by electronic device in order to determine whether a quorum was present.","actionTimeStamp":"Fri, 03 Jan 2025 12:04:07 -0500"},{"index":73,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Acting Clerk led the House in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Fri, 03 Jan 2025 12:03:06 -0500"},{"index":74,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Fri, 03 Jan 2025 12:01:05 -0500"},{"index":75,"header":"--","actionItem":"House convened, starting a new legislative day, pursuant to the 20th amendment to the Constitution, for the meeting of the One Hundred Nineteenth Congress of the United States.","actionTimeStamp":"Fri, 03 Jan 2025 12:00:00 -0500"}]}