{"retrieved-date":"2022-12-13","actions-date":"Thursday, December 8, 2022","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, December  8)","actionItem":"H.R. 310 (Rep. Lynch):\n        A bill to posthumously award the Congressional Gold Medal, collectively, to Glen Doherty, Tyrone Woods, J. Christopher Stevens, and Sean Smith, in recognition of their contributions to the Nation.\n\n        -- Senate Committee on Banking, Housing, and Urban Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7535 (Rep. Khanna):\n        A bill to encourage the migration of Federal Government information technology systems to quantum-resistant cryptography , and for other purposes.\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6510 (Sen. Hassan):\n        In the nature of a substitute.\n\n        --Amendment SA 6510 proposed by Senator Cardin for Senator Hassan.\n\n        --Amendment SA 6510 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 2333 (Sen. Cantwell):\n        A bill to amend chapter 2205 of title 36, United States Code, to ensure equal treatment of athletes, and for other purposes.\n\n        -- Passed Senate with an amendment by Voice Vote.\n\n\n S. 2834 (Sen. Durbin):\n        A bill to amend title XVIII of the Social Security Act to preserve access to rehabilitation innovation centers under the Medicare program.\n\n        -- Senate Committee on Finance discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Voice Vote.\n \n\n S.Amdt. 6509 (Sen. Durbin):\n        In the nature of a substitute.\n\n        --Amendment SA 6509 proposed by Senator Cardin for Senator Durbin.\n\n        --Amendment SA 6509 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 4216 (Sen. Rubio):\n        A bill to reauthorize the North Korean Human Rights Act of 2004, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute withdrawn by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Voice Vote.\n \n\n S.Amdt. 6511 (Sen. Rubio):\n        In the nature of a substitute.\n\n        --Amendment SA 6511 proposed by Senator Cardin for Senator Rubio.\n\n        --Amendment SA 6511 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 5229 (Sen. Cardin):\n        A bill to direct the Joint Committee of Congress on the Library to remove the bust of Roger Brooke Taney in the Old Supreme Court Chamber of the Capitol and to obtain a bust of Thurgood Marshall for installation in the Capitol or on the Capitol Grounds, and for other purposes.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.\n\n\n S. 5230 (Sen. Murphy):\n        A bill to increase accessibility to the National Missing and Unidentified Persons System, to facilitate data sharing between such system and the National Crime Information Center database of the Federal Bureau of Investigation, and for other purposes.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.\n\n\n S.Res. 124 (Sen. Cardin):\n        A resolution celebrating the heritage of Romani Americans.\n\n        -- Resolution agreed to in Senate with an amendment and an amended preamble by Unanimous Consent.\n\n\n S.Res. 866 (Sen. Smith):\n        A resolution expressing support for the designation of October 2022 as \"National Co-Op Month\" and commending the cooperative business model and the member-owners, businesses, employees, farmers, ranchers, and practitioners who use the cooperative business model to positively impact the economy and society.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 867 (Sen. Schatz):\n        A resolution relating to the death of the Alan R. Parker, former Staff Director and Chief Counsel of the Committee on Indian Affairs of the Senate.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 868 (Sen. Scott, of SC):\n        A resolution expressing support for the designation of September 2022 as \"Sickle Cell Disease Awareness Month\" in order to educate communities across the United States about sickle cell disease and the need for research, early detection methods, effective treatments, and preventative care programs with respect to complications from sickle cell disease and conditions related to sickle cell disease.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, December  8)","actionItem":"PN2169:\n        Ryan Giralt Bedford, in the Foreign Service\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2261:\n        Dana M. Douglas, of Louisiana, to be United States Circuit Judge for the Fifth Circuit\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 63 - 31. Record Vote Number: 386 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, vote to be determined.\n\n\n PN2315:\n        Tamika R. Montgomery-Reeves, of Delaware, to be United States Circuit Judge for the Third Circuit\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 57 - 39. Record Vote Number: 385 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate and vote 12/12/2022.\n\n\n PN2401:\n        Shailen P. Bhatt, of Michigan, to be Administrator of the Federal Highway Administration\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2438:\n        Jeffery Paul Hopkins, of Ohio, to be United States District Judge for the Southern District of Ohio\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 64 - 32. Record Vote Number: 384 \n\n\n\n PN2515:\n        8 nominations in the Coast Guard beginning with Capt. Richard E. Batson and ending with Capt. Wilborne E. Watson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2677:\n        173 nominations in the Coast Guard beginning with William C. Adams and ending with Yvonne C. Yang\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2678:\n        83 nominations in the Coast Guard beginning with Craig H. Allen, Jr. and ending with Nicholas S. Worst\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2683:\n        5 nominations in the Coast Guard beginning with Mary M. Dean and ending with Michael W. Raymond\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2691:\n        5 nominations in the Coast Guard beginning with Brian J. Maggi and ending with Lisa M. Thompson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2728:\n        Capt. William G. Dwyer, in the Coast Guard, to be Rear Admiral (Lower Half)\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2774:\n        4 nominations in the Coast Guard beginning with Troy E. Fryar and ending with John D. Hughes\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2775:\n        52 nominations in the Foreign Service beginning with Gary P. Anthony and ending with Stephanie A. Bunce\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2794:\n        9 nominations in the Coast Guard beginning with Amber S. Ward and ending with Christopher Anderson\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Cardin, at 11:00 a.m., the Senate adjourned, under its order of today, until 3 p.m. on Monday, December 12, 2022.","actionTimeStamp":"--"}]}