{"retrieved-date":"2024-1-16","actions-date":"Thursday, January 11, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, January 11)","actionItem":"H.R. 2872 (Rep. Graves):\n        To amend the Permanent Electronic Duck Stamp Act of 2013 to allow the Secretary of the Interior to issue electronic stamps under such Act, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.\n\n\n S. 2414 (Sen. Braun):\n        A bill to require agencies with working dog programs to implement the recommendations of the Government Accountability Office relating to the health and welfare of working dogs, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 519 (Sen. Thune):\n        A resolution congratulating the South Dakota State University Jackrabbits on winning the 2024 National Collegiate Athletic Association Division I Football Championship Subdivision title.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 521 (Sen. Sullivan):\n        A resolution commending Taiwan for its history of democratic elections, and expressing support of Taiwan's democratic institutions.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 522 (Sen. Schumer):\n        A resolution to authorize testimony and representation in United States v. Todd.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 523 (Sen. Baldwin):\n        A resolution honoring the life and legacy of the late Senator Herb Kohl.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, January 11)","actionItem":"PN837:\n        Erika L. McEntarfer, of the District of Columbia, to be Commissioner of Labor Statistics, Department of Labor, for a term of four years\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 88 - 8. Record Vote Number: 6 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 86 - 8. Record Vote Number: 7","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  3:11 p.m, the Presiding Officer (Mr. Booker in the chair) declared the Senate adjourned, under its order of today, until  8:45 a.m. tomorrow.","actionTimeStamp":"--"}]}