{"retrieved-date":"2023-12-7","actions-date":"Thu, 07 Dec 2023 09:13:52 -0500","actions-title":"House Floor Proceedings","actions-count":8,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H.J. Res. 88.","actionTimeStamp":"Thu, 07 Dec 2023 09:13:52 -0500"},{"index":2,"header":"--","actionItem":"Rule provides for consideration of H.R. 4468, H.R. 5933 and H.J. Res. 88. The resolution provides for consideration of H.R. 4468 and H.R. 5933 under a structured rule and H.J. Res. 88 under a closed rule. Rule provides for one hour of general debate and one motion to recommit on each measure.","actionTimeStamp":"Thu, 07 Dec 2023 09:12:30 -0500"},{"index":3,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 906. H.J. Res. 88 — \"Providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Department of Education relating to \"Improving Income Driven Repayment for the William D. Ford Federal Direct Loan Program and the Federal Family Education Loan (FFEL) Program\".\"","actionTimeStamp":"Thu, 07 Dec 2023 09:12:25 -0500"},{"index":4,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair would be limited to 5 per side of the aisle.","actionTimeStamp":"Thu, 07 Dec 2023 09:04:31 -0500"},{"index":5,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Ms. Dean of PA to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 07 Dec 2023 09:02:40 -0500"},{"index":6,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Thu, 07 Dec 2023 09:02:36 -0500"},{"index":7,"header":"--","actionItem":"Today's prayer was offered by Bishop Larry Lawrence Brandon, Praise Temple, Shreveport, Louisiana.","actionTimeStamp":"Thu, 07 Dec 2023 09:01:02 -0500"},{"index":8,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 07 Dec 2023 09:00:00 -0500"}]}