{"retrieved-date":"2024-3-7","actions-date":"Wed, 06 Mar 2024 19:25:29 -0500","actions-title":"House Floor Proceedings","actions-count":62,"actions-list":[{"index":1,"header":"--","actionItem":"The House adjourned. The next meeting is scheduled for 10:00 a.m. on March 7, 2024.","actionTimeStamp":"Wed, 06 Mar 2024 19:25:29 -0500"},{"index":2,"header":"--","actionItem":"On motion to adjourn Agreed to by voice vote.","actionTimeStamp":"Wed, 06 Mar 2024 19:25:28 -0500"},{"index":3,"header":"--","actionItem":"Mr. Roy moved that the House do now adjourn.","actionTimeStamp":"Wed, 06 Mar 2024 19:25:23 -0500"},{"index":4,"header":"SPECIAL ORDER SPEECHES","actionItem":"The House has concluded all anticipated legislative business and has proceeded to Special Order speeches.","actionTimeStamp":"Wed, 06 Mar 2024 18:09:01 -0500"},{"index":5,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with further one minute speeches.","actionTimeStamp":"Wed, 06 Mar 2024 18:07:47 -0500"},{"index":6,"header":"--","actionItem":"Committee of the Whole House on the state of the Union rises leaving H.R. 2799 as unfinished business.","actionTimeStamp":"Wed, 06 Mar 2024 18:06:44 -0500"},{"index":7,"header":"--","actionItem":"On motion that the committee rise Agreed to by voice vote.","actionTimeStamp":"Wed, 06 Mar 2024 18:06:32 -0500"},{"index":8,"header":"--","actionItem":"Mrs. Wagner moved that the committee rise.","actionTimeStamp":"Wed, 06 Mar 2024 18:06:17 -0500"},{"index":9,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Sherman amendment No. 5, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Mrs. Wagner demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 06 Mar 2024 18:05:41 -0500"},{"index":10,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1052, the Committee of the Whole proceeded with 10 minutes of debate on the Sherman amendment No. 5.","actionTimeStamp":"Wed, 06 Mar 2024 17:57:08 -0500"},{"index":11,"header":"--","actionItem":"An amendment, offered by Mr. Sherman,  numbered 5 printed in Part B of House Report 118-407 to allow an individual to invest not more than 5 percent of the net worth of the individual excluding the individual's primary residence in any one private offering. To limit the aggregate investment of the individual in private offerings to 25 percent of the net worth of the individual excluding the individual's primary residence.","actionTimeStamp":"Wed, 06 Mar 2024 17:57:07 -0500"},{"index":12,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Wagner amendment No. 4, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Waters demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 06 Mar 2024 17:56:40 -0500"},{"index":13,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1052, the Committee of the Whole proceeded with 10 minutes of debate on the Wagner amendment No. 4.","actionTimeStamp":"Wed, 06 Mar 2024 17:48:40 -0500"},{"index":14,"header":"--","actionItem":"An amendment, offered by Mrs. Wagner,  numbered 4 printed in Part B of House Report 118-407 to allow a closed-end investment company, an entity that invests in securities using money raised in its initial public offering, to invest its assets in securities issued by private funds.","actionTimeStamp":"Wed, 06 Mar 2024 17:48:38 -0500"},{"index":15,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Lucas amendment No. 3, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Waters demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 06 Mar 2024 17:48:13 -0500"},{"index":16,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1052, the Committee of the Whole proceeded with 10 minutes of debate on the Lucas amendment No. 3.","actionTimeStamp":"Wed, 06 Mar 2024 17:37:57 -0500"},{"index":17,"header":"--","actionItem":"An amendment, offered by Mr. Lucas,  numbered 3 printed in Part B of House Report 118-407 to amend Federal securities laws to allow 403(b) plans to invest in collective investment trusts (CITs) and insurance contracts that currently may be invested in by comparable retirement plans, such as 401(k)s.","actionTimeStamp":"Wed, 06 Mar 2024 17:37:55 -0500"},{"index":18,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Huizenga amendment No. 2, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Huizenga demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 06 Mar 2024 17:37:24 -0500"},{"index":19,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1052, the Committee of the Whole proceeded with 10 minutes of debate on the Huizenga amendment No. 2.","actionTimeStamp":"Wed, 06 Mar 2024 17:26:54 -0500"},{"index":20,"header":"--","actionItem":"An amendment, offered by Mr. Huizenga,  numbered 2 printed in Part B of House Report 118-407 to direct the Securities and Exchange Commission to promulgate rules with respect to the electronic delivery of certain required disclosures to investors.","actionTimeStamp":"Wed, 06 Mar 2024 17:26:52 -0500"},{"index":21,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Lawler amendment No. 1, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Waters demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 06 Mar 2024 17:26:11 -0500"},{"index":22,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1052, the Committee of the Whole proceeded with 10 minutes of debate on the Lawler amendment No. 1.","actionTimeStamp":"Wed, 06 Mar 2024 17:16:05 -0500"},{"index":23,"header":"--","actionItem":"An amendment, offered by Mr. Lawler,  numbered 1 printed in Part B of House Report 118-407 to clarify the definition of \"general solicitation\" and \"angel investor\" for purposes of the federal securities laws to ensure that startups can discuss their products and business plans at certain events, known as \"demo days.\"","actionTimeStamp":"Wed, 06 Mar 2024 17:16:01 -0500"},{"index":24,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 2799.","actionTimeStamp":"Wed, 06 Mar 2024 16:32:21 -0500"},{"index":25,"header":"--","actionItem":"The Speaker designated the Honorable Brad R. Wenstrup to act as Chairman of the Committee.","actionTimeStamp":"Wed, 06 Mar 2024 16:31:15 -0500"},{"index":26,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 1052 and Rule XVIII.","actionTimeStamp":"Wed, 06 Mar 2024 16:31:10 -0500"},{"index":27,"header":"--","actionItem":"Rule provides for consideration of H.R. 2799 and H.R. 7511. Resolution provides for consideration of H.R. 2799, under a structured rule with one hour of general debate and one motion to recommit. The resolution provides for consideration of H.R. 7511 under a closed rule with one hour of general debate and one motion to recommit.","actionTimeStamp":"Wed, 06 Mar 2024 16:30:41 -0500"},{"index":28,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 1052. H.R. 2799 — \"To make reforms to the capital markets of the United States, and for other purposes.\"","actionTimeStamp":"Wed, 06 Mar 2024 16:30:36 -0500"},{"index":29,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Wed, 06 Mar 2024 16:27:55 -0500"},{"index":30,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Wed, 06 Mar 2024 16:27:53 -0500"},{"index":31,"header":"--","actionItem":"Considered by unanimous consent. H. Con. Res. 94 — \"Directing the Clerk of the House of Representatives to make a correction in the enrollment of H.R. 4366.\"","actionTimeStamp":"Wed, 06 Mar 2024 16:26:59 -0500"},{"index":32,"header":"--","actionItem":"Mr. Womack asked unanimous consent to consider as introduced.","actionTimeStamp":"Wed, 06 Mar 2024 16:26:56 -0500"},{"index":33,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Wed, 06 Mar 2024 16:26:32 -0500"},{"index":34,"header":"On motion to suspend the rules and pass the bill Agreed to by the Yeas and Nays: (2/3 required): 413","actionItem":"7 (Roll no. 65).","actionTimeStamp":"Wed, 06 Mar 2024 16:26:30 -0500"},{"index":35,"header":"--","actionItem":"Considered as unfinished business. H.R. 3821 — \"To reauthorize the Firefighter Cancer Registry Act of 2018.\"","actionTimeStamp":"Wed, 06 Mar 2024 16:20:34 -0500"},{"index":36,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Wed, 06 Mar 2024 16:20:32 -0500"},{"index":37,"header":"On motion to suspend the rules and agree to the resolution Agreed to by the Yeas and Nays: (2/3 required): 339","actionItem":"85 (Roll no. 64).","actionTimeStamp":"Wed, 06 Mar 2024 16:20:23 -0500"},{"index":38,"header":"--","actionItem":"Considered as unfinished business. H. Res. 1061 — \"Providing for the concurrence by the House in the Senate amendment to H.R. 4366, with an amendment.\"","actionTimeStamp":"Wed, 06 Mar 2024 16:13:35 -0500"},{"index":39,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Wed, 06 Mar 2024 16:13:34 -0500"},{"index":40,"header":"On agreeing to the resolution Agreed to by recorded vote: 214","actionItem":"211 (Roll no. 63).","actionTimeStamp":"Wed, 06 Mar 2024 16:13:32 -0500"},{"index":41,"header":"On ordering the previous question Agreed to by the Yeas and Nays: 215","actionItem":"205 (Roll no. 62).","actionTimeStamp":"Wed, 06 Mar 2024 16:04:48 -0500"},{"index":42,"header":"--","actionItem":"Considered as unfinished business. H. Res. 1052 — \"Providing for consideration of the bill (H.R. 2799) to make reforms to the capital markets of the United States, and for other purposes, and providing for consideration of the bill (H.R. 7511) to require the Secretary of Homeland Security to take into custody aliens who have been charged in the United States with theft, and for other purposes.\"","actionTimeStamp":"Wed, 06 Mar 2024 15:31:50 -0500"},{"index":43,"header":"UNFINISHED BUSINESS","actionItem":"The Chair announced that the unfinished business was the question on ordering the previous question on H. Res. 1052, on agreeing to the resolution, if ordered, and on motions to suspend the rules which had been debated earlier and on which further proceedings had been postponed.","actionTimeStamp":"Wed, 06 Mar 2024 15:31:31 -0500"},{"index":44,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of March 6.","actionTimeStamp":"Wed, 06 Mar 2024 15:31:30 -0500"},{"index":45,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is subject to the call of the Chair.","actionTimeStamp":"Wed, 06 Mar 2024 13:51:37 -0500"},{"index":46,"header":"--","actionItem":"At the conclusion of debate, the Yeas and Nays were demanded and ordered. Pursuant to the provisions of clause 8, rule XX, the Chair announced that further proceedings on the motion would be postponed.","actionTimeStamp":"Wed, 06 Mar 2024 13:51:05 -0500"},{"index":47,"header":"DEBATE","actionItem":"The House proceeded with forty minutes of debate on H. Res. 1061.","actionTimeStamp":"Wed, 06 Mar 2024 13:09:41 -0500"},{"index":48,"header":"--","actionItem":"Considered under suspension of the rules.","actionTimeStamp":"Wed, 06 Mar 2024 13:09:37 -0500"},{"index":49,"header":"--","actionItem":"Ms. Granger moved to suspend the rules and agree to the resolution. H. Res. 1061 — \"Providing for the concurrence by the House in the Senate amendment to H.R. 4366, with an amendment.\"","actionTimeStamp":"Wed, 06 Mar 2024 13:08:07 -0500"},{"index":50,"header":"--","actionItem":"The Speaker announced that votes on suspensions, if ordered, will be postponed until a time to be announced.","actionTimeStamp":"Wed, 06 Mar 2024 13:07:46 -0500"},{"index":51,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on H. Res. 1052, the Chair put the question on ordering the previous question and by voice vote, announced that the ayes had prevailed. Mr. McGovern demanded the yeas and nays and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 06 Mar 2024 13:07:02 -0500"},{"index":52,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 1052.","actionTimeStamp":"Wed, 06 Mar 2024 12:13:39 -0500"},{"index":53,"header":"--","actionItem":"Considered as privileged matter. H. Res. 1052 — \"Providing for consideration of the bill (H.R. 2799) to make reforms to the capital markets of the United States, and for other purposes, and providing for consideration of the bill (H.R. 7511) to require the Secretary of Homeland Security to take into custody aliens who have been charged in the United States with theft, and for other purposes.\"","actionTimeStamp":"Wed, 06 Mar 2024 12:10:41 -0500"},{"index":54,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches which by direction of the Chair, would be limited to 15 per side of the aisle.","actionTimeStamp":"Wed, 06 Mar 2024 12:03:08 -0500"},{"index":55,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Wilson of SC to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 06 Mar 2024 12:02:50 -0500"},{"index":56,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 06 Mar 2024 12:02:47 -0500"},{"index":57,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Wed, 06 Mar 2024 12:01:20 -0500"},{"index":58,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of March 6.","actionTimeStamp":"Wed, 06 Mar 2024 12:00:55 -0500"},{"index":59,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Wed, 06 Mar 2024 10:52:19 -0500"},{"index":60,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Wed, 06 Mar 2024 10:00:41 -0500"},{"index":61,"header":"--","actionItem":"The Speaker designated the Honorable Mike Ezell to act as Speaker pro tempore for today.","actionTimeStamp":"Wed, 06 Mar 2024 10:00:20 -0500"},{"index":62,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 06 Mar 2024 10:00:00 -0500"}]}