{"retrieved-date":"2025-2-27","actions-date":"Wednesday, February 26, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, February 26)","actionItem":"S.J.Res. 10 (Sen. Kaine):\n        A joint resolution terminating the national emergency declared with respect to energy.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent pursuant to the order of 02/18/2025.\n\n        -- Failed of passage in Senate by Yea-Nay Vote. 47 - 52. Record Vote Number: 95 \n\n\n\n S.J.Res. 12 (Sen. Hoeven):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Environmental Protection Agency relating to \"Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions\".\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 52 - 47. Record Vote Number: 96 \n\n\n        -- Measure laid before Senate by motion.\n\n\n S.Res. 99 (Sen. Booker):\n        A resolution celebrating Black History Month.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, February 26)","actionItem":"PN11-17:\n        Jamieson Greer, of Maryland, to be United States Trade Representative, with the rank of Ambassador\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 56 - 43. Record Vote Number: 94","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  8:56 p.m, the Presiding Officer (Mr. Husted in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}