{"retrieved-date":"2024-3-11","actions-date":"Thursday, March 7, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, March  7)","actionItem":"S. 992 (Sen. Cruz):\n        A bill to amend the Intermodal Surface Transportation Efficiency Act of 1991 to designate the Texas and New Mexico portions of the future Interstate-designated segments of the Port-to-Plains Corridor as Interstate Route 27, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Senate agreed to House amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S. 3853 (Sen. Hawley):\n        A bill to extend the period for filing claims under the Radiation Exposure Compensation Act and to provide for compensation under such Act for claims relating to Manhattan Project waste, and to improve compensation for workers involved in uranium mining.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate under the order of 2/29/2024, having achieved 60 votes in the affirmative, without amendment by Yea-Nay Vote. 69 - 30. Record Vote Number: 75","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, March  7)","actionItem":"PN158:\n        Linda A. Puchala, of Maryland, to be Member of the National Mediation Board for a term expiring July 1, 2024\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN159:\n        Linda A. Puchala, of Maryland, to be Member of the National Mediation Board for a term expiring July 1, 2027\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN160:\n        Deirdre Hamilton, of the District of Columbia, to be a Member of the National Mediation Board for a term expiring July 1, 2025\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN304:\n        Rebecca Kelly Slaughter, of Maryland, to be a Federal Trade Commissioner for the term of seven years from September 26, 2022\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN441:\n        Fara Damelin, of Virginia, to be Inspector General , Federal Communications Commission\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN446:\n        Loren E. Sweatt, of Virginia, to be a Member of the National Mediation Board for a term expiring July 1, 2023\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN447:\n        Loren E. Sweatt, of Virginia, to be a Member of the National Mediation Board for a term expiring July 1, 2026\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN482:\n        Douglas Dziak, of Virginia, to be a Commissioner of the Consumer Product Safety Commission for the remainder of the term expiring October 26, 2024\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN799:\n        Andrew N. Ferguson, of Virginia, to be a Federal Trade Commissioner for the unexpired term of seven years from September 26, 2016\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN800:\n        Andrew N. Ferguson, of Virginia, to be a Federal Trade Commissioner  for the term of seven years from September 26, 2023\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN801:\n        Melissa Holyoak, of Utah, to be a Federal Trade Commissioner for the unexpired term of seven years from September 26, 2018\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1294:\n        Kelly Harrison Rankin, of Wyoming, to be United States District Judge for the District of Wyoming\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1349:\n        Adrienne Jennings Noti, of the District of Columbia, to be an Associate Judge of the Superior Court of the District of Columbia for the term of fifteen years\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 46. Record Vote Number: 74 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 45. Record Vote Number: 76","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at 10:59 p.m, the Presiding Officer (Mr. Ossoff in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}