{"retrieved-date":"2024-11-21","actions-date":"Tuesday, November 19, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the      proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday,      the morning hour being deemed expired, and the times for the recognition      of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, November      19)","actionItem":"H.R. 599 (Rep. Gomez):\n                A bill to designate the facility of the United States Postal Service located at 3500 West 6th Street, Suite 103 in Los Angeles, California, as the \"Dosan Ahn Chang Ho Post Office\".      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n H.R. 807 (Rep. McHenry):\n                A bill to require the Secretary of the Treasury tomint coins in commemoration of the invaluable service that working dogs provide to society.      \n\n        --        Senate Committee on Banking, Housing, and Urban Affairs discharged by        Unanimous Consent.      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n H.R. 1060 (Rep. Aguilar):\n                A bill to designate the facility of the United States Postal Service located at 1663 East Date Place in San Bernardino, California, as the \"Dr. Margaret B. Hill Post Office Building\".      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n H.R. 1098 (Rep. Pappas):\n                A bill to designate the facility of the United States Postal Service located at 50 East Derry Road in East Derry, New Hampshire, as the \"Chief Edward B. Garone Post Office\".      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n H.R. 1505 (Rep. Issa):\n                A bill to modify the prohibition on recognition byUnited States courts of certain rights relating to certain marks, trade names, or commercial names.      \n\n        --        Senate Committee on the Judiciary discharged by Unanimous Consent.      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n H.R. 3608 (Rep. Kim):\n                A bill to designate the facility of the United States Postal Service located at 28081 Marguerite Parkway in Mission Viejo,California, as the \"Major Megan McClung Post Office Building\".      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n H.R. 3728 (Rep. Pressley):\n                A bill to designate the facility of the United States Postal Service located at 25 Dorchester Avenue, Room 1, in Boston, Massachusetts, as the \"Caroline Chang Post Office\".      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n H.R. 5476 (Rep. Fitzpatrick):\n                A bill to designate the facility of the United States Postal Service located at 1077 River Road, Suite 1, in Washington Crossing, Pennsylvania, as the \"Susan C. Barnhart Post Office\".      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n H.R. 5490 (Rep. Kiggans):\n                A bill to amend the Coastal Barrier Resources Act to expand the John H. Chafee Coastal Barrier Resources System, and for other purposes.      \n\n        --        Passed Senate without amendment by Voice Vote.      \n    \n\n H.R. 5640 (Rep. Joyce):\n                A bill to designate the facility of the United States Postal Service located at 12804 Chillicothe Road in Chesterland, Ohio, as the \"Sgt. Wolfgang Kyle Weninger Post Office Building\".      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n H.R. 5712 (Rep. Grothman):\n                A bill to designate the facility of the United States Postal Service located at 220 Fremont Street in Kiel, Wisconsin, as the \"Trooper Trevor J. Casper Post Office Building\".      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n H.R. 5985 (Rep. Levin):\n                A bill to designate the facility of the United States Postal Service located at 517 Seagaze Drive in Oceanside, California, as the \"Charlesetta Reece Allen Post Office Building\".      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n H.R. 6073 (Rep. Boyle):\n                A bill to designate the facility of the United States Postal Service located at 9925 Bustleton Avenue in Philadelphia, Pennsylvania, as the \"Sergeant Christopher David Fitzgerald Post Office Building\".      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n H.R. 6249 (Rep. Molinaro):\n                A bill to provide for a review and report on the assistance and resources that the Administrator of the Federal Emergency Management Agency provides to individuals with disabilities and the families of such individuals that are impacted by major disasters, and for other purposes.      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n H.R. 6651 (Rep. Tiffany):\n                A bill to designate the facility of the United States Postal Service located at 603 West 3rd Street in Necedah, Wisconsin,as the \"Sergeant Kenneth E. Murphy Post Office Building\".      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n H.R. 7192 (Rep. Correa):\n                A bill to designate the facility of the United States Postal Service located at 333 West Broadway in Anaheim, California, as the \"Dr. William I. 'Bill' Kott Post Office Building\".      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n H.R. 7199 (Rep. Fitzgerald):\n                A bill to designate the facility of the United States Postal Service located at S74w16860 Janesville Road, in Muskego, Wisconsin, as the \"Colonel Hans Christian Heg Post Office\".      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n H.R. 7423 (Rep. Scalise):\n                A bill to designate the facility of the United States Postal Service located at 103 Benedette Street in Rayville, Louisiana, as the \"Luke Letlow Post Office Building\".      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n S. 2181 (Sen. Peters):\n                A bill to amend title 38, United States Code, to repeal the sunset on entitlement to memorial headstones and markers for commemoration of veterans and certain individuals and to repeal the sunset on authority to bury remains of certain spouses and children in national cemeteries, and for other purposes.      \n\n        --        Message on House action received in Senate and at desk: House amendments to        Senate bill.      \n    \n\n S. 2546 (Sen. Sinema):\n                A bill to designate the facility of the United States Postal Service located at 100 North Taylor Lane in Patagonia, Arizona, as the \"Jim Kolbe Memorial Post Office\".      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n S. 3946 (Sen. Cruz):\n                A bill to designate the facility of the United States Postal Service located at 1106 Main Street in Bastrop, Texas, as the\"Sergeant Major Billy D. Waugh Post Office\".      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n S. 4077 (Sen. Padilla):\n                A bill to designate the facility of the United States Postal Service located at 180 Steuart Street in San Francisco, California, as the \"Dianne Feinstein Post Office\".      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n S.Res. 861 (Sen. Scott, of SC):\n                A resolution expressing support for the designation of September 2024 as \"Sickle Cell Disease Awareness Month\" in order to educate communities across the United States about sickle cell disease and the need for research, early detection methods, effective treatments, and preventative care programs with respect to complications from sickle cell disease and conditions related to sickle cell disease.      \n\n        --        Senate Committee on Health, Education, Labor, and Pensions discharged by        Unanimous Consent.      \n\n        --        Resolution agreed to in Senate without amendment and with a preamble by        Unanimous Consent.      \n    \n\n S.Res. 872 (Sen. Murray):\n                A resolution recognizing the life and the death ofDaniel J. Evans, former Senator for the State of Washington.      \n\n        --        Senate Committee on the Judiciary discharged by Unanimous Consent.      \n\n        --        Measure laid before Senate by unanimous consent.      \n\n        --        Resolution agreed to in Senate without amendment and an amended preamble by        Unanimous Consent.      \n         \n\n S.Amdt. 3303 (Sen. Murray):\n        To amend the preamble.\n\n        --            Amendment SA 3303 proposed by Senator Schumer for Senator Murray.          \n\n        --            Amendment SA 3303 agreed to in Senate by Unanimous Consent.          \n      \n\n    \n\n S.Res. 875 (Sen. Kaine):\n                A resolution designating September 21, 2024, through September 29, 2024, as \"Blue Star Welcome Week\".      \n\n        --        Senate Committee on the Judiciary discharged by Unanimous Consent.      \n\n        --        Resolution agreed to in Senate without amendment and with a preamble by        Unanimous Consent.      \n    \n\n S.Res. 896 (Sen. Padilla):\n                A resolution expressing support for the designation of the week beginning on November 11, 2024, as \"National SchoolPsychology Week\".      \n\n        --        Submitted in the Senate, considered, and agreed to without amendment and        with a preamble by Unanimous Consent.      \n    \n\n S.Res. 897 (Sen. Schatz):\n                A resolution recognizing National Native American Heritage Month and celebrating the heritages and cultures of Native Americans and the contributions of Native Americans to the United States.      \n\n        --        Submitted in the Senate, considered, and agreed to without amendment and        with a preamble by Unanimous Consent.      \n    \n\n S.Res. 898 (Sen. Blackburn):\n                A resolution recognizing the National Center for Missing & Exploited Children on its 40th anniversary.      \n\n        --        Submitted in the Senate, considered, and agreed to without amendment and        with a preamble by Unanimous Consent.      \n    \n\n S.Res. 899 (Sen. Shaheen):\n                A resolution designating November 2024 as \"American Diabetes Month\".      \n\n        --        Submitted in the Senate, considered, and agreed to without amendment and        with a preamble by Unanimous Consent.      \n    \n\n S.Res. 900 (Sen. Schumer):\n                A resolution to authorize testimony and representation in United States v. Baez.      \n\n        --        Submitted in the Senate, considered, and agreed to without amendment and        with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, November 19)","actionItem":"PN1244:\n                Mustafa Taher Kasubhai, of Oregon, to be United States District Judge for the District of Oregon      \n\n        --        Considered by Senate.      \n\n        --        Cloture invoked in Senate by Yea-Nay Vote. 51 - 43. Record Vote Number:        284      \n\n\n        --        Confirmed by the Senate by Yea-Nay Vote. 51 - 44. Record Vote Number:        285      \n\n    \n\n PN1253:\n                Sarah French Russell, of Connecticut, to be UnitedStates District Judge for the District of Connecticut      \n\n        --        By unanimous consent agreement, mandatory quorum required under Rule XXII        waived.      \n\n        --        Cloture invoked in Senate by Yea-Nay Vote. 50 - 45. Record Vote Number:        286      \n\n\n        --        Considered by Senate.      \n\n        --        Confirmed by the Senate by Yea-Nay Vote. 50 - 44. Record Vote Number:        287      \n\n    \n\n PN1573:\n                Rebecca L. Pennell, of Washington, to be United States District Judge for the Eastern District of Washington      \n\n        --        By unanimous consent agreement, mandatory quorum required under Rule XXII        waived.      \n\n        --        Cloture invoked in Senate by Yea-Nay Vote. 50 - 42. Record Vote Number:        288      \n\n\n        --        Considered by Senate.      \n\n        --        By unanimous consent agreement, debate 11/20/2024.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at      7:40 p.m., the Senate adjourned, under its order of today, until      10 a.m. tomorrow.","actionTimeStamp":"--"}]}