{"retrieved-date":"2023-4-10","actions-date":"Thu, 06 Apr 2023 11:03:01 -0400","actions-title":"House Floor Proceedings","actions-count":8,"actions-list":[{"index":1,"header":"--","actionItem":"The Speaker announced that the House do now adjourn pursuant to section 3(z) of H. Res. 5. The next meeting is scheduled for 2:00 p.m. on April 10, 2023.","actionTimeStamp":"Thu, 06 Apr 2023 11:03:01 -0400"},{"index":2,"header":"--","actionItem":"The House received a communication from Honorable Sheila Jackson Lee, Member of Congress. Pursuant to Rule VIII of the Rules of the House of Representatives, Ms. Jackson Lee notified that House that she had been served with a third-party subpoena for documents issued by the United States District Court for the Southern District of Georgia and that after consulation with the Office of General Counsel, she had determined that compliance with the subpoena is consistent with the privileges and rights of the House.","actionTimeStamp":"Thu, 06 Apr 2023 11:02:44 -0400"},{"index":3,"header":"--","actionItem":"The House received a message from the Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Representatives, the Clerk notified the House that she had received the following message from the Secretary of the Senate on April 5, 2023, at 12:00 p.m., That the Senate passed S. 659.","actionTimeStamp":"Thu, 06 Apr 2023 11:02:24 -0400"},{"index":4,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair led the House in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 06 Apr 2023 11:01:48 -0400"},{"index":5,"header":"SPEAKER'S APPROVAL OF THE JOURNAL","actionItem":"Pursuant to section 3(z) of H. Res. 5, the Journal of the last day's proceedings was approved.","actionTimeStamp":"Thu, 06 Apr 2023 11:01:27 -0400"},{"index":6,"header":"--","actionItem":"Today's prayer was offered by Rev. John Kellogg, Christ Church, Washington Parish, Washington, DC.","actionTimeStamp":"Thu, 06 Apr 2023 11:00:35 -0400"},{"index":7,"header":"--","actionItem":"The Speaker designated the Honorable Andy Harris to act as Speaker pro tempore for today.","actionTimeStamp":"Thu, 06 Apr 2023 11:00:19 -0400"},{"index":8,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 06 Apr 2023 11:00:00 -0400"}]}