{"retrieved-date":"2024-1-11","actions-date":"Tuesday, January 9, 2024","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Executive Business (Tuesday, January  9)","actionItem":"PN119:\n        Joseph Goffman, of Pennsylvania, to be an Assistant Administrator of the Environmental Protection Agency\n\n        -- Cloture motion withdrawn by unanimous consent in Senate.\n\n\n PN157:\n        Jose Javier Rodriguez, of Florida, to be an Assistant Secretary of Labor\n\n        -- By unanimous consent agreement, debate 1/9/2024.\n\n        -- Considered by Senate.\n\n        -- Second cloture motion withdrawn by unanimous consent in Senate.\n\n\n PN816:\n        Karoline Mehalchick, of Pennsylvania, to be United States District Judge for the Middle District of Pennsylvania\n\n        -- By unanimous consent agreement, debate 1/9/2024.\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate 1/10/2024.\n\n\n PN837:\n        Erika L. McEntarfer, of the District of Columbia, to be Commissioner of Labor Statistics, Department of Labor, for a term of four years\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN1020:\n        John A. Kazen, of Texas, to be United States District Judge for the Southern District of Texas\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 83 - 14. Record Vote Number: 2","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  6:00 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}