{"retrieved-date":"2023-7-20","actions-date":"Wednesday, July 19, 2023","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, July 19)","actionItem":"S. 2226 (Sen. Reed):\n        An original bill to authorize appropriations for fiscal year 2024 for military activities of the Department of Defense, for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Unanimous Consent.\n\n        -- Measure laid before Senate by motion.\n \n\n S.Amdt. 222 (Sen. Paul):\n        To express the sense of Congress that Article 5 of the North Atlantic Treaty does not supersede the constitutional requirement that Congress declare war before the United States engages in war.\n\n        --Amendment SA 222 proposed by Senator Paul to Amendment SA 935.\n\n        --Amendment SA 222 under the order of 7/19/2023, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 16 - 83. Record Vote Number: \n\n\n S.Amdt. 300 (Sen. Murray):\n        To amend the Energy Employees Occupational Illness Compensation Program Act of 2000 to expand the ways beryllium sensitivity can be established for purposes of compensation under that Act and to extend the authorization of the Advisory Board on Toxic Substances and Worker Health of the Department of Labor.\n\n        --Amendment SA 300 proposed by Senator Murray to Amendment SA 935.\n\n        --Amendment SA 300 under the order of 7/19/2023, having achieved 60 votes in the affirmative, was agreed to in Senate by Yea-Nay Vote. 96 - 2. Record Vote Number: \n\n\n S.Amdt. 429 (Sen. Kaine):\n        To require the advice and consent of the Senate or an Act of Congress to suspend, terminate, or withdraw the United States from the North Atlantic Treaty and authorizing related litigation, and for other purposes.\n\n        --Amendment SA 429 proposed by Senator Kaine to Amendment SA 935.\n\n        --Amendment SA 429 under the order of 7/19/2023, having achieved 60 votes in the affirmative, was agreed to in Senate by Yea-Nay Vote. 65 - 28. Record Vote Number: \n\n\n S.Amdt. 838 (Sen. Hawley):\n        To amend the Foreign Assistance Act of 1961 to clarify the meaning of the term \"aggregate value\" for purposes of the Presidential drawdown authority.\n\n        --Amendment SA 838 proposed by Senator Vance for Senator Hawley to Amendment SA 935.\n\n        --Amendment SA 838 under the order of 7/19/2023, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 39 - 60. Record Vote Number: \n\n\n S.Amdt. 935 (Sen. Reed):\n        In the nature of a substitute.\n\n        --Amendment SA 935 proposed by Senator Schumer.\n\n\n S.Amdt. 936 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 936 proposed by Senator Schumer to Amendment SA 935.\n\n\n\n\n S.Res. 303 (Sen. Murkowski):\n        A resolution congratulating the University of Alaska Fairbanks rifle team for winning the 2023 National Collegiate Athletic Association championship, the program's 11th title overall.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 304 (Sen. Lankford):\n        A resolution congratulating the University of Oklahoma softball team for winning the 2023 Women's College World Series, the seventh national title in program history.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Hickenlooper, at  7:57 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}