{"retrieved-date":"2025-9-30","actions-date":"Monday, September 29, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Thursday, September 25, 2025,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Thursday, September 25, 2025, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, September 29)","actionItem":"H.R. 5371 (Rep. Cole):\n        A bill making continuing appropriations and extensions for fiscal year 2026, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.\n\n\n S. 1333 (Sen. Cornyn):\n        A bill to amend title 18, United States Code, to modify provisions relating to kidnapping, sexual abuse, and illicit sexual conduct with respect to minors.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 2144 (Sen. Klobuchar):\n        A bill to improve the safety and security of Members of Congress, immediate family members of Members of Congress, and congressional staff.\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3916 (Sen. Klobuchar):\n        In the nature of a substitute.\n\n        --Amendment SA 3916 proposed by Senator Thune for Senator Klobuchar.\n\n        --Amendment SA 3916 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 2296 (Sen. Wicker):\n        An original bill to authorize appropriations for fiscal year 2026 for military activities of the Department of Defense, for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\n\n        -- Considered by Senate.\n \n\n S.Amdt. 3427 (Sen. Ernst):\n        To require the Comptroller General of the United States to conduct a study on casualty assistance and long-term care programs.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3748 (Sen. Wicker):\n        In the nature of a substitute.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3863 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3864 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3865 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3866 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3867 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3868 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n\n\n\n S. 2806 (Sen. Johnson):\n        A bill to provide for automatic continuing appropriations.\n\n        -- Cloture on the motion to proceed to the measure not invoked in Senate by Yea-Nay Vote. 37 - 61. Record Vote Number: 533 \n\n\n        -- Motion by Senator Thune to reconsider the motion to proceed the vote by which cloture on the motion to proceed to S. 2806 was not invoked (Record Vote No. 533) made in Senate.\n\n\n S. 2882 (Sen. Murray):\n        A bill making continuing appropriations for the fiscal year ending September 30, 2026, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.\n\n        -- Motion to proceed to consideration of measure withdrawn in Senate.\n\n\n S.Res. 412 (Sen. Thune):\n        An executive resolution authorizing the en bloc consideration in Executive Session of certain nominations on the Executive Calendar.\n\n        -- Motion to proceed to executive session to consideration of measure agreed to in Senate by Voice Vote.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the measure presented in Senate.\n\n\n S.Res. 418 (Sen. Whitehouse):\n        A resolution expressing support for the designation of the week of September 20 through September 27, 2025, as \"National Estuaries Week\".\n\n        -- Senate Committee on Environment and Public Works discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 420 (Sen. Hassan):\n        A resolution supporting the designation of September 19, 2025, as \"National Concussion Awareness Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Monday, September 29)","actionItem":"PN26-10:\n        Hung Cao, of Virginia, to be Under Secretary of the Navy\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN342:\n        Michael G. Waltz, of Florida, to be Representative of the United States of America to the Sessions of the General Assembly of the United Nations during his tenure of service as Representative of the United States of America to the United Nations\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 54 - 45. Record Vote Number: 531 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 54 - 45. Record Vote Number: 532","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  9:38 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}