{"retrieved-date":"2024-12-17","actions-date":"Thursday, December 12, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, December 12)","actionItem":"H.R. 82 (Rep. Graves):\n        A bill to amend title II of the Social Security Act to repeal the Government pension offset and windfall elimination provisions.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.\n\n\n H.R. 5009 (Rep. Joyce):\n        A bill to reauthorize wildlife habitat and conservation programs, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Motion by Senator Schumer to concur in the House amendment to the Senate amendment to H.R. 5009 made in Senate.\n\n        -- Cloture motion on the motion to concur in the House amendment to the Senate amendment to H.R. 5009 presented in Senate.\n\n        -- Motion by Senator Schumer to concur in the House amendment to the Senate amendment to H.R. 5009 with an amendment (SA 3317) made in Senate.\n\n        -- Motion by Senator Schumer to refer to Senate Committee on Armed Services the House message to accompany H.R. 5009 with instructions to report back forthwith with the following amendment (SA 3319) made in Senate.\n \n\n S.Amdt. 3317 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 3317 proposed by Senator Schumer.\n\n\n S.Amdt. 3318 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 3318 proposed by Senator Schumer to Amendment SA 3317.\n\n\n S.Amdt. 3319 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 3319 proposed by Senator Schumer.\n\n\n S.Amdt. 3320 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 3320 proposed by Senator Schumer to Amendment SA 3319 (the instructions of the motion to refer).\n\n\n S.Amdt. 3321 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 3321 proposed by Senator Schumer to Amendment SA 3320.\n\n\n\n\n H.R. 8663 (Rep. LaLota):\n        An act to require the Science and Technology Directorate in the Department of Homeland Security to develop greater capacity to detect and identify illicit substances in very low concentrations.\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment and an amendment to the Title by Unanimous Consent.\n \n\n S.Amdt. 3329 (Sen. Cornyn):\n        In the nature of a substitute.\n\n        --Amendment SA 3329 proposed by Senator Schumer for Senator Cornyn.\n\n        --Amendment SA 3329 agreed to in Senate by Unanimous Consent.\n\n\n S.Amdt. 3330 (Sen. Cornyn):\n        To amend the title.\n\n        --Amendment SA 3330 proposed by Senator Schumer for Senator Cornyn.\n\n        --Amendment SA 3330 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 59 (Sen. Sinema):\n        A bill to implement merit-based reforms to the civil service hiring system that replace degree-based hiring with skills- and competency-based hiring.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute withdrawn by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3325 (Sen. Sinema):\n        In the nature of a substitute.\n\n        --Amendment SA 3325 proposed by Senator Schumer for Senator Sinema.\n\n        --Amendment SA 3325 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 141 (Sen. Moran):\n        A bill to amend title 38, United States Code, to improve certain programs of the Department of Veterans Affairs for home and community based services for veterans, and for other purposes.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 920 (Sen. Menendez):\n        A bill to reauthorize the Trafficking Victims Protection Act of 2000, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Voice Vote.\n\n        -- Message on Senate action sent to the House.\n \n\n S.Amdt. 3322 (Sen. Cardin):\n        In the nature of a substitute.\n\n        --Amendment SA 3322 proposed by Senator Cardin.\n\n        --Amendment SA 3322 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 2513 (Sen. Tester):\n        A bill to amend title 38, United States Code, to improve benefits administered by the Secretary of Veterans Affairs, and for other purposes.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3326 (Sen. Moran):\n        In the nature of a substitute.\n\n        --Amendment SA 3326 proposed by Senator Schumer for Senator Moran.\n\n        --Amendment SA 3326 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 2783 (Sen. Rubio):\n        A bill to amend the Miccosukee Reserved Area Act to authorize the expansion of the Miccosukee Reserved Area and to carry out activities to protect structures within the Osceola Camp from flooding, and for other purposes.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n S. 2908 (Sen. Heinrich):\n        A bill to assist Tribal governments in the management of buffalo and buffalo habitat and the reestablishment of buffalo on Indian land.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee amendments withdrawn by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Voice Vote.\n \n\n S.Amdt. 3324 (Sen. Heinrich):\n        In the nature of a substitute.\n\n        --Amendment SA 3324 proposed by Senator Schatz for Senator Heinrich.\n\n        --Amendment SA 3324 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 3857 (Sen. Padilla):\n        A bill to take certain land in the State of California into trust for the benefit of the Jamul Indian Village of California, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute withdrawn by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Voice Vote.\n\n        -- Message on Senate action sent to the House.\n \n\n S.Amdt. 3323 (Sen. Padilla):\n        In the nature of a substitute.\n\n        --Amendment SA 3323 proposed by Senator Padilla.\n\n        --Amendment SA 3323 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 4000 (Sen. Padilla):\n        A bill to reaffirm the applicability of the Indian Reorganization Act to the Lytton Rancheria of California, and for other purposes.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n        -- Message on Senate action sent to the House.\n\n\n S. 4365 (Sen. Murkowski):\n        A bill to provide public health veterinary services to Indian Tribes and Tribal organizations for rabies prevention, and for other purposes.\n\n        -- Passed Senate with amendments by Voice Vote.\n\n\n S. 4367 (Sen. Carper):\n        A bill to provide for improvements to the rivers and harbors of the United States, to provide for the conservation and development of water and related resources, and for other purposes.\n\n        -- Message on House action received in Senate and at desk: House amendment to Senate bill.\n\n\n S. 4370 (Sen. Murkowski):\n        A bill to amend the Tribal Forest Protection Act of 2004 to improve that Act, and for other purposes.\n\n        -- Passed Senate with an amendment by Voice Vote.\n\n\n S. 5046 (Sen. Booker):\n        A bill to require the Secretary of Health and Human Services, acting through the Commissioner of Food and Drugs, to publish a final rule relating to nonclinical testing methods.\n\n        -- Senate Committee on Health, Education, Labor, and Pensions discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3328 (Sen. Booker):\n        In the nature of a substitute.\n\n        --Amendment SA 3328 proposed by Senator Schumer for Senator Booker.\n\n        --Amendment SA 3328 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 733 (Sen. Hyde-Smith):\n        A resolution honoring the life and legacy of Patrick Gottsch.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Voice Vote.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, December 12)","actionItem":"PN1980:\n        Matthew James Marzano, of Illinois, to be a Member of the Nuclear Regulatory Commission for the term of five years expiring June 30, 2028\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 46. Record Vote Number: 322 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 45. Record Vote Number: 323","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  5:22 p.m., the Senate adjourned, under its order of today, until  3 p.m. on Monday, December 16, 2024.","actionTimeStamp":"--"}]}