{"retrieved-date":"2024-12-9","actions-date":"Thursday, December 5, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, December  5)","actionItem":"S. 1868 (Sen. Peters):\n        A bill to require an interagency study to produce a security assessment process on adjacent space to high-security leased space to accommodate a Federal agency, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 3606 (Sen. Padilla):\n        A bill to reauthorize the Earthquake Hazards Reduction Act of 1977, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 4212 (Sen. Blackburn):\n        A bill to amend the Visit America Act to promote music tourism, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute as amended agreed to by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3313 (Sen. Blackburn):\n        To provide a technical correction.\n\n        --Amendment SA 3313 proposed by Senator Van Hollen for Senator Blackburn.\n\n        --Amendment SA 3313 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 74 (Sen. Wyden):\n        A resolution condemning the Government of Iran's state-sponsored persecution of the Baha'i minority and its continued violation of the International Covenants on Human Rights.\n\n        -- Senate Committee on Foreign Relations discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Resolution agreed to in Senate without amendment and an amended preamble by Voice Vote.\n\n\n S.Res. 908 (Sen. Young):\n        A resolution expressing support for the goals of Stomach Cancer Awareness Month.\n\n        -- Senate Committee on Health, Education, Labor, and Pensions discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, December  5)","actionItem":"PN2016:\n        Tiffany Rene Johnson, of Georgia, to be United States District Judge for the Northern District of Georgia\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 45. Record Vote Number: 315 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate and vote 12/9/2024.\n\n\n PN2017:\n        Keli Marie Neary, of Pennsylvania, to be United States District Judge for the Middle District of Pennsylvania\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 48 - 45. Record Vote Number: 316 \n\n\n\n PN2040:\n        Sarah Morgan Davenport, of New Mexico, to be United States District Judge for the District of New Mexico\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 45. Record Vote Number: 314","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Van Hollen, at  4:37 p.m., the Senate adjourned, under its order of today, until  3 p.m. on Monday, December 9, 2024.","actionTimeStamp":"--"}]}