{"retrieved-date":"2024-1-24","actions-date":"Tuesday, January 23, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, January 23)","actionItem":"S. 3646 (Sen. Moran):\n        A bill to amend the Housing Act of 1949 to extend the term of rural housing site loans and clarify the permissible uses of such loans.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.\n\n\n S.Res. 528 (Sen. Klobuchar):\n        A resolution raising awareness and encouraging the prevention of stalking by designating January 2024 as \"National Stalking Awareness Month\".\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Con.Res. 26 (Sen. Young):\n        A concurrent resolution recognizing and supporting the efforts of the New Heights Bid Committee to bring the 2027 Federation Internationale de Football Association (FIFA) Women's World Cup competition to the United States and Mexico.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, January 23)","actionItem":"PN13:\n        Joel Matthew Szabat, of Maryland, to be a Director of the Amtrak Board of Directors for a term of five years\n\n        -- Cloture motion withdrawn by unanimous consent in Senate.\n\n        -- By unanimous consent agreement, vote 1/23/2024.\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 96 - 1. Record Vote Number: 17 \n\n\n\n PN14:\n        Anthony Rosario Coscia, of New Jersey, to be a Director of the Amtrak Board of Directors for a term of five years\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 79 - 19. Record Vote Number: 15 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 79 - 18. Record Vote Number: 16 \n\n\n\n PN15:\n        Christopher Koos, of Illinois, to be a Director of the Amtrak Board of Directors for a term of five years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 91 - 7. Record Vote Number: 14 \n\n\n\n PN1246:\n        Joshua Paul Kolar, of Indiana, to be United States Circuit Judge for the Seventh Circuit\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII.\n\n\n PN1255:\n        Kirk Edward Sherriff, of California, to be United States District Judge for the Eastern District of California\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  6:15 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}