{"retrieved-date":"2023-2-24","actions-date":"Thursday, February 16, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, February 16)","actionItem":"S.Res. 71 (Sen. Moran):\n        A resolution congratulating the Kansas City Chiefs on their victory in Super Bowl LVII.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 77 (Sen. Sullivan):\n        A resolution designating February 16, 2023, as \"National Elizabeth Peratrovich Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 78 (Sen. Klobuchar):\n        A resolution authorizing the Sergeant at Arms and Doorkeeper of the Senate to conduct quarterly blood donation drives.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, February 16)","actionItem":"PN3:\n        Lester Martinez-Lopez, of Florida, to be an Assistant Secretary of Defense\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 61 - 34. Record Vote Number: 23 \n\n\n\n PN73:\n        Daniel J. Calabretta, of California, to be United States District Judge for the Eastern District of California\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 45. Record Vote Number: 22 \n\n\n\n PN75:\n        Jamal N. Whitehead, of Washington, to be United States District Judge for the Western District of Washington\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN76:\n        Araceli Martinez-Olguin, of California, to be United States District Judge for the Northern District of California\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN77:\n        Margaret R. Guzman, of Massachusetts, to be United States District Judge for the District of Massachusetts\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN78:\n        Jamar K. Walker, of Virginia, to be United States District Judge for the Eastern District of Virginia\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- By unanimous consent agreement, debate 2/27/2023.\n\n\n PN91:\n        Maria Araujo Kahn, of Connecticut, to be United States Circuit Judge for the Second Circuit\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 44. Record Vote Number: 24 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, vote to be determined.\n\n\n PN101:\n        William T. Johnson, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN102:\n        Eric J. Kunkle, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN103:\n        William E. McCarville, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN104:\n        Leslie A. McCampbell, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN105:\n        Hardy P. Merrill, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN184:\n        Jill E. Steinberg, of Georgia, to be United States Attorney for the Southern District of Georgia for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN213:\n        Natalie D. Richardson, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN214:\n        Jonathan M. Bise, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN215:\n        Nathan K. Aiken, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN216:\n        Jovon A. Williams, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN217:\n        Bryan W. Sixkiller, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN218:\n        Lacresha A. Merkle, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN220:\n        Justin T. Schneider, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN221:\n        D011285, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN222:\n        2 nominations in the Army beginning with Lajohnne A. Morris and ending with Jennifer A. Parker\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN223:\n        Yulang Tsou, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN224:\n        Blaire R. Griffin, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN225:\n        Timothy J. Maki, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN226:\n        Russell W. Vanderlugt, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN227:\n        Brian J. Slotnick, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN228:\n        Jessica L. Horne, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN229:\n        John R. Taylor, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN230:\n        Jason L. Norquist, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN231:\n        7 nominations in the Army beginning with Queschae B. Blue-Clark and ending with Vincent P. Wolff\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN232:\n        Michael B. Cohen, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN233:\n        Irene Garcia, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN234:\n        Yong J. Lee, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN235:\n        Mahealani N. McFarland, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN236:\n        Clayton A. Sutton, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN237:\n        58 nominations in the Army beginning with Kevin M. Adams and ending with D016440\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN239:\n        2 nominations in the Army beginning with Christopher M. Kientz and ending with Victor A. Mercado\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN240:\n        26 nominations in the Army beginning with Adam D. Akers and ending with Stacey N. Wuchter\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN241:\n        10 nominations in the Army beginning with Jesse R. Chapin and ending with John R. Williams\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN242:\n        Brendan T. McShea, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN243:\n        Matthew R. Burmeister, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN244:\n        Jessica K. Smyth, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN245:\n        2 nominations in the Army beginning with Megan L. Jimenez and ending with Steve B. Louvet\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN246:\n        Brendon M. Esquibel, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN248:\n        7 nominations in the Marine Corps beginning with Robert J. Bell, Jr. and ending with Trevor C. Thibodeau\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN250:\n        John C. Jarvis, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN251:\n        2 nominations in the Marine Corps beginning with Andres J. Agramonte and ending with Timothy G. Otto\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN252:\n        2 nominations in the Marine Corps beginning with Robert A. Lien and ending with Timothy E. Sapp\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN253:\n        3 nominations in the Marine Corps beginning with Kevin F. Champaigne and ending with Edwin E. Rodriguez\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN254:\n        Duane A. Gumbs, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN255:\n        2 nominations in the Marine Corps beginning with Richard P. Charest and ending with Keith C. Datiz\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN256:\n        Aaron S. Ellis, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN258:\n        4 nominations in the Marine Corps beginning with Michael P. Ruegger and ending with Todd J. White\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN259:\n        645 nominations in the Marine Corps beginning with Patrick J. Abbott and ending with Joseph C. Zwierzynski\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN260:\n        5 nominations in the Marine Corps beginning with Adalberto Castro II and ending with Justin W. Rehm\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN261:\n        4 nominations in the Marine Corps beginning with Vincent S. Ginestra and ending with John M. Rydman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN262:\n        5 nominations in the Marine Corps beginning with Jonathan J. Butler and ending with Joshua O. Stewart\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN263:\n        3 nominations in the Marine Corps beginning with Dustin A. Hamm and ending with Lucas A. Tuning II\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN264:\n        2 nominations in the Marine Corps beginning with Scott M. Carter and ending with James P. Otto\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN265:\n        3 nominations in the Marine Corps beginning with Branden D. Palmer and ending with Bryant Wall\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN266:\n        7 nominations in the Marine Corps beginning with Joshua Adornorivera and ending with Matthew J. Williams\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN267:\n        Jeffrey Tang, in the Marine Corps, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN268:\n        Robert W. Kreuger III, in the Marine Corps, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN269:\n        3 nominations in the Marine Corps beginning with David K. Coker and ending with Jessy W. Phillips\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN270:\n        6 nominations in the Marine Corps beginning with James D. Ballard, Jr. and ending with Craig A. Rooth\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN271:\n        6 nominations in the Marine Corps beginning with Fadi S. Abdelhalim and ending with Joseph A. Ortiz\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN272:\n        2 nominations in the Marine Corps beginning with Bradley C. Kirby and ending with Bryan D. Stinger\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN273:\n        William D. Hawkins, in the Marine Corps, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN274:\n        309 nominations in the Marine Corps beginning with Joussef J. Abchidonado and ending with Adam T. Young\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN275:\n        2 nominations in the Navy beginning with Michael Holifield and ending with Stuart Kirkby\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN276:\n        Martin L. Leonard, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN277:\n        James E. Hammond, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN278:\n        Mario J. Cardoso, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN279:\n        Brett W. Sadowski, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN280:\n        Leland H. Sebring III, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN281:\n        Beau D. Hufstetler, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN282:\n        Kimberly Francis, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN295:\n        Jeffrey S. Clark, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN296:\n        Alicia K. Premo, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN297:\n        143 nominations in the Air Force beginning with David A. Alt and ending with Richard M. Wood\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN298:\n        365 nominations in the Air Force beginning with Brant Adams and ending with Jessica E. Zhen\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN299:\n        36 nominations in the Air Force beginning with Phillip C. Barras and ending with Marita N. Zguri\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN300:\n        60 nominations in the Air Force beginning with Khashayar Azimi and ending with Yangdi Zhou\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN301:\n        Apoorv Vohra, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN302:\n        2 nominations in the Army beginning with Christopher W. Swiecki and ending with Joel C. Webb\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN303:\n        Wisdom K. Henyo, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  4:49 p.m, the Presiding Officer (Mr. Cardin in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}