{"retrieved-date":"2023-1-5","actions-date":"Thu, 05 Jan 2023 13:41:06 -0500","actions-title":"House Floor Proceedings","actions-count":8,"actions-list":[{"index":1,"header":"ANNOUCEMENT OF RESULT OF ROLL CALL 9","actionItem":"The Clerk announced that no persons having received a majority of the whole number of votes cast by surname in the Election of the Speaker, a Speaker was not elected.","actionTimeStamp":"Thu, 05 Jan 2023 13:41:06 -0500"},{"index":2,"header":"NOMINATIONS FOR OFFICE OF SPEAKER","actionItem":"Pursuant to law and precedent, the Clerk directed the Reading Clerk to call the roll for the Election of the Speaker. Accordingly, the Honorable John James of Michigan placed the name of the Honorable Kevin McCarthy into nomination for the Office of Speaker, the Honorable Pete Aguilar of California placed the name of the Honorable Hakeem S. Jeffries into nomination for the Office of Speaker, and the Honorable Dan Bishop of North Carolina placed the name of the Honorable Byron Donalds into nomination for the Office of Speaker. No other nominations were put forward.","actionTimeStamp":"Thu, 05 Jan 2023 12:12:18 -0500"},{"index":3,"header":"HOUSE DECORUM","actionItem":"The Clerk addressed the House to clarify that as part of the Clerk's role during the organization of the House, the Clerk has the responsibility to preserve order and decorum in the chamber prior to the election of a Speaker. To that end, the Clerk stated that Members-elect should address any remarks through the chair and not to other Members-elect in the second person, and that Members-elect should refrain from engaging in personalities toward other Members-elect.","actionTimeStamp":"Thu, 05 Jan 2023 12:10:46 -0500"},{"index":4,"header":"POINT OF NO QUORUM","actionItem":"Ms. Stefanik made a point of order that a quorum was not present. Accordingly, Members-elect were counted and the Clerk announced that 311 Members-elect being counted, a quorum was present.","actionTimeStamp":"Thu, 05 Jan 2023 12:04:51 -0500"},{"index":5,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Clerk led the House in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 05 Jan 2023 12:03:41 -0500"},{"index":6,"header":"--","actionItem":"The Clerk announced approval of the Journal.","actionTimeStamp":"Thu, 05 Jan 2023 12:03:23 -0500"},{"index":7,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Thu, 05 Jan 2023 12:01:34 -0500"},{"index":8,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 05 Jan 2023 12:00:00 -0500"}]}