{"retrieved-date":"2022-12-16","actions-date":"Thursday, December 15, 2022","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, December 15)","actionItem":"H.R. 681 (Rep. Young):\n        A bill for the relief of Rebecca Trimble.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 1437 (Rep. Sherrill):\n        A bill to amend the Weather Research and Forecasting Innovation Act of 2017 to direct the National Oceanic and Atmospheric Administration to provide comprehensive and regularly updated Federal precipitation information, and for other purposes.\n\n        -- Message on House action received in Senate and at desk: House amendment to Senate amendment.\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 75 - 20. Record Vote Number: 393 \n\n\n        -- Measure laid before Senate by motion.\n\n        -- Motion by Senator Schumer to concur in the House amendment to the Senate amendment to H.R. 1437 made in Senate.\n\n        -- Motion by Senator Schumer to concur in the House amendment to the Senate amendment to H.R. 1437 with an amendment (SA 6534) made in Senate.\n\n        -- Motion by Senator Schumer to refer to Senate Committee on Appropriations the House message to accompany H.R. 1437 with instructions to report back forthwith with the following amendment (SA 6536) made in Senate.\n\n        -- Motion by Senator Lee to concur in the House amendment to the Senate amendment to H.R. 1437 with an amendment (SA 6541 as modified) made in Senate.\n\n        -- Motion by Senator Scott of Florida to concur in the House amendment to the Senate amendment to H.R. 1437 with an amendment (SA 6540) made in Senate.\n\n        -- Motion by Senator Scott of Florida to concur in the House amendment to the Senate amendment to H.R. 1437 with an amendment (SA 6540) under the order of 12/15/22, not having achieved 60 votes in the affirmative, was not agreed to by Yea-Nay Vote. 45 - 47. Record Vote Number: 397 \n\n\n        -- Motion by Senator Lee to concur in the House amendment to the Senate amendment to H.R. 1437 with an amendment (SA 6541 as modified) was not agreed to by Yea-Nay Vote. 35 - 56. Record Vote Number: 398 \n\n\n        -- Motion by Senator Schumer to refer to Senate Committee on Appropriations the House message to accompany H.R. 1437 with instructions to report back forthwith with the following amendment (SA 6536) withdrawn in Senate by Unanimous Consent.\n\n        -- Motion by Senator Schumer to concur in the House amendment to the Senate amendment to H.R. 1437 with an amendment (SA 6534) withdrawn in Senate by Unanimous Consent.\n\n        -- Senate agreed, under the order of 12/15/22, having achieved 60 votes in the affirmative, to the House amendment to the Senate amendment to H.R. 1437 by Yea-Nay Vote. 71 - 19. Record Vote Number: 399 \n\n \n\n S.Amdt. 6534 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 6534 proposed by Senator Schumer.\n\n        --Proposed amendment SA 6534 withdrawn in Senate.\n\n\n S.Amdt. 6535 (Sen. Schumer):\n        To modify the effective date.\n\n        --Amendment SA 6535 proposed by Senator Schumer to Amendment SA 6534.\n\n        --SA 6535 fell when SA 6534 withdrawn.\n\n\n S.Amdt. 6536 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 6536 proposed by Senator Schumer.\n\n        --Proposed amendment SA 6536 withdrawn in Senate.\n\n\n S.Amdt. 6537 (Sen. Schumer):\n        To modify the effective date.\n\n        --Amendment SA 6537 proposed by Senator Schumer to Amendment SA 6536 (the instructions of the motion to refer).\n\n        --SA 6537 fell when SA 6536 withdrawn.\n\n\n S.Amdt. 6538 (Sen. Schumer):\n        To modify the effective date.\n\n        --Amendment SA 6538 proposed by Senator Schumer to Amendment SA 6537.\n\n        --SA 6538 fell when SA 6537 fell.\n\n\n S.Amdt. 6540 (Sen. Scott, of FL):\n        To rescind certain funding provided to the Internal Revenue Service under section 10301 of Public Law 117-169 and to protect American small businesses, gig workers, and freelancers by repealing the burdensome American Rescue Plan Act of 2021 transactions reporting threshold.\n\n        --Amendment SA 6540 proposed by Senator Scott FL.\n\n        --Amendment SA 6540, under the order of 12/15/22, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 45 - 47. Record Vote Number: \n\n\n S.Amdt. 6541 (Sen. Lee):\n        In the nature of a substitute.\n\n        --Amendment SA 6541 proposed by Senator Lee.\n\n        --Amendment SA 6541, as modified, not agreed to in Senate by Yea-Nay Vote. 35 - 56. Record Vote Number: \n\n\n\n\n H.R. 2617 (Rep. Connolly):\n        A bill to amend section 1115 of title 31, United States Code, to amend the description of how performance goals are achieved , and for other purposes.\n\n        -- Message on House action received in Senate and at desk: House amendment to Senate amendment 4.\n\n\n H.R. 2724 (Rep. Delgado):\n        A bill to amend title 38, United States Code, to direct the Secretary of Veterans Affairs to provide for peer support specialists for claimants who are survivors of military sexual trauma, and for other purposes.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 4250 (Rep. Foxx):\n        A bill to amend the State Department Basic Authorities Act of 1956 to provide for rewards for the arrest or conviction of certain foreign nationals who have committed genocide or war crimes, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7181 (Rep. Jeffries):\n        A bill to amend the Trafficking Victims Protection Act of 2000 to direct the Secretary of Transportation to seek to provide for the posting of contact information of the national human trafficking hotline in the restrooms of each aircraft, airport, over-the-road bus, bus station, passenger train, and passenger railroad station operating within the United States, and for other purposes.\n\n        -- Senate Committee on Health, Education, Labor, and Pensions discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7776 (Rep. DeFazio):\n        A bill to provide for improvements to the rivers and harbors of the United States, to provide for the conservation and development of water and related resources, and for other purposes.\n\n        -- Considered by Senate (Message from the House considered).\n\n        -- Motion by Senator Sullivan to concur in the House amendment to the Senate amendment to H.R. 7776 with an amendment (SA 6522) made in Senate.\n\n        -- Motion by Senator Sullivan to concur in the House amendment to the Senate amendment to H.R. 7776 with an amendment (SA 6522) withdrawn by Unanimous Consent.\n\n        -- Motion by Senator Schumer to refer to Senate Committee on Armed Services the House message to accompany H.R. 7776 with instructions to report back forthwith with the following amendment (SA 6516) withdrawn in Senate by Unanimous Consent.\n\n        -- Cloture on the motion by Senator Schumer to concur in the House Amendment to H.R. 7776 with an amendment (SA 6513), cloture not invoked in Senate by Yea-Nay Vote. 47 - 47. Record Vote Number: 394 \n\n\n        -- Schumer motion to concur in the House amendment to the Senate amendment to H.R. 7776 with an amendment SA 6513 withdrawn by Unanimous Consent.\n\n        -- Motion by Senator Johnson to concur in the House amendment to the Senate amendment to H.R. 7776 with an amendment (SA 6526) made in Senate.\n\n        -- Motion by Senator Johnson to concur in the House amendment to the Senate amendment to H.R. 7776 with an amendment (SA 6526) under the order of 12/15/22, not having achieved 60 votes in the affirmative, was not agreed to by Yea-Nay Vote. 40 - 54. Record Vote Number: 395 \n\n\n        -- Senate agreed, under the order of 12/15/22, having achieved 60 votes in the affirmative, to the House amendment to the Senate amendment to H.R. 7776 by Yea-Nay Vote. 83 - 11. Record Vote Number: 396 \n\n \n\n S.Amdt. 6513 (Sen. Manchin):\n        To provide for American energy security by improving the permitting process.\n\n        --Considered by Senate (Message from the House considered).\n\n        --Proposed amendment SA 6513 withdrawn in Senate.\n\n\n S.Amdt. 6515 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate (Message from the House considered).\n\n        --SA 6515 fell when when the motion to concur in the House amendment to H.R. 7776 with an amendment SA 6513 was withdrawn.\n\n\n S.Amdt. 6516 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate (Message from the House considered).\n\n        --Proposed amendment SA 6516 withdrawn in Senate.\n\n\n S.Amdt. 6517 (Sen. Schumer):\n        To modify the effective date.\n\n        --Considered by Senate (Message from the House considered).\n\n        --SA 6517 fell when SA 6516 was withdrawn.\n\n\n S.Amdt. 6518 (Sen. Schumer):\n        To modify the effective date.\n\n        --Considered by Senate (Message from the House considered).\n\n        --SA 6518 fell when SA 6517 fell.\n\n\n S.Amdt. 6522 (Sen. Sullivan):\n        To amend the Camp Lejeune Justice Act of 2022 to appropriately limit attorney's fees.\n\n        --Amendment SA 6522 proposed by Senator Sullivan.\n\n        --Proposed amendment SA 6522 withdrawn in Senate.\n\n\n S.Amdt. 6526 (Sen. Johnson):\n        To provide remedies to members of the Armed Forces discharged or subject to punishment under the COVID-19 vaccine mandate.\n\n        --Amendment SA 6526 proposed by Senator Johnson.\n\n        --Amendment SA 6526, under the order of 12/15/22, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 40 - 54. Record Vote Number: \n\n\n\n\n H.Con.Res. 121 (Rep. Smith):\n        A concurrent resolution directing the Clerk of the House of Representatives to make a correction in the enrollment of the bill H.R. 7776.\n\n        -- Resolution agreed to in Senate without amendment by Unanimous Consent.\n\n\n H.Con.Res. 123 (Rep. DeLauro):\n        A concurrent resolution providing for a correction in the enrollment of H.R. 1437.\n\n        -- Received in the Senate, considered, and agreed to without amendment by Unanimous Consent.\n\n\n S. 688 (Sen. Scott, of FL):\n        A bill to prohibit contracting with persons that have business operations with the Maduro regime, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Voice Vote.\n \n\n S.Amdt. 6543 (Sen. Scott, of FL):\n        In the nature of a substitute.\n\n        --Amendment SA 6543 proposed by Senator King for Senator Scott FL.\n\n        --Amendment SA 6543 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 2793 (Sen. Peters):\n        A bill to authorize the Administrator of General Services to establish an enhanced use lease pilot program, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 3957 (Sen. Casey):\n        A bill to amend the Infrastructure Investment and Jobs Act to make certain activities eligible for grants from the Abandoned Mine Reclamation Fund, and for other purposes.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Voice Vote.\n \n\n S.Amdt. 6542 (Sen. Barrasso):\n        In the nature of a substitute.\n\n        --Amendment SA 6542 proposed by Senator King for Senator Barrasso.\n\n        --Amendment SA 6542 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 5168 (Sen. Padilla):\n        A bill to amend the Immigration and Nationality Act to include aliens passing in transit through the United States to board a vessel on which the alien will perform ship-to-ship liquid cargo transfer operations within a class of nonimmigrant aliens, and for other purposes.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 865 (Sen. Sinema):\n        A resolution commending and congratulating the Northern Arizona University Lumberjacks men's cross country team for winning the 2022 National Collegiate Athletic Association Cross Country National Championship.\n\n        -- Senate Committee on Commerce, Science, and Transportation discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Con.Res. 16 (Sen. Van Hollen):\n        A concurrent resolution commemorating the 30th anniversary of Operation Provide Comfort.\n\n        -- Resolution agreed to in Senate with an amendment and an amended preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, December 15)","actionItem":"PN1352:\n        Kendra Davis Briggs, of the District of Columbia, to be an Associate Judge of the Superior Court of the District of Columbia for the term of fifteen years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1474:\n        Errol Rajesh Arthur, of the District of Columbia, to be an Associate Judge of the Superior Court of the District of Columbia for the term of fifteen years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1475:\n        Leslie A. Meek, of the District of Columbia, to be an Associate Judge of the Superior Court of the District of Columbia for the term of fifteen years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1476:\n        Carl Ezekiel Ross, of the District of Columbia, to be an Associate Judge of the Superior Court of the District of Columbia for the term of fifteen years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1657:\n        Musetta Tia Johnson, of Virginia, to be a Judge of the United States Court of Appeals for the Armed Forces for a term of fifteen years to expire on the date prescribed by law\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 76 - 20. Record Vote Number: 392 \n\n\n\n PN1784-3:\n        Col. David C. Epperson, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2222:\n        Kathleen Ann Kavalec, of California, to be Ambassador to Romania\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2251:\n        Jessica Davis Ba, of the District of Columbia, to be Ambassador to the Republic of Cote d'Ivoire\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2379:\n        Laura E. Crane, of the District of Columbia, to be an Associate Judge of the Superior Court of the District of Columbia for the term of fifteen years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2380:\n        Veronica M. Sanchez, of the District of Columbia, to be an Associate Judge of the Superior Court of the District of Columbia for the term of fifteen years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2385:\n        Vijay Shanker, of the District of Columbia, to be an Associate Judge of the District of Columbia Court of Appeals for the term of fifteen years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2425:\n        Sean P. Hutchison, in the Army, to be Major\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2431:\n        Col. Thomas P. Sherman, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2443:\n        Henry C. Leventis, of Tennessee, to be United States Attorney for the Middle District of Tennessee for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2462:\n        70 nominations in the Air Force beginning with Kimberly N. Barr and ending with Benjamin D. Youngquist\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2463:\n        61 nominations in the Air Force beginning with Nathan J. Abel and ending with Bai Lan Zhu\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2464:\n        91 nominations in the Air Force beginning with Billy S. Allen and ending with Joshua D. Wild\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2465:\n        302 nominations in the Air Force beginning with Allen Y. Agnes and ending with Jose L. Zambrano\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2466:\n        10 nominations in the Air Force beginning with Daniel A. Bunch and ending with Michael William Suden\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2467:\n        12 nominations in the Air Force beginning with Dear Beloved and ending with John T. Szczepanski\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2496:\n        Catrina A. Thompson, of North Carolina, to be United States Marshal for the Middle District of North Carolina for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2513:\n        Maj. Gen. Francis L. Donovan, in the Marine Corps, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2527:\n        Andrew K. Arrington, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2595:\n        60 nominations in the Air Force beginning with Karla E. Adams and ending with Jesse M. Wickham\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2597:\n        12 nominations in the Air Force beginning with Jacqueline E. Bvlgari and ending with Kelly L. Vermillion\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2645:\n        Keenan E. Dalrymple, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2646:\n        Susan D. Baumgartner, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2647:\n        Stigen A. Westberg, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2648:\n        Beau D. Graham, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2649:\n        Kristen M. Barra, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2650:\n        Evans R. Wright, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2656:\n        Ashton M. Shelton, in the Space Force, to be Major\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2703:\n        4 nominations in the Air Force beginning with Brig. Gen. Donald K. Carpenter and ending with Brig. Gen. Mark D. Piper\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2711:\n        Maj. Gen. Steven S. Nordhaus, in the Air Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2714:\n        Col. Paige M. Jennings, in the Army, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2727:\n        Capt. Jonathan T. Stephens, in the Navy, to be Rear Admiral (lower half)\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2732:\n        Michael D. Black, of Ohio, to be United States Marshal for the Southern District of Ohio for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2776:\n        Jeremy A. Krohngold, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2799:\n        8 nominations in the Marine Corps beginning with Brig. Gen. Marcus B. Annibale and ending with Brig. Gen. Calvert L. Worth, Jr.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2800:\n        Lt. Gen. Charles R. Hamilton, in the Army, to be General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2801:\n        Chandramouli Rajaram, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2802:\n        Christopher A. Kreiler, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2803:\n        3 nominations in the Army beginning with Michael A. Rizzotti and ending with Brett C. Shepard\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2804:\n        Ronald W. Sprang, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2805:\n        Ryan C. Agee, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2806:\n        Philip J. Deaguilera, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2807:\n        Brian C. Beldowicz, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2808:\n        Christopher A. Benson, in the Army, to be Major\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2809:\n        108 nominations in the Marine Corps beginning with David Ahn and ending with Jay M. Zarra\n\n        -- Confirmed by the Senate by Unanimous Consent.\n\n\n PN2810:\n        Tapeka C. Pringle, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Unanimous Consent.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. King, at 10:02 p.m., the Senate adjourned, under its order of today, until 3 p.m. on Monday, December 19, 2022.","actionTimeStamp":"--"}]}