{"retrieved-date":"2024-6-26","actions-date":"Wed, 26 Jun 2024 15:11:38 -0400","actions-title":"House Floor Proceedings","actions-count":110,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Tiffany amendment No. 59.","actionTimeStamp":"Wed, 26 Jun 2024 15:11:38 -0400"},{"index":2,"header":"--","actionItem":"An amendment, offered by Mr. Tiffany,  numbered 59 printed in Part C of House Report 118-559 to prohibit the use of funds to extend \"Temporary Protected Status\" to any national of Honduras, which was initially granted to Honduran nationals in 1999.","actionTimeStamp":"Wed, 26 Jun 2024 15:11:28 -0400"},{"index":3,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Tiffany amendment No. 58, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Underwood demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 26 Jun 2024 15:10:58 -0400"},{"index":4,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Tiffany amendment No. 58.","actionTimeStamp":"Wed, 26 Jun 2024 15:05:20 -0400"},{"index":5,"header":"--","actionItem":"An amendment, offered by Mr. Tiffany,  numbered 58 printed in Part C of House Report 118-559 to prohibit the use of funds to extend \"Temporary Protected Status\" to any national of El Salvador, which was initially granted to nationals of El Salvador in 2001.","actionTimeStamp":"Wed, 26 Jun 2024 15:05:07 -0400"},{"index":6,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Steube amendment No. 57, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Underwood demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 26 Jun 2024 15:04:38 -0400"},{"index":7,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Steube amendment No. 57.","actionTimeStamp":"Wed, 26 Jun 2024 15:01:19 -0400"},{"index":8,"header":"--","actionItem":"An amendment, offered by Mr. Steube,  numbered 57 printed in Part C of House Report 118-559 to prohibit any funds from being spent to compensate the Department of Veteran Affairs for processing medical claims on behalf of individuals detained by Immigration and Customs Enforcement.","actionTimeStamp":"Wed, 26 Jun 2024 15:00:56 -0400"},{"index":9,"header":"--","actionItem":"On agreeing to the Amodei amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 15:00:34 -0400"},{"index":10,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Amodei amendment No. 56.","actionTimeStamp":"Wed, 26 Jun 2024 14:56:41 -0400"},{"index":11,"header":"--","actionItem":"An amendment, offered by Mr. Amodei,  numbered 56 printed in Part C of House Report 118-559 to reduce the salary of Nejwa Ali, U.S. Citizenship and Immigration Services Adjudication Officer, to $1.","actionTimeStamp":"Wed, 26 Jun 2024 14:56:32 -0400"},{"index":12,"header":"--","actionItem":"On agreeing to the Roy amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 14:56:12 -0400"},{"index":13,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 55.","actionTimeStamp":"Wed, 26 Jun 2024 14:52:42 -0400"},{"index":14,"header":"--","actionItem":"An amendment, offered by Mr. Roy,  numbered 55 printed in Part C of House Report 118-559 to prohibit funds in this act to carry out Biden Executive Order 13990 (relating to Protecting Public Health and the Environment and Restoring Science To Tackle the Climate Crisis), Executive Order 14008 (relating to Tackling the Climate Crisis at Home and Abroad), Section 6 of Executive Order 14013 (relating to Rebuilding and Enhancing Programs To Resettle Refugees and Planning for the Impact of Climate Change on Migration), Executive Order 14030 (relating to Climate Related Financial Risk), and Executive Order 14057 (relating to Catalyzing Clean Energy Industries and Jobs Through Federal Sustainability).","actionTimeStamp":"Wed, 26 Jun 2024 14:52:08 -0400"},{"index":15,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Roy amendment No. 54, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Underwood demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 26 Jun 2024 14:50:35 -0400"},{"index":16,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 54.","actionTimeStamp":"Wed, 26 Jun 2024 14:44:22 -0400"},{"index":17,"header":"--","actionItem":"An amendment, offered by Mr. Roy,  numbered 54 printed in Part C of House Report 118-559 to prohibit funds appropriated or otherwise made available by this Act to be made available to carry out, enforce, or implement the process entitled, \"Process to Promote the Unity and Stability of Families\", announced by the Department of Homeland Security on June 18, 2024.","actionTimeStamp":"Wed, 26 Jun 2024 14:43:55 -0400"},{"index":18,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Rosendale amendment No. 53, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Underwood demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 26 Jun 2024 14:43:31 -0400"},{"index":19,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Rosendale amendment No. 53.","actionTimeStamp":"Wed, 26 Jun 2024 14:37:59 -0400"},{"index":20,"header":"--","actionItem":"An amendment, offered by Mr. Rosendale,  numbered 53 printed in Part C of House Report 118-559 to prohibit funding from the Act to be used to carry out the Department of Homeland Security's memorandum titled \"Worksite Enforcement: The Strategy to Protect the American Labor Market, the Conditions of the American Worksite, and the Dignity of the Individual\".","actionTimeStamp":"Wed, 26 Jun 2024 14:37:37 -0400"},{"index":21,"header":"--","actionItem":"On agreeing to the Roy amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 14:37:14 -0400"},{"index":22,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 50.","actionTimeStamp":"Wed, 26 Jun 2024 14:32:28 -0400"},{"index":23,"header":"--","actionItem":"An amendment, offered by Mr. Roy,  numbered 50 printed in Part C of House Report 118-559 to prohibit funds from being used to implement Remain-in-Texas policies.","actionTimeStamp":"Wed, 26 Jun 2024 14:32:16 -0400"},{"index":24,"header":"--","actionItem":"On agreeing to the Gottheimer amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 14:31:17 -0400"},{"index":25,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Gottheimer amendment No. 48.","actionTimeStamp":"Wed, 26 Jun 2024 14:26:42 -0400"},{"index":26,"header":"--","actionItem":"An amendment, offered by Mr. Gottheimer,  numbered 48 printed in Part C of House Report 118-559 to increase Nonprofit Security Grant Program by $30 million.","actionTimeStamp":"Wed, 26 Jun 2024 14:26:27 -0400"},{"index":27,"header":"--","actionItem":"On agreeing to the Ogles amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 14:26:00 -0400"},{"index":28,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 46.","actionTimeStamp":"Wed, 26 Jun 2024 14:21:43 -0400"},{"index":29,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 46 printed in Part C of House Report 118-559 to prohibit funds to develop or implement any Department of Homeland Security Environmental Justice Strategy.","actionTimeStamp":"Wed, 26 Jun 2024 14:20:59 -0400"},{"index":30,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Ogles amendment No. 45, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Underwood demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 26 Jun 2024 14:20:29 -0400"},{"index":31,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 45.","actionTimeStamp":"Wed, 26 Jun 2024 14:14:07 -0400"},{"index":32,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 45 printed in Part C of House Report 118-559 to prohibit funds to administer, implement, or enforce the Memorandum on the Deferred Enforced Departure for Certain Palestinians, issued by the President on February 14, 2024.","actionTimeStamp":"Wed, 26 Jun 2024 14:14:04 -0400"},{"index":33,"header":"--","actionItem":"On agreeing to the Ogles amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 14:13:53 -0400"},{"index":34,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 44.","actionTimeStamp":"Wed, 26 Jun 2024 14:11:36 -0400"},{"index":35,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 44 printed in Part C of House Report 118-559 to prohibit funds from use to impose a COVID-19 mask mandate.","actionTimeStamp":"Wed, 26 Jun 2024 14:11:02 -0400"},{"index":36,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Ogles amendment No. 43, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Underwood demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 26 Jun 2024 14:10:35 -0400"},{"index":37,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 43.","actionTimeStamp":"Wed, 26 Jun 2024 14:04:17 -0400"},{"index":38,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 43 printed in Part C of House Report 118-559 to prohibit funds from being used to implement, administer, or enforce Executive Order 14019, except sections 7, 8, and 10.","actionTimeStamp":"Wed, 26 Jun 2024 14:04:15 -0400"},{"index":39,"header":"--","actionItem":"On agreeing to the Ogles amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 14:04:04 -0400"},{"index":40,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 42.","actionTimeStamp":"Wed, 26 Jun 2024 13:58:46 -0400"},{"index":41,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 42 printed in Part C of House Report 118-559 to reduce funds for the Office of the Secretary by $10 million and transfers funds to the spending reduction account.","actionTimeStamp":"Wed, 26 Jun 2024 13:58:44 -0400"},{"index":42,"header":"--","actionItem":"On agreeing to the Norman amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 13:58:27 -0400"},{"index":43,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 39.","actionTimeStamp":"Wed, 26 Jun 2024 13:53:25 -0400"},{"index":44,"header":"--","actionItem":"An amendment, offered by Mr. Norman,  numbered 39 printed in Part C of House Report 118-559 to prohibit funding for TSA's Inclusion Action Plan.","actionTimeStamp":"Wed, 26 Jun 2024 13:53:23 -0400"},{"index":45,"header":"--","actionItem":"On agreeing to the Norman amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 13:53:09 -0400"},{"index":46,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 38.","actionTimeStamp":"Wed, 26 Jun 2024 13:48:17 -0400"},{"index":47,"header":"--","actionItem":"An amendment, offered by Mr. Norman,  numbered 38 printed in Part C of House Report 118-559 to prohibit funding for the purchase of electronic vehicles.","actionTimeStamp":"Wed, 26 Jun 2024 13:48:14 -0400"},{"index":48,"header":"--","actionItem":"On agreeing to the Mullin amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 13:44:04 -0400"},{"index":49,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Mullin amendment No. 37.","actionTimeStamp":"Wed, 26 Jun 2024 13:39:52 -0400"},{"index":50,"header":"--","actionItem":"An amendment, offered by Mr. Mullin,  numbered 37 printed in Part C of House Report 118-559 to decrease $18,168,000 from the Management Directorate operations and support and to increase $18,168,000 for FEMA operations and support for the National Urban Search and Rescue Response System.","actionTimeStamp":"Wed, 26 Jun 2024 13:39:48 -0400"},{"index":51,"header":"--","actionItem":"On agreeing to the Moore (AL) amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 13:39:32 -0400"},{"index":52,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Moore (AL) amendment No. 32.","actionTimeStamp":"Wed, 26 Jun 2024 13:35:05 -0400"},{"index":53,"header":"--","actionItem":"An amendment, offered by Mr. Moore (AL),  numbered 32 printed in Part C of House Report 118-559 to increase and decrease TSA's Operations and Support account to highlight opposition of further deployment of facial recognition technology for domestic travel at TSA checkpoints.","actionTimeStamp":"Wed, 26 Jun 2024 13:35:04 -0400"},{"index":54,"header":"--","actionItem":"On agreeing to the Molinaro amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 13:34:53 -0400"},{"index":55,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Molinaro amendment No. 30.","actionTimeStamp":"Wed, 26 Jun 2024 13:31:03 -0400"},{"index":56,"header":"--","actionItem":"An amendment, offered by Mr. Molinaro,  numbered 30 printed in Part C of House Report 118-559 to increase funding for ICE by $5 million and takes from the Office of the Secretary.","actionTimeStamp":"Wed, 26 Jun 2024 13:31:02 -0400"},{"index":57,"header":"--","actionItem":"On agreeing to the McCormick amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 13:30:49 -0400"},{"index":58,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the McCormick amendment No. 29.","actionTimeStamp":"Wed, 26 Jun 2024 13:23:30 -0400"},{"index":59,"header":"--","actionItem":"An amendment, offered by Mr. McCormick,  numbered 29 printed in Part C of House Report 118-559 to prohibit any funds made available by this Act from being used to dismantle, demolish, remove, or damage, barriers placed by State governments along the United States-Mexico border.","actionTimeStamp":"Wed, 26 Jun 2024 13:23:28 -0400"},{"index":60,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Grothman amendment No. 20, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Underwood demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 26 Jun 2024 13:22:50 -0400"},{"index":61,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Grothman amendment No. 20.","actionTimeStamp":"Wed, 26 Jun 2024 13:15:28 -0400"},{"index":62,"header":"--","actionItem":"An amendment, offered by Mr. Grothman,  numbered 20 printed in Part C of House Report 118-559 to prohibit funds made available by this Act from being used for the parole program entitled \"Processes for Cubans, Haitians, Nicaraguans, and Venezuelans\".","actionTimeStamp":"Wed, 26 Jun 2024 13:15:26 -0400"},{"index":63,"header":"--","actionItem":"On agreeing to the Greene (GA) amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 13:15:11 -0400"},{"index":64,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 19.","actionTimeStamp":"Wed, 26 Jun 2024 13:07:56 -0400"},{"index":65,"header":"--","actionItem":"An amendment, offered by Ms. Greene (GA),  numbered 19 printed in Part C of House Report 118-559 to prohibit funding for DHS to partner with the State Department to establish Safe Mobility Offices.","actionTimeStamp":"Wed, 26 Jun 2024 13:07:54 -0400"},{"index":66,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Greene (GA) amendment No. 18, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Underwood demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 26 Jun 2024 13:07:00 -0400"},{"index":67,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 18.","actionTimeStamp":"Wed, 26 Jun 2024 13:00:11 -0400"},{"index":68,"header":"--","actionItem":"An amendment, offered by Ms. Greene (GA),  numbered 18 printed in Part C of House Report 118-559 to use the Holman Rule to reduce the salary of Secretary Mayorkas to $1.","actionTimeStamp":"Wed, 26 Jun 2024 13:00:05 -0400"},{"index":69,"header":"--","actionItem":"On agreeing to the Garcia, Robert amendment; Failed by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 12:59:51 -0400"},{"index":70,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Robert Garcia (CA) amendment No. 14.","actionTimeStamp":"Wed, 26 Jun 2024 12:49:44 -0400"},{"index":71,"header":"--","actionItem":"An amendment, offered by Mr. Garcia, Robert,  numbered 14 printed in Part C of House Report 118-559 to cut the $600 million for the Border Wall and the $100 million plus-up for ICE transportation and reallocates this $700 million to FEMA for states, cities, and nonprofits to provide immigrant shelter and services.","actionTimeStamp":"Wed, 26 Jun 2024 12:49:43 -0400"},{"index":72,"header":"--","actionItem":"On agreeing to the Feenstra amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 12:49:32 -0400"},{"index":73,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Feenstra amendment No. 12.","actionTimeStamp":"Wed, 26 Jun 2024 12:45:41 -0400"},{"index":74,"header":"--","actionItem":"An amendment, offered by Mr. Feenstra,  numbered 12 printed in Part C of House Report 118-559 to increase and decrease the Secretary's operations budget by $1 million to call for the Department of Homeland Security, and its subsidiary agencies, to put all funds seized at the Southern border from transnational drug cartels to construction of the Southern border wall.","actionTimeStamp":"Wed, 26 Jun 2024 12:45:38 -0400"},{"index":75,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Clyde amendment No. 11, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Underwood demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 26 Jun 2024 12:44:58 -0400"},{"index":76,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Clyde amendment No. 11.","actionTimeStamp":"Wed, 26 Jun 2024 12:34:00 -0400"},{"index":77,"header":"--","actionItem":"An amendment, offered by Mr. Clyde,  numbered 11 printed in Part C of House Report 118-559 to maintain FY24 enacted funding for CISA.","actionTimeStamp":"Wed, 26 Jun 2024 12:33:54 -0400"},{"index":78,"header":"--","actionItem":"On agreeing to the Cammack amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 12:28:08 -0400"},{"index":79,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Cammack amendment No. 9.","actionTimeStamp":"Wed, 26 Jun 2024 12:21:17 -0400"},{"index":80,"header":"--","actionItem":"An amendment, offered by Mrs. Cammack,  numbered 9 printed in Part C of House Report 118-559 to prohibit funds from being used to finalize any rule or regulation that has resulted in or is likely to result in an annual effect on the economy of $100 million or more.","actionTimeStamp":"Wed, 26 Jun 2024 12:21:13 -0400"},{"index":81,"header":"--","actionItem":"On agreeing to the Biggs amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 12:21:01 -0400"},{"index":82,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 5.","actionTimeStamp":"Wed, 26 Jun 2024 12:12:38 -0400"},{"index":83,"header":"--","actionItem":"An amendment, offered by Mr. Biggs,  numbered 5 printed in Part C of House Report 118-559 to prohibit the use of funds to implement the DHS rule titled \"Public Charge Ground of Inadmissibility.\"","actionTimeStamp":"Wed, 26 Jun 2024 12:12:35 -0400"},{"index":84,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Biggs amendment No. 4, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Underwood demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 26 Jun 2024 12:11:50 -0400"},{"index":85,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 4.","actionTimeStamp":"Wed, 26 Jun 2024 12:04:36 -0400"},{"index":86,"header":"--","actionItem":"An amendment, offered by Mr. Biggs,  numbered 4 printed in Part C of House Report 118-559 to prohibit funding to be used for the salary of the DHS Secretary, Alejandro Mayorkas.","actionTimeStamp":"Wed, 26 Jun 2024 12:04:14 -0400"},{"index":87,"header":"--","actionItem":"On agreeing to the Armstrong amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 12:03:45 -0400"},{"index":88,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Armstrong amendment No. 1.","actionTimeStamp":"Wed, 26 Jun 2024 11:57:41 -0400"},{"index":89,"header":"--","actionItem":"An amendment, offered by Mr. Armstrong,  numbered 1 printed in Part C of House Report 118-559 to defund the implementation of COVID-19 era guidance reducing the hours of operation for CBP at certain Northern Border Ports of Entry to respond to a massive increase in border encounters and non-marijuana drug seizures in North Dakota, Idaho, Minnesota, and Western New York between FY21 and FY23, with adequate staffing and hours of operation to support interdiction and enforcement efforts at Northern Ports of Entry.","actionTimeStamp":"Wed, 26 Jun 2024 11:57:21 -0400"},{"index":90,"header":"--","actionItem":"On agreeing to the Amodei amendments; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 11:56:49 -0400"},{"index":91,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of Whole proceeded with 20 minutes of debate on the Amodei en bloc amendment.","actionTimeStamp":"Wed, 26 Jun 2024 11:53:07 -0400"},{"index":92,"header":"--","actionItem":"Amendments en bloc  offered by Mr. Amodei,  comprised of the following amendments printed in Part C of House Report 118-559 as en bloc: Nos. 3, 6, 7, 8, 10, 13, 16, 17, 21, 22, 23, 24, 25, 26, 27, 28, 31, 33, 34, 35, 36, 40, 41, 47, 49, 51, 60, and 61.","actionTimeStamp":"Wed, 26 Jun 2024 11:51:58 -0400"},{"index":93,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 8752.","actionTimeStamp":"Wed, 26 Jun 2024 11:15:54 -0400"},{"index":94,"header":"--","actionItem":"The Speaker designated the Honorable Mariannette Miller-Meeks to act as Chairwoman of the Committee.","actionTimeStamp":"Wed, 26 Jun 2024 11:14:57 -0400"},{"index":95,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 1316 and Rule XVIII.","actionTimeStamp":"Wed, 26 Jun 2024 11:14:56 -0400"},{"index":96,"header":"--","actionItem":"Rule provides for consideration of H.R. 8774, H.R. 8771 and H.R. 8752. The resolution provides for consideration of H.R. 8774, H.R. 8771, and H.R. 8752, all under a structured rule. The resolution provides for one hour of general debate and one motion to recommit for each bill.","actionTimeStamp":"Wed, 26 Jun 2024 11:14:45 -0400"},{"index":97,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 1316. H.R. 8752 — \"Making appropriations for the Department of Homeland Security for the fiscal year ending September 30, 2025, and for other purposes.\"","actionTimeStamp":"Wed, 26 Jun 2024 11:14:40 -0400"},{"index":98,"header":"--","actionItem":"Mr. Amodei asked unanimous consent that when the House adjourns today, it adjourn to meet at 9:00 a.m. on June 27. Agreed to without objection.","actionTimeStamp":"Wed, 26 Jun 2024 11:14:20 -0400"},{"index":99,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Wed, 26 Jun 2024 11:09:08 -0400"},{"index":100,"header":"On agreeing to the resolution Agreed to by the Yeas and Nays: 207","actionItem":"201 (Roll no. 284).","actionTimeStamp":"Wed, 26 Jun 2024 11:09:06 -0400"},{"index":101,"header":"On ordering the previous question Agreed to by the Yeas and Nays: 188","actionItem":"152 (Roll no. 283).","actionTimeStamp":"Wed, 26 Jun 2024 10:55:20 -0400"},{"index":102,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 1316.","actionTimeStamp":"Wed, 26 Jun 2024 09:30:37 -0400"},{"index":103,"header":"UNANIMOUS CONSENT REQUEST","actionItem":"Mr. Austin Scott (GA) asked unanimous consent that the resolution be amended by adding at the end of the resolution section 18 stating notwithstanding any other provision of this resolution, during consideration of H.R. 8771 pursuant to this resolution, it shall not be in order to consider amendment number 37 printed in part B of House Report 118-559. Agreed to without objection.","actionTimeStamp":"Wed, 26 Jun 2024 09:28:54 -0400"},{"index":104,"header":"--","actionItem":"Considered as privileged matter. H. Res. 1316 — \"Providing for consideration of the bill (H.R. 8774) making appropriations for the Department of Defense for the fiscal year ending September 30, 2025, and for other purposes; providing for consideration of the bill (H.R. 8771) making appropriations for the Department of State, foreign operations, and related programs for the fiscal year ending September 30, 2025, and for other purposes; and providing for consideration of the bill (H.R. 8752) making appropriations for the Department of Homeland Security for the fiscal year ending September 30, 2025, and for other purposes.\"","actionTimeStamp":"Wed, 26 Jun 2024 09:16:47 -0400"},{"index":105,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches which by direction of the Chair, would be limited to 15 per side of the aisle.","actionTimeStamp":"Wed, 26 Jun 2024 09:02:50 -0400"},{"index":106,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Ms. Tlaib to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 26 Jun 2024 09:02:35 -0400"},{"index":107,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 26 Jun 2024 09:02:32 -0400"},{"index":108,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Wed, 26 Jun 2024 09:00:58 -0400"},{"index":109,"header":"--","actionItem":"The Speaker designated the Honorable Mark Alford to act as Speaker pro tempore for today.","actionTimeStamp":"Wed, 26 Jun 2024 09:00:48 -0400"},{"index":110,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 26 Jun 2024 09:00:00 -0400"}]}