{"retrieved-date":"2025-10-17","actions-date":"Thursday, October 16, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, October 16)","actionItem":"H.R. 4016 (Rep. Calvert):\n        A bill making appropriations for the Department of Defense for the fiscal year ending September 30, 2026, and for other purposes.\n\n        -- Cloture on the motion to proceed to the measure not invoked in Senate by Yea-Nay Vote. 50 - 44. Record Vote Number: 575 \n\n\n        -- Motion by Senator Thune to reconsider the vote by which cloture on the motion to proceed to H.R. 4016 was not invoked (Record Vote No. 575) entered in Senate.\n\n\n H.R. 5371 (Rep. Cole):\n        A bill making continuing appropriations and extensions for fiscal year 2026, and for other purposes .\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Fifth cloture motion on the motion to proceed to the measure not invoked in Senate by Yea-Nay Vote. 51 - 45. Record Vote Number: 573 \n\n\n        -- Motion by Senator Thune to reconsider the vote by which the fifth cloture on the motion to proceed to H.R. 5371 was not invoked (Record Vote No. 573) entered in Senate.\n\n        -- Sixth cloture motion on the motion to proceed to the measure presented in Senate.\n\n\n S.Res. 455 (Sen. Cortez Masto):\n        A resolution commending and congratulating the Summerlin South Little League baseball team on winning the 2025 Little League World Series United States Championship.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 456 (Sen. Scott, of FL):\n        A resolution commemorating the 40th anniversary of the inaugural flight of Space Shuttle Atlantis and recognizing Kennedy Space Center for its economic, educational, and cultural contributions to the State of Florida and the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, October 16)","actionItem":"PN346-5:\n        Anne-Leigh Gaylord Moe, of Florida, to be United States District Judge for the Middle District of Florida\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN368:\n        Stephen Chad Meredith, of Kentucky, to be United States District Judge for the Eastern District of Kentucky\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN400-2:\n        William W. Mercer, of Montana, to be United States District Judge for the District of Montana\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN466-6:\n        Harold D. Mooty III, of Alabama, to be United States District Judge for the Northern District of Alabama\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 62 - 34. Record Vote Number: 574 \n\n\n        -- Considered by Senate.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Moran, at  2:32 p.m., the Senate adjourned, under its order of today, until  3 p.m. on Monday, October 20, 2025.","actionTimeStamp":"--"}]}