{"retrieved-date":"2023-11-14","actions-date":"Tue, 14 Nov 2023 13:14:54 -0500","actions-title":"House Floor Proceedings","actions-count":56,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Grothman amendment No. 22.","actionTimeStamp":"Tue, 14 Nov 2023 13:14:54 -0500"},{"index":2,"header":"--","actionItem":"An amendment, offered by Mr. Grothman,  numbered 22 printed in Part B of House Report 118-272 to increase and decrease funding in Centers for Disease Control and Prevention-Wide Activities and Program Support by $1,000,000 to express the intent for the CDC to conduct a study on the connection between vitamin D deficiencies and COVID-19 mortality rates in the United States; and the role of vitamin D in suppressing severe COVID-19 symptoms; and determine whether or not a recommendation should be made on the supplemental intake of vitamin D to boost immune health and protect against complications associated with respiratory illness and infections.","actionTimeStamp":"Tue, 14 Nov 2023 13:14:44 -0500"},{"index":3,"header":"--","actionItem":"On agreeing to the Mills amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 13:14:16 -0500"},{"index":4,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Mills amendment No. 19.","actionTimeStamp":"Tue, 14 Nov 2023 13:05:44 -0500"},{"index":5,"header":"--","actionItem":"An amendment, offered by Mr. Mills,  numbered 19 printed in Part B of House Report 118-272 to reduce the appropriated amount for the Public Health Scientific Services to the FY19 appropriated amount.","actionTimeStamp":"Tue, 14 Nov 2023 13:05:33 -0500"},{"index":6,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 13:05:00 -0500"},{"index":7,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 13.","actionTimeStamp":"Tue, 14 Nov 2023 13:01:37 -0500"},{"index":8,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 13 printed in Part B of House Report 118-272 to transfer funds from Health and Human Services General Department Management to the Inspector General to combat waste, fraud, and abuse.","actionTimeStamp":"Tue, 14 Nov 2023 13:01:23 -0500"},{"index":9,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 13:01:01 -0500"},{"index":10,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 11.","actionTimeStamp":"Tue, 14 Nov 2023 12:57:45 -0500"},{"index":11,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 11 printed in Part B of House Report 118-272 to transfer funds from Health and Human Services General Department Management to the Rural Residency Planning and Development Program to support physician workforce expansion in rural areas.","actionTimeStamp":"Tue, 14 Nov 2023 12:57:29 -0500"},{"index":12,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 12:57:12 -0500"},{"index":13,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 10.","actionTimeStamp":"Tue, 14 Nov 2023 12:54:56 -0500"},{"index":14,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 10 printed in Part B of House Report 118-272 to transfer funds from Health and Human Services General Department Management to the Rural Emergency Hospital Technical Assistance Program.","actionTimeStamp":"Tue, 14 Nov 2023 12:54:41 -0500"},{"index":15,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 12:54:22 -0500"},{"index":16,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 9.","actionTimeStamp":"Tue, 14 Nov 2023 12:51:13 -0500"},{"index":17,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 9 printed in Part B of House Report 118-272 to transfer funds from Health and Human Services General Department Management for the purchase and implementation of telehealth services to improve health care coordination for rural veterans between rural providers and the Department of Veterans Affairs.","actionTimeStamp":"Tue, 14 Nov 2023 12:51:02 -0500"},{"index":18,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 12:50:43 -0500"},{"index":19,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 8.","actionTimeStamp":"Tue, 14 Nov 2023 12:47:58 -0500"},{"index":20,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 8 printed in Part B of House Report 118-272 to transfer funds from Health and Human Services General Department Management to the Small Rural Hospital Improvement Grant Program.","actionTimeStamp":"Tue, 14 Nov 2023 12:47:43 -0500"},{"index":21,"header":"--","actionItem":"On agreeing to the Meuser amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 12:44:40 -0500"},{"index":22,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Meuser amendment No. 6.","actionTimeStamp":"Tue, 14 Nov 2023 12:37:15 -0500"},{"index":23,"header":"--","actionItem":"An amendment, offered by Mr. Meuser,  numbered 6 printed in Part B of House Report 118-272 to provide the Health Workforce Account with an additional $10 million for the Nurse Corps programs which is offset with a $19 million deduction to the National Institute of Nursing Research.","actionTimeStamp":"Tue, 14 Nov 2023 12:36:57 -0500"},{"index":24,"header":"--","actionItem":"On agreeing to the Cloud amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 12:36:36 -0500"},{"index":25,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Cloud amendment No. 4.","actionTimeStamp":"Tue, 14 Nov 2023 12:31:45 -0500"},{"index":26,"header":"--","actionItem":"An amendment, offered by Mr. Cloud,  numbered 4 printed in Part B of House Report 118-272 to strike a reference to a job corps center on Treasure Island in Section 114 and replace it with the job corps center located in San Marcos, Texas.","actionTimeStamp":"Tue, 14 Nov 2023 12:31:31 -0500"},{"index":27,"header":"--","actionItem":"On agreeing to the Higgins (LA) amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 12:31:05 -0500"},{"index":28,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Higgins (LA) amendment No. 2.","actionTimeStamp":"Tue, 14 Nov 2023 12:23:08 -0500"},{"index":29,"header":"--","actionItem":"An amendment, offered by Mr. Higgins (LA),  numbered 2 printed in Part B of House Report 118-272 to reduce the Mine Safety and Health Administration's Salary and Expenses account by $1,000,000, and to redirect these funds to the Department of Labor's Office of Inspector General's account.","actionTimeStamp":"Tue, 14 Nov 2023 12:22:48 -0500"},{"index":30,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Miller (IL) amendment No. 1, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Ms. DeLauro demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 12:22:28 -0500"},{"index":31,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Miller (IL) amendment No. 1.","actionTimeStamp":"Tue, 14 Nov 2023 12:17:23 -0500"},{"index":32,"header":"--","actionItem":"An amendment, offered by Mrs. Miller (IL),  numbered 1 printed in Part B of House Report 118-272 to reduce funding for the Occupational Safety and Health Administration by $536,922,000 to $0.","actionTimeStamp":"Tue, 14 Nov 2023 12:17:12 -0500"},{"index":33,"header":"--","actionItem":"On agreeing to the Aderholt amendments; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 12:16:45 -0500"},{"index":34,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 20 minutes of debate on the Aderholt amendment en bloc.","actionTimeStamp":"Tue, 14 Nov 2023 12:06:07 -0500"},{"index":35,"header":"--","actionItem":"Amendments en bloc  offered by Mr. Aderholt,  comprised of the following amendments printed in Part B of House Report 118-272 as en bloc: Nos. 3, 5, 7, 12, 14, 15, 16, 17, 18, 20, 21, 23, 24, 25, 27, 29, 30, 31, 37, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 56, 57, 59, 60, 64, 65, 66, 67, 68, 72, 73, 74, 75, 77, 79, and 141.","actionTimeStamp":"Tue, 14 Nov 2023 12:05:17 -0500"},{"index":36,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 5894.","actionTimeStamp":"Tue, 14 Nov 2023 11:20:59 -0500"},{"index":37,"header":"--","actionItem":"The Speaker designated the Honorable Scott DesJarlais to act as Chairman of the Committee.","actionTimeStamp":"Tue, 14 Nov 2023 11:20:41 -0500"},{"index":38,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 864 and Rule XVIII.","actionTimeStamp":"Tue, 14 Nov 2023 11:20:36 -0500"},{"index":39,"header":"--","actionItem":"Rule provides for consideration of H.R. 5894. The resolution provides for consideration of H.R. 5894 under a structured rule with one hour of general debate and one motion to recommit allowed.","actionTimeStamp":"Tue, 14 Nov 2023 11:16:32 -0500"},{"index":40,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 864. H.R. 5894 — \"Making appropriations for the Departments of Labor, Health and Human Services, and Education, and related agencies for the fiscal year ending September 30, 2024, and for other purposes.\"","actionTimeStamp":"Tue, 14 Nov 2023 11:16:27 -0500"},{"index":41,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Tue, 14 Nov 2023 11:16:24 -0500"},{"index":42,"header":"On agreeing to the resolution Agreed to by recorded vote: 217","actionItem":"209 (Roll no. 647).","actionTimeStamp":"Tue, 14 Nov 2023 11:16:22 -0500"},{"index":43,"header":"On ordering the previous question Agreed to by the Yeas and Nays: 217","actionItem":"208 (Roll no. 646).","actionTimeStamp":"Tue, 14 Nov 2023 11:04:09 -0500"},{"index":44,"header":"--","actionItem":"Considered as unfinished business. H. Res. 864 — \"Providing for consideration of the bill (H.R. 5894) making appropriations for the Departments of Labor, Health and Human Services, and Education, and related agencies for the fiscal year ending September 30, 2024, and for other purposes.\"","actionTimeStamp":"Tue, 14 Nov 2023 10:30:23 -0500"},{"index":45,"header":"UNFINISHED BUSINESS","actionItem":"The Chair announced the unfinished business was the question on ordering the previous question on H. Res. 864 and on agreeing to resolution, if ordered, which had been debated earlier and on which further proceedings had been postponed.","actionTimeStamp":"Tue, 14 Nov 2023 10:30:21 -0500"},{"index":46,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of November 14.","actionTimeStamp":"Tue, 14 Nov 2023 10:30:19 -0500"},{"index":47,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is subject to the call of the Chair.","actionTimeStamp":"Tue, 14 Nov 2023 09:46:43 -0500"},{"index":48,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on H. Res. 864, the Chair put the question on ordering the previous question and by voice vote, announced that the ayes had prevailed. Ms. Scanlon demanded the yeas and nays and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 09:45:52 -0500"},{"index":49,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 864.","actionTimeStamp":"Tue, 14 Nov 2023 09:17:23 -0500"},{"index":50,"header":"--","actionItem":"Considered as privileged matter. H. Res. 864 — \"Providing for consideration of the bill (H.R. 5894) making appropriations for the Departments of Labor, Health and Human Services, and Education, and related agencies for the fiscal year ending September 30, 2024, and for other purposes.\"","actionTimeStamp":"Tue, 14 Nov 2023 09:13:46 -0500"},{"index":51,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one-minute speeches, which by direction of the Chair, would be limited to five per side of the aisle.","actionTimeStamp":"Tue, 14 Nov 2023 09:04:40 -0500"},{"index":52,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Edwards to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Tue, 14 Nov 2023 09:04:26 -0500"},{"index":53,"header":"SPEAKERS APPROVAL OF THE JOURNAL","actionItem":"The Chair announced that he had examined the Journal of the last day's proceedings and had approved it. Mr. Burgess demanded that the question be put on agreeing to the Speaker's approval of the Journal and by voice vote, the Chair announced that the ayes had prevailed. Mr. Burgess objected to the voice vote based upon the absence of a quorum and the Chair postponed further proceedings on the question of agreeing to the Speaker's approval of the Journal until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 09:02:42 -0500"},{"index":54,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Tue, 14 Nov 2023 09:01:01 -0500"},{"index":55,"header":"--","actionItem":"The Speaker designated the Honorable Ben Cline to act as Speaker pro tempore for today.","actionTimeStamp":"Tue, 14 Nov 2023 09:00:41 -0500"},{"index":56,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Tue, 14 Nov 2023 09:00:00 -0500"}]}