{"retrieved-date":"2023-3-9","actions-date":"Thu, 09 Mar 2023 12:25:03 -0500","actions-title":"House Floor Proceedings","actions-count":17,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 199, the Committee of the Whole proceeded with 10 minutes of debate on the Rose amendment No. 10.","actionTimeStamp":"Thu, 09 Mar 2023 12:25:03 -0500"},{"index":2,"header":"--","actionItem":"An amendment, offered by Mr. Rose,  numbered 10 printed in House Report 118-7 to add a findings section that states that inspectors general should not less than annually for the next seven years publicly report the number of complaints and tips received, the number of investigations opened, and statistics on how investigations were managed and their disposition by that inspector general related to compliance with the underlying bill and the amendments made by the underlying bill.","actionTimeStamp":"Thu, 09 Mar 2023 12:25:00 -0500"},{"index":3,"header":"--","actionItem":"On agreeing to the Rose amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 09 Mar 2023 12:24:42 -0500"},{"index":4,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 199, the Committee of the Whole proceeded with 10 minutes of debate on the Rose amendment No. 9.","actionTimeStamp":"Thu, 09 Mar 2023 12:14:19 -0500"},{"index":5,"header":"--","actionItem":"An amendment, offered by Mr. Rose,  numbered 9 printed in House Report 118-7 to require mandatory annual training on the requirements of the underlying bill.","actionTimeStamp":"Thu, 09 Mar 2023 12:14:03 -0500"},{"index":6,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Thu, 09 Mar 2023 12:12:58 -0500"},{"index":7,"header":"--","actionItem":"Considered as unfinished business. H.R. 140 — \"To amend title 5, United States Code, to prohibit Federal employees from advocating for censorship of viewpoints in their official capacity, and for other purposes.\"","actionTimeStamp":"Thu, 09 Mar 2023 12:12:45 -0500"},{"index":8,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches which by direction of the Chair, would be limited to 15 per side of the aisle.","actionTimeStamp":"Thu, 09 Mar 2023 12:04:19 -0500"},{"index":9,"header":"--","actionItem":"The House received a message from the Senate. The Senate passed S. 724, and H.J. Res. 26. Senate agreed to S. Res. 100. Appointments: Senate Trustee to the James Madison Memorial Fellowship Foundation and Board of Visitors of the U.S. Military Academy.","actionTimeStamp":"Thu, 09 Mar 2023 12:02:19 -0500"},{"index":10,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. McGovern to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 09 Mar 2023 12:02:18 -0500"},{"index":11,"header":"--","actionItem":"The Speaker announced approval of the Journal. Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Thu, 09 Mar 2023 12:02:06 -0500"},{"index":12,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Thu, 09 Mar 2023 12:00:31 -0500"},{"index":13,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of March 9.","actionTimeStamp":"Thu, 09 Mar 2023 12:00:21 -0500"},{"index":14,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for approximately 12:00 p.m. today.","actionTimeStamp":"Thu, 09 Mar 2023 10:54:30 -0500"},{"index":15,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Thu, 09 Mar 2023 10:00:44 -0500"},{"index":16,"header":"--","actionItem":"The Speaker designated the Honorable Mary E. Miller to act as Speaker pro tempore for today.","actionTimeStamp":"Thu, 09 Mar 2023 10:00:22 -0500"},{"index":17,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 09 Mar 2023 10:00:00 -0500"}]}