{"retrieved-date":"2026-2-27","actions-date":"Thursday, February 26, 2026","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, February 26)","actionItem":"H.R. 972 (Rep. Titus):\n        A bill to amend the Sloan Canyon National Conservation Area Act to adjust the boundary of the Sloan Canyon National Conservation Area, and for other purposes.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 2815 (Rep. Begich):\n        A bill to provide equitable treatment for the people of the Village Corporation established for the Native Village of Saxman, Alaska, and for other purposes.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6644 (Rep. Hill):\n        A bill a bill to increase the supply of housing in America, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.\n\n\n S. 1070 (Sen. Ernst):\n        A bill to establish a National STEM Week to promote American innovation and enhance STEM education pathways for all students, including those in rural, urban, and underserved communities.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 2245 (Sen. Baldwin):\n        A bill to amend the Digital Coast Act to improve the acquisition, integration, and accessibility of data of the Digital Coast program and to extend the program.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S.Res. 617 (Sen. Kaine):\n        A resolution supporting the goals and ideals of \"Career and Technical Education Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 618 (Sen. Blunt Rochester):\n        A resolution recognizing the importance of career and technical education (\"CTE\") educators and work-based learning coordinators in delivering high-quality CTE, preparing students for success in the workplace, the classroom, and in life, and supporting dynamic workforce pipelines that enable the United States to grow and lead in critical economic sectors.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 619 (Sen. Sullivan):\n        A resolution designating February 16, 2026, as \"National Elizabeth Peratrovich Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 620 (Sen. Barrasso):\n        A resolution designating February 28, 2026, as \"Rare Disease Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 621 (Sen. Collins):\n        A resolution designating the week of February 23 through February 27, 2026, as \"National Public Schools Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 622 (Sen. Young):\n        A resolution expressing support for the designation of February 21 through February 28, 2026, as \"National FFA Week\", recognizing the important role of the National FFA Organization in developing the next generation of globally conscious leaders who will change the world, and celebrating the 50th anniversary of the chartering of the State of Alaska as a State FFA  Association.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, February 26)","actionItem":"PN730-46:\n        Ryan McCormack, of Virginia, to be Under Secretary of Transportation for Policy\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 60 - 34. Record Vote Number: 42 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 57 - 33. Record Vote Number: 43","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Banks, at  2:54 p.m., the Senate adjourned, under its order of today, until  3 p.m. on Monday, March 2, 2026.","actionTimeStamp":"--"}]}