{"retrieved-date":"2025-1-24","actions-date":"Fri, 24 Jan 2025 09:11:59 -0500","actions-title":"House Floor Proceedings","actions-count":22,"actions-list":[{"index":1,"header":"--","actionItem":"The Speaker announced that the House do now adjourn pursuant to clause 13 of Rule I. The next meeting is scheduled for 11:00 a.m. on January 28, 2025.","actionTimeStamp":"Fri, 24 Jan 2025 09:11:59 -0500"},{"index":2,"header":"Board of Visitors to the United States Naval Academy","actionItem":"Pursuant to 10 U.S.C. 8468(a), and the order of the House of January 3, 2025, the Speaker appointed the following members of the House to the Board of Visitors to the United States Naval Academy: Mr. Ellzey and Mr. Scott Franklin of Florida.","actionTimeStamp":"Fri, 24 Jan 2025 09:11:58 -0500"},{"index":3,"header":"Board of Visitors to the United States Military Academy","actionItem":"Pursuant to 10 U.S.C. 7455(a), and the order of the House of January 3, 2025, the Speaker appointed the following members of the House to the Board of Visitors to the United States Military Academy: Mr. Womack and Mrs. Bice.","actionTimeStamp":"Fri, 24 Jan 2025 09:11:38 -0500"},{"index":4,"header":"Board of Visitors to the United States Merchant Marine Academy","actionItem":"Pursuant to 46 U.S.C. 51312(b), and the order of the House of January 3, 2025, the Speaker appointed the following members of the House to the Board of Visitors to the United States Merchant Marine Academy: Mr. Valadao and Mr. Suozzi.","actionTimeStamp":"Fri, 24 Jan 2025 09:11:09 -0500"},{"index":5,"header":"Board of Visitors to the United States Coast Guard Academy","actionItem":"Pursuant to 14 U.S.C. 1903(b), and the order of the House of January 3, 2025, the Speaker appointed the following members of the House to the Board of Visitors to the United States Coast Guard Academy: Mrs. McClain and Mr. Rutherford.","actionTimeStamp":"Fri, 24 Jan 2025 09:10:55 -0500"},{"index":6,"header":"Board of Visitors of the United States Air Force Academy","actionItem":"Pursuant to 10 U.S.C. 9455(a), clause 10 of rule I, and the order of the House of January 3, 2025, the Speaker appointed the following members of the House to the Board of Visitors of the United States Air Force Academy: Mr. Pfluger and Mr. Crank.","actionTimeStamp":"Fri, 24 Jan 2025 09:10:23 -0500"},{"index":7,"header":"British-American Interparliamentary Group","actionItem":"Pursuant to 22 U.S.C. 276L, and the order of the House of January 3, 2025, the Speaker appointed the following member of the House to the British-American Interparliamentary Group: Mr. Latta.","actionTimeStamp":"Fri, 24 Jan 2025 09:10:00 -0500"},{"index":8,"header":"Congressional-Executive Commission on the People's Republic of China","actionItem":"Pursuant to 22 U.S.C. 6913, and the order of the House of January 3, 2025, the Speaker appointed the following member of the House to the Congressional-Executive Commission on the People's Republic of China: Mr. Smith of New Jersey, Co-Chair.","actionTimeStamp":"Fri, 24 Jan 2025 09:09:44 -0500"},{"index":9,"header":"Japan-United States Friendship Commission","actionItem":"Pursuant to 22 U.S.C. 2903, and the order of the House of January 3, 2025, the Speaker appointed the following member of the House to the Japan-United States Friendship Commission: Mr. Smith of Nebraska.","actionTimeStamp":"Fri, 24 Jan 2025 09:09:18 -0500"},{"index":10,"header":"Tom Lantos Human Rights Commission","actionItem":"Pursuant to section 4(c) of House Resolution 5, One Hundred Nineteenth Congress, and the order of the House of January 3, 2025, the Speaker appointed the following member of the House to serve as Co-Chair of the Tom Lantos Human Rights Commission: Mr. Smith of New Jersey.","actionTimeStamp":"Fri, 24 Jan 2025 09:09:01 -0500"},{"index":11,"header":"Commission on Reform and Modernization of the Department of State","actionItem":"Pursuant to section 9803(d)(1)(C) of the James M. Inhofe National Defense Authorization Act for Fiscal Year 2023 (Public Law No. 117-263), and the order of the House of January 3, 2025, the Speaker appointed the following member of the House to the Commission on Reform and Modernization of the Department of State: Mr. Miller of Ohio.","actionTimeStamp":"Fri, 24 Jan 2025 09:08:20 -0500"},{"index":12,"header":"Migratory Bird Conservation Commission","actionItem":"Pursuant to section 2 of the Migratory Bird Conservation Act (16 U.S.C. 715a), and the order of the House of January 3, 2025, the Speaker appointed the following member of the House to the Migratory Bird Conservation Commission: Mr. Wittman.","actionTimeStamp":"Fri, 24 Jan 2025 09:08:00 -0500"},{"index":13,"header":"Board of Regents of the Smithsonian Institution","actionItem":"Pursuant to sections 5580 and 5581 of the revised statutes (20 U.S.C. 42-43), and the order of the House of January 3, 2025, the Speaker appointed the following members of the House to the Board of Regents of the Smithsonian Institution: Mr. Smith of Nebraska, Mr. Gimenez and Ms. Matsui.","actionTimeStamp":"Fri, 24 Jan 2025 09:07:32 -0500"},{"index":14,"header":"Board of Trustees of the John F. Kennedy Center for the Performing Arts","actionItem":"Pursuant to section 2(a) of the National Cultural Center Act (20 U.S.C. 76h(a)), amended by Public Law 107-117, and the order of the House of January 3, 2025, the Speaker appointed the following members of the House to the Board of Trustees of the John F. Kennedy Center for the Performing Arts: Mr. McCaul, Ms. Letlow and Mrs. Beatty.","actionTimeStamp":"Fri, 24 Jan 2025 09:07:04 -0500"},{"index":15,"header":"United States Group of the NATO Parliamentary Assembly","actionItem":"Pursuant to 22 U.S.C. 1928a, and the order of the House of January 3, 2025, the Speaker appointed the following members of the House to the United States Group of the NATO Parliamentary Assembly: Mr. Turner of Ohio, Mr. Dunn of Florida, Mrs. Wagner, Mr. Fitzpatrick, Mr. Guthrie, Ms. Van Duyne and Mr. Connolly.","actionTimeStamp":"Fri, 24 Jan 2025 09:06:32 -0500"},{"index":16,"header":"United States Semiquincentennial Commission","actionItem":"Pursuant to section 4 of the United States Semiquincentennial Commission Act of 2016 (Public Law 114-196), and the order of the House of January 3, 2025, the Speaker appointed the following members of the House to the United States Semiquincentennial Commission: Mr. Aderholt and Ms. Salazar.","actionTimeStamp":"Fri, 24 Jan 2025 09:06:04 -0500"},{"index":17,"header":"House Democracy Partnership","actionItem":"Pursuant to section 4(b) of House Resolution 5, One Hundred Nineteenth Congress, and the order of the House of January 3, 2025, the Speaker appointed the following members of the House to the House Democracy Partnership: Mr. Buchanan, Chair, Mr. Smith of Nebraska, Mr. LaHood, Mr. Dunn of Florida, Mr. Fitzpatrick, Mr. Hern of Oklahoma, Ms. Tenney, Mrs. Luna, Mr. Scott Franklin of Florida, Mr. Steil and Mr. Kelly of Pennsylvania.","actionTimeStamp":"Fri, 24 Jan 2025 09:05:45 -0500"},{"index":18,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair led the House in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Fri, 24 Jan 2025 09:05:01 -0500"},{"index":19,"header":"SPEAKER'S APPROVAL OF THE JOURNAL","actionItem":"Pursuant to clause 13 of Rule I, the Journal of the last day's proceedings was approved.","actionTimeStamp":"Fri, 24 Jan 2025 09:03:48 -0500"},{"index":20,"header":"--","actionItem":"Today's prayer was offered by Dr. Benny Tate, Rock Springs Church, Milner, Georgia","actionTimeStamp":"Fri, 24 Jan 2025 09:03:04 -0500"},{"index":21,"header":"--","actionItem":"The Speaker designated the Honorable Mike Collins to act as Speaker pro tempore for today.","actionTimeStamp":"Fri, 24 Jan 2025 09:02:18 -0500"},{"index":22,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Fri, 24 Jan 2025 09:00:00 -0500"}]}