{"retrieved-date":"2026-1-13","actions-date":"Monday, January 12, 2026","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Thursday, January 8, 2026,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Thursday, January 8, 2026, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, January 12)","actionItem":"H.R. 6938 (Rep. Cole):\n        A bill making consolidated appropriations for the fiscal year ending September 30, 2026, and for other purposes.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Cloture on the motion to proceed to the measure invoked in Senate by Yea-Nay Vote. 80 - 13. Record Vote Number: 7 \n\n\n\n S.Res. 570 (Sen. Smith):\n        A resolution designating November 2025 as \"National Lung Cancer Awareness Month\" and expressing support for early detection and treatment of lung cancer.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Monday, January 12)","actionItem":"PN352:\n        Lt. Gen. Thomas M. Carden, Jr., in the Army, to be General\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Moreno, at  6:53 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}