{"retrieved-date":"2023-6-27","actions-date":"Tue, 27 Jun 2023 09:04:03 -0400","actions-title":"House Floor Proceedings","actions-count":8,"actions-list":[{"index":1,"header":"--","actionItem":"The Speaker announced that the House do now adjourn pursuant to section 3(z) of H. Res. 5. The next meeting is scheduled for 2:00 p.m. on June 30, 2023.","actionTimeStamp":"Tue, 27 Jun 2023 09:04:03 -0400"},{"index":2,"header":"Board of Trustees of the John F. Kennedy Center for the Performing Arts","actionItem":"Pursuant to section 2(a) of the National Cultural Center Act (20 U.S.C. 76h(a)), amended by Public Law 107-117, and the order of the House of January 9, 2023, the Speaker appointed the following member of the House to the Board of Trustees of the John F. Kennedy Center for the Performing Arts: Mrs. Beatty.","actionTimeStamp":"Tue, 27 Jun 2023 09:04:00 -0400"},{"index":3,"header":"--","actionItem":"The House received a message from the Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U. S. House of Representatives, the Deputy Clerk notified the House that he had received the following message from the Secretary of the Senate on June 26, 2023, at 2:33 p.m.: That the Senate passed S. 111, S. 206, S. 264, S. 349, S. 829, S. 1549, and H.R. 1734, as amended.","actionTimeStamp":"Tue, 27 Jun 2023 09:03:37 -0400"},{"index":4,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair led the House in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Tue, 27 Jun 2023 09:02:59 -0400"},{"index":5,"header":"SPEAKER'S APPROVAL OF THE JOURNAL","actionItem":"Pursuant to section 3(z) of H. Res. 5, the Jounral of the last day's proceedings was approved.","actionTimeStamp":"Tue, 27 Jun 2023 09:02:49 -0400"},{"index":6,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Tue, 27 Jun 2023 09:00:47 -0400"},{"index":7,"header":"--","actionItem":"The Speaker designated the Honorable Warren Davidson to act as Speaker pro tempore for today.","actionTimeStamp":"Tue, 27 Jun 2023 09:00:30 -0400"},{"index":8,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Tue, 27 Jun 2023 09:00:00 -0400"}]}