{"retrieved-date":"2024-2-1","actions-date":"Wednesday, January 31, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, January 31)","actionItem":"H.R. 1568 (Rep. Waltz):\n        A bill to amend the Tariff Act of 1930 to protect personally identifiable information, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 538 (Sen. Hyde-Smith):\n        A resolution commending Blue Mountain Christian University for 150 years of service to the State of Mississippi and the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 539 (Sen. Rubio):\n        A resolution supporting the contributions of Catholic schools in the United States and celebrating the 50th annual National Catholic Schools Week.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, January 31)","actionItem":"PN119:\n        Joseph Goffman, of Pennsylvania, to be an Assistant Administrator of the Environmental Protection Agency\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 29 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 30 \n\n\n\n PN283-2:\n        Joan Polaschik, in the Foreign Service\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN355:\n        7 nominations in the Foreign Service beginning with Andrew Edlefsen and ending with Christopher Wilken\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN462:\n        Rear Adm. Daniel L. Cheever, in the Navy, to be Vice Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN736:\n        14 nominations in the Foreign Service beginning with Olutayo O. Akingbe and ending with Kathy W. Yao\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN816:\n        Karoline Mehalchick, of Pennsylvania, to be United States District Judge for the Middle District of Pennsylvania\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 27 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 28 \n\n\n\n PN1032:\n        Julie A. Griffith, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1049-9:\n        Brig. Gen. Jason E. Kelly, in the Army, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1075:\n        12 nominations in the Air Force beginning with La Rita S. Abel and ending with Dara J. Warren\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1129:\n        113 nominations in the Foreign Service beginning with Christopher Allen and ending with Alicia P. Allison\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1201:\n        Col. Erica R. Austin, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1202:\n        16 nominations in the Air Force beginning with Col. Korey E. Amundson and ending with Col. Christopher M. Zidek\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1203:\n        Brig. Gen. Patricia R. Wallace, in the Army, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1204:\n        2 nominations in the Marine Corps beginning with Brig. Gen. Douglas K. Clark and ending with Brig. Gen. Sean N. Day\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1205:\n        Col. William T. Wilburn, Jr., in the Marine Corps, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1206:\n        3 nominations in the Marine Corps beginning with Col. Thomas M. Armas and ending with Col. Patrick F. Tiernan\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1207:\n        Thomas P. Parshall, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1208:\n        Regan C. Reynolds, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1209:\n        Ryan L. Veneberg, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1210:\n        Habibatu A. Mojidi, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1255:\n        Kirk Edward Sherriff, of California, to be United States District Judge for the Eastern District of California\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 54 - 45. Record Vote Number: 26 \n\n\n\n PN1258:\n        Lt. Gen. Alexus G. Grynkewich, in the Air Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1259:\n        Col. Gwendolyn A. Foster, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1260:\n        Col. Jason J. Lennen, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1261:\n        Col. Eveline F. Yao, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1263:\n        11 nominations in the Army beginning with Brig. Gen. Timothy E. Brennan and ending with Col. John P. Stanley\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1264:\n        Col. Michael L. Smith, in the Army, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1266:\n        19 nominations in the Navy beginning with Capt. Todd F. Cimicata and ending with Capt. Melvin R. Smith, Jr.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1268:\n        2 nominations in the Navy beginning with Capt. Brian A. Harding and ending with Capt. Vincent S. Tionquiao\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1269:\n        5 nominations in the Space Force beginning with Col. Chandler P. Atwood and ending with Col. Zachary S. Warakomski\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1274:\n        123 nominations in the Air Force beginning with Andrew Ray Adamich and ending with John Peter Zimmerman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1275:\n        Zachary M. Nunn, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1278:\n        Lawrence M. Csaszar, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1279:\n        David A. Delcuadrozimmerman, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1284:\n        Matthew W. Rose, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1287:\n        Kevin F. Champaigne, in the Space Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1296:\n        Maj. Gen. Thomas M. Carden, Jr., in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1297:\n        10 nominations in the Marine Corps beginning with Brig. Gen. Melvin G. Carter and ending with Brig. Gen. James B. Wellons\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1299:\n        2 nominations in the Navy beginning with Capt. Timothy A. Brown and ending with Capt. Michael York\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1304:\n        3 nominations in the Marine Corps beginning with Jeffrey A. Dovan and ending with Hugo J. Vargas\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1305:\n        2 nominations in the Marine Corps beginning with Bryan M. Baker and ending with William T. Carrier\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1306:\n        3 nominations in the Marine Corps beginning with Antonio C. Ewings and ending with Adam W. Spiars\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1308:\n        4 nominations in the Marine Corps beginning with Donald E. Charboneau and ending with Jeffrey A. Tranberg\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1309:\n        Aaron Mora, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1311:\n        3 nominations in the Marine Corps beginning with Rafael B. Martinez and ending with Isaac K. Tibayan\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1312:\n        4 nominations in the Marine Corps beginning with Luis E. Colon and ending with Anthony L. Galluzzi\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1313:\n        5 nominations in the Marine Corps beginning with Jason T. Connolly and ending with Cole A. Sardinta\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1314:\n        12 nominations in the Marine Corps beginning with Dustin M. Bailey and ending with Xavier Ten\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1315:\n        3 nominations in the Marine Corps beginning with Matthew D. Daleo and ending with Michael J. Landers\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1316:\n        8 nominations in the Marine Corps beginning with Jason R. Beken and ending with Joshua B. Whitehead\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1317:\n        4 nominations in the Marine Corps beginning with Bernard J. Coyne, Jr. and ending with Ahbleza Theobald\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1318:\n        2 nominations in the Marine Corps beginning with Gregory S. Canevari and ending with Antonio G. Marrero\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1319:\n        Richard L. Raines, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1320:\n        James M. Rod, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1322:\n        Daniel E. Fuson, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1323:\n        3 nominations in the Marine Corps beginning with Glenn A. Staley and ending with Corey R. Wainscott\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1325:\n        Mark A. Wess, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1326:\n        Scott H. Williams, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1327:\n        Sonny D. Rowland, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Merkley, at  7:09 p.m., the Senate adjourned, under its order of today, until 11 a.m. tomorrow.","actionTimeStamp":"--"}]}