{"retrieved-date":"2023-5-24","actions-date":"Thursday, May 18, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, May 18)","actionItem":"S.Res. 209 (Sen. Hirono):\n        A resolution recognizing the significance of Asian American, Native Hawaiian, and Pacific Islander Heritage Month as an important time to celebrate the significant contributions of Asian Americans, Native Hawaiians, and Pacific Islanders to the history of the United States.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Resolution agreed to in Senate without amendment and an amended preamble by Unanimous Consent.\n \n\n S.Amdt. 90 (Sen. Hirono):\n        To amend the preamble.\n\n        --Amendment SA 90 proposed by Senator Hirono.\n\n        --Amendment SA 90 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 221 (Sen. Cardin):\n        A resolution promoting minority health awareness and supporting the goals and ideals of National Minority Health Month in April 2023, which include bringing attention to the health disparities faced by minority populations of the United States such as American Indians , Alaska Natives, Asian Americans, African Americans, Hispanics, and Native Hawaiians or other Pacific Islanders.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 222 (Sen. Carper):\n        A resolution expressing the approval of Congress for the 50th anniversary celebration of the homecoming of United States prisoners of war from Vietnam and in recognition of the extraordinary service and sacrifices of such prisoners of war during the Vietnam War.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, May 18)","actionItem":"PN95:\n        Nancy G. Abudu, of Georgia, to be United States Circuit Judge for the Eleventh Circuit\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 49 - 47. Record Vote Number: 132 \n\n\n\n PN219:\n        Nathan J. Powell, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN247:\n        41 nominations in the Marine Corps beginning with Ryan K. Aldrich and ending with Jeffrey W. Wong\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN249:\n        Steven M. Angeline, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN352:\n        Richard C. Eytel, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN479:\n        David Wagenborg, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN525:\n        James O. Samman, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN552:\n        Christine B. Olivares, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN553:\n        Gilberto Deleon, Jr., in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN554:\n        Bradley M. Mravik, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN555:\n        Justin L. Purvis, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN556:\n        John J. Adams, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN557:\n        Bradley B. Keller, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN558:\n        Nicholos B. Staiton, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN576:\n        Charles G. Emond, Jr., in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN597:\n        28 nominations in the Air Force beginning with Francisca A. Alaka Lampton and ending with Victoria M. Weiger\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN598:\n        51 nominations in the Air Force beginning with Britney M. Alonzo and ending with Justin Matthew Woods\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN600:\n        146 nominations in the Air Force beginning with Maria L. Adams and ending with Mitchell H. Yuan\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN601:\n        239 nominations in the Air Force beginning with Michael A. Adams II and ending with Phillip A. Zencey\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN610:\n        Paul M. Tobin, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN611:\n        207 nominations in the Army beginning with Jon P. Alexander and ending with Adam M. Zihar\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN612:\n        51 nominations in the Army beginning with David J. Adams and ending with Brian H. Young\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN613:\n        244 nominations in the Army beginning with Stefan E. Adamcik and ending with Andrew D. Zupfer\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN616:\n        6 nominations in the Army beginning with Tony B. Fears and ending with Michael S. Sharp\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN617:\n        Joseph P. Ball, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN618:\n        Mark J. Deal, in the Marine Corps, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN635:\n        Cassandra D. Thompson, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN636:\n        Arron J. Wilson, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN639:\n        2 nominations in the Air Force beginning with Thomas A. Biediger and ending with Ryan D. Nudi\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN640:\n        Ryan R. Pommier, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN641:\n        Sebastian A. Coates, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN642:\n        James M. Caldwell, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  3:52 p.m., the Senate adjourned, under its order of today, until  9:45 a.m. tomorrow.","actionTimeStamp":"--"}]}