{"retrieved-date":"2026-1-12","actions-date":"Thursday, January 8, 2026","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, January  8)","actionItem":"H.R. 6938 (Rep. Cole):\n        A bill making consolidated appropriations for the fiscal year ending September 30, 2026, and for other purposes.\n\n        -- Received in the Senate. Read the first time. Placed on Senate Legislative Calendar under Read the First Time. (Legislative Day January 7, 2026).\n\n        -- Read twice. Placed on Senate Legislative Calendar under General Orders. Calendar No. 299.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.\n\n\n S.Res. 577 (Sen. Schiff):\n        A resolution observing the 1-year anniversary of the 2025 Southern California wildfires.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 578 (Sen. Cantwell):\n        A resolution congratulating the University of Washington men's soccer team on winning the 2025 National Collegiate Athletic Association Division 1 Men's Soccer National Championship.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 579 (Sen. Cassidy):\n        A resolution affirming the importance of the Social Security program to the people of the United States and expressing the sense of the Senate that Social Security must be preserved, protected, and strengthened for current and future generations.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 580 (Sen. Merkley):\n        A resolution directing the Architect of the Capitol to prominently display, in a publicly accessible location in the Senate wing of the United States Capitol, a plaque honoring the members of law enforcement responding on January 6, 2021, until the plaque can be placed in its permanent location.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, January  8)","actionItem":"PN615-2:\n        Alexander C. Van Hook, of Louisiana, to be United States District Judge for the Western District of Louisiana\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 40. Record Vote Number: 6","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Ms. Murkowski, at 4:29 p.m., the Senate adjourned, under its order of today, until  3 p.m. on Monday, January 12, 2026.","actionTimeStamp":"--"}]}