{"retrieved-date":"2024-9-24","actions-date":"Wednesday, September 18, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, September 18)","actionItem":"S. 1871 (Sen. Peters):\n        A bill to create intergovernmental coordination between State, local, Tribal, and territorial jurisdictions, and the Federal Government to combat United States reliance on the People's Republic of China and other covered countries for critical minerals and rare earth metals, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute withdrawn by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3288 (Sen. Peters):\n        In the nature of a substitute.\n\n        --Amendment SA 3288 proposed by Senator Hassan for Senator Peters.\n\n        --Amendment SA 3288 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 829 (Sen. Blumenthal):\n        A resolution designating October 8, 2024, as \"National Hydrogen and Fuel Cell Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, September 18)","actionItem":"PN1344:\n        Margaret L. Taylor, of Maryland, to be Legal Adviser of the Department of State\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 44. Record Vote Number: 246 \n\n\n\n PN1649:\n        Michelle Williams Court, of California, to be United States District Judge for the Central District of California\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 44. Record Vote Number: 244 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 49 - 44. Record Vote Number: 245","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Ms. Hassan, at  7:22 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}