{"retrieved-date":"2026-1-7","actions-date":"Monday, January 5, 2026","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Saturday, January 3, 2026,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Saturday, January 3, 2026, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, January  5)","actionItem":"S. 320 (Sen. Padilla):\n        A bill to authorize the Earthquake Hazards Reduction Act of 1977, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute as amended agreed to by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 4148 (Sen. Scott, of FL):\n        To control funding for the National Earthquake Hazards Reduction Program.\n\n        --Amendment SA 4148 proposed by Senator Marshall for Senator Scott FL.\n\n        --Amendment SA 4148 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 1626 (Sen. Murkowski):\n        A bill to reauthorize the National Landslide Preparedness Act, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee amendment as amended agreed to by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 4149 (Sen. Scott, of FL):\n        To include provisions relating to funding and deficit reduction.\n\n        --Amendment SA 4149 proposed by Senator Marshall for Senator Scott FL.\n\n        --Amendment SA 4149 agreed to in Senate by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Monday, January  5)","actionItem":"PN12-1:\n        Keith Bass, of Texas, to be an Assistant Secretary of Defense\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 35. Record Vote Number: 1","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  6:13 p.m, the Presiding Officer (Mr. Ricketts in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}