{"retrieved-date":"2023-11-8","actions-date":"Wed, 08 Nov 2023 14:51:20 -0500","actions-title":"House Floor Proceedings","actions-count":97,"actions-list":[{"index":1,"header":"On agreeing to the Ogles amendment (A010) Roll Call 627","actionItem":"Recorded vote pending.","actionTimeStamp":"Wed, 08 Nov 2023 14:51:20 -0500"},{"index":2,"header":"--","actionItem":"On agreeing to the Perry amendment; Failed by recorded vote: (Roll no. 626).","actionTimeStamp":"Wed, 08 Nov 2023 14:51:10 -0500"},{"index":3,"header":"--","actionItem":"On agreeing to the Harshbarger amendment; Failed by recorded vote: (Roll no. 625).","actionTimeStamp":"Wed, 08 Nov 2023 14:47:35 -0500"},{"index":4,"header":"--","actionItem":"On agreeing to the Grothman amendment; Failed by recorded vote: (Roll no. 624).","actionTimeStamp":"Wed, 08 Nov 2023 14:43:15 -0500"},{"index":5,"header":"--","actionItem":"On agreeing to the Molinaro amendment; Agreed to by recorded vote: (Roll no. 623).","actionTimeStamp":"Wed, 08 Nov 2023 14:38:17 -0500"},{"index":6,"header":"--","actionItem":"On agreeing to the Fitzgerald amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 08 Nov 2023 14:05:38 -0500"},{"index":7,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Fitzgerald amendment No. 49.","actionTimeStamp":"Wed, 08 Nov 2023 13:57:16 -0500"},{"index":8,"header":"--","actionItem":"An amendment, offered by Mr. Fitzgerald,  numbered 49 printed in Part B of House Report 118-269 to prohibit funding for the FTC to issue Unfair Competition rulemakings.","actionTimeStamp":"Wed, 08 Nov 2023 13:56:59 -0500"},{"index":9,"header":"--","actionItem":"On agreeing to the Fitzgerald amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 08 Nov 2023 13:56:17 -0500"},{"index":10,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Fitzgerald amendment No. 48.","actionTimeStamp":"Wed, 08 Nov 2023 13:52:36 -0500"},{"index":11,"header":"--","actionItem":"An amendment, offered by Mr. Fitzgerald,  numbered 48 printed in Part B of House Report 118-269 to repeal the subpoena authority of the Department of the Treasury's Federal Insurance Office and the Office of Financial Research.","actionTimeStamp":"Wed, 08 Nov 2023 13:52:13 -0500"},{"index":12,"header":"--","actionItem":"On agreeing to the Fischbach amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 08 Nov 2023 13:51:53 -0500"},{"index":13,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Fischbach amendment No. 47.","actionTimeStamp":"Wed, 08 Nov 2023 13:44:33 -0500"},{"index":14,"header":"--","actionItem":"An amendment, offered by Mrs. Fischbach,  numbered 47 printed in Part B of House Report 118-269 to prohibit funds from being used to regulate or require farmers disclose scope 3 emissions.","actionTimeStamp":"Wed, 08 Nov 2023 13:44:15 -0500"},{"index":15,"header":"--","actionItem":"On agreeing to the Emmer amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 08 Nov 2023 13:43:49 -0500"},{"index":16,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Emmer amendment No. 46.","actionTimeStamp":"Wed, 08 Nov 2023 13:36:01 -0500"},{"index":17,"header":"--","actionItem":"An amendment, offered by Mr. Emmer,  numbered 46 printed in Part B of House Report 118-269 to ensure none of the funds made available by this Act may be used by the Securities and Exchange Commission to carry out an enforcement action related to a crypto asset transaction.","actionTimeStamp":"Wed, 08 Nov 2023 13:35:44 -0500"},{"index":18,"header":"--","actionItem":"On agreeing to the Davidson amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 08 Nov 2023 13:35:20 -0500"},{"index":19,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Davidson amendment No. 45.","actionTimeStamp":"Wed, 08 Nov 2023 13:29:11 -0500"},{"index":20,"header":"--","actionItem":"An amendment, offered by Mr. Davidson,  numbered 45 printed in Part B of House Report 118-269 to ensure no funds are used to support an increase in the weight of the Chinese renminbi in the Special Drawing Rights basket of the International Monetary Fund.","actionTimeStamp":"Wed, 08 Nov 2023 13:28:50 -0500"},{"index":21,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Collins amendment No. 44, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Hoyer demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 08 Nov 2023 13:28:18 -0500"},{"index":22,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Collins amendment No. 44.","actionTimeStamp":"Wed, 08 Nov 2023 13:22:08 -0500"},{"index":23,"header":"--","actionItem":"An amendment, offered by Mr. Collins,  numbered 44 printed in Part B of House Report 118-269 to prohibit funding for the Office of the Vice President.","actionTimeStamp":"Wed, 08 Nov 2023 13:21:46 -0500"},{"index":24,"header":"--","actionItem":"On agreeing to the Cammack amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 08 Nov 2023 13:21:18 -0500"},{"index":25,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Cammack amendment No. 43.","actionTimeStamp":"Wed, 08 Nov 2023 13:13:29 -0500"},{"index":26,"header":"--","actionItem":"An amendment, offered by Mrs. Cammack,  numbered 43 printed in Part B of House Report 118-269 to prohibit funds from being used to finalize any rule or regulation that has resulted in or is likely to result in an annual effect on the economy of $100 million or more.","actionTimeStamp":"Wed, 08 Nov 2023 13:13:13 -0500"},{"index":27,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Burchett amendment No. 42, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Hoyer demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 08 Nov 2023 13:12:48 -0500"},{"index":28,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Burchett amendment No. 42.","actionTimeStamp":"Wed, 08 Nov 2023 13:06:11 -0500"},{"index":29,"header":"--","actionItem":"An amendment, offered by Mr. Burchett,  numbered 42 printed in Part B of House Report 118-269 to reduce the salary of Securities and Exchange Commission chairman Gary Gensler to $1.","actionTimeStamp":"Wed, 08 Nov 2023 13:05:50 -0500"},{"index":30,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 08 Nov 2023 13:05:25 -0500"},{"index":31,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 41.","actionTimeStamp":"Wed, 08 Nov 2023 12:55:36 -0500"},{"index":32,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 41 printed in Part B of House Report 118-269 to prohibit performance awards or bonuses for senior executive service employees at the Internal Revenue Service (IRS).","actionTimeStamp":"Wed, 08 Nov 2023 12:55:17 -0500"},{"index":33,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 08 Nov 2023 12:55:02 -0500"},{"index":34,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 40.","actionTimeStamp":"Wed, 08 Nov 2023 12:46:02 -0500"},{"index":35,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 40 printed in Part B of House Report 118-269 to prohibit funds in this act from being used for financial assistance in contravention of section 642 (a) of the Illegal Immigration Reform and Immigrant Responsibility Act.","actionTimeStamp":"Wed, 08 Nov 2023 12:45:44 -0500"},{"index":36,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Bean (FL) amendment No. 39, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Hoyer demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 08 Nov 2023 12:45:22 -0500"},{"index":37,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Bean (FL) amendment No. 39.","actionTimeStamp":"Wed, 08 Nov 2023 12:34:33 -0500"},{"index":38,"header":"--","actionItem":"An amendment, offered by Mr. Bean (FL),  numbered 39 printed in Part B of House Report 118-269 to prohibit the Small Business Administration from implementing the CA SBLC program.","actionTimeStamp":"Wed, 08 Nov 2023 12:34:05 -0500"},{"index":39,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Barr amendment No. 38, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Hoyer demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 08 Nov 2023 12:33:46 -0500"},{"index":40,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Barr amendment No. 38.","actionTimeStamp":"Wed, 08 Nov 2023 12:26:12 -0500"},{"index":41,"header":"--","actionItem":"An amendment, offered by Mr. Barr,  numbered 38 printed in Part B of House Report 118-269 to ensure that none of the funds made available by this Act may be used to implement, administer, or enforce Executive Order 14008 titled \"Tackling the Climate Crisis at Home and Abroad\" (January 27, 2021) or any rule or regulation to implement such Order.","actionTimeStamp":"Wed, 08 Nov 2023 12:25:31 -0500"},{"index":42,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Barr amendment No. 37, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Barr demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 08 Nov 2023 12:25:11 -0500"},{"index":43,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Barr amendment No. 37.","actionTimeStamp":"Wed, 08 Nov 2023 12:14:12 -0500"},{"index":44,"header":"--","actionItem":"An amendment, offered by Mr. Barr,  numbered 37 printed in Part B of House Report 118-269 to ensure that none of the funds appropriated or otherwise made available by this Act may be made available to implement or enforce General License No. 8H, issued by the Office of Foreign Assets Control on October 25, 2023.","actionTimeStamp":"Wed, 08 Nov 2023 12:13:49 -0500"},{"index":45,"header":"--","actionItem":"On agreeing to the Schweikert amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 08 Nov 2023 12:12:52 -0500"},{"index":46,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Schweikert amendment No. 30.","actionTimeStamp":"Wed, 08 Nov 2023 12:05:03 -0500"},{"index":47,"header":"--","actionItem":"An amendment, offered by Mr. Schweikert,  numbered 30 printed in Part B of House Report 118-269 to increase and decrease funding for the Small Business Administration's Office of the Inspector General by $1 million to provide Congress a report on the estimated fiscal impact of selling off delinquent loans within the COVID-19 portfolio to third parties and a cost-benefit analysis of not pursuing aggressive loan recollection efforts to recoup the estimated $33.4 billion in either past due, delinquent, in liquidation or charged off EIDL loans.","actionTimeStamp":"Wed, 08 Nov 2023 12:04:57 -0500"},{"index":48,"header":"--","actionItem":"On agreeing to the Burlison amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 08 Nov 2023 12:04:11 -0500"},{"index":49,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Burlison amendment No. 27.","actionTimeStamp":"Wed, 08 Nov 2023 12:00:52 -0500"},{"index":50,"header":"--","actionItem":"An amendment, offered by Mr. Burlison,  numbered 27 printed in Part B of House Report 118-269 to increases and decrease funding for the Office of Personnel Management by $20,000 to provide for the renewal of a security clearance for Unidentified Aerial Phenomena (UAP) whistleblower David Grusch.","actionTimeStamp":"Wed, 08 Nov 2023 12:00:29 -0500"},{"index":51,"header":"--","actionItem":"On agreeing to the Brecheen amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 08 Nov 2023 12:00:07 -0500"},{"index":52,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Brecheen amendment No. 26.","actionTimeStamp":"Wed, 08 Nov 2023 11:50:09 -0500"},{"index":53,"header":"--","actionItem":"An amendment, offered by Mr. Brecheen,  numbered 26 printed in Part B of House Report 118-269 to reduce funding for the General Services Administration's Real Property Activities to FY19 levels.","actionTimeStamp":"Wed, 08 Nov 2023 11:49:56 -0500"},{"index":54,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Perry amendment No. 24, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Hoyer demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 08 Nov 2023 11:49:29 -0500"},{"index":55,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 24.","actionTimeStamp":"Wed, 08 Nov 2023 11:39:23 -0500"},{"index":56,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 24 printed in Part B of House Report 118-269 to reduce the Salaries and Expenses of the Federal Trade Commission to FY19 levels.","actionTimeStamp":"Wed, 08 Nov 2023 11:39:09 -0500"},{"index":57,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Ogles amendment No. 21, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Hoyer demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 08 Nov 2023 11:36:19 -0500"},{"index":58,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 21.","actionTimeStamp":"Wed, 08 Nov 2023 11:27:33 -0500"},{"index":59,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 21 printed in Part B of House Report 118-269 to reduce funding for Consumer Product Safety Commission to FY 2019 level.","actionTimeStamp":"Wed, 08 Nov 2023 11:27:05 -0500"},{"index":60,"header":"--","actionItem":"On agreeing to the Ramirez amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 08 Nov 2023 11:26:45 -0500"},{"index":61,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Ramirez amendment No. 19.","actionTimeStamp":"Wed, 08 Nov 2023 11:21:11 -0500"},{"index":62,"header":"--","actionItem":"An amendment, offered by Mrs. Ramirez,  numbered 19 printed in Part B of House Report 118-269 to increase and decrease funding for the Consumer Financial Protection Bureau by $635,000,000.","actionTimeStamp":"Wed, 08 Nov 2023 11:20:55 -0500"},{"index":63,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Perry amendment No. 18, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Hoyer demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 08 Nov 2023 11:20:34 -0500"},{"index":64,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 18.","actionTimeStamp":"Wed, 08 Nov 2023 11:09:16 -0500"},{"index":65,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 18 printed in Part B of House Report 118-269 to reduce funding for the Consumer Financial Protection Bureau to $0.","actionTimeStamp":"Wed, 08 Nov 2023 11:08:45 -0500"},{"index":66,"header":"--","actionItem":"On agreeing to the Davidson amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 08 Nov 2023 11:08:29 -0500"},{"index":67,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Davidson amendment No. 16.","actionTimeStamp":"Wed, 08 Nov 2023 10:59:04 -0500"},{"index":68,"header":"--","actionItem":"An amendment, offered by Mr. Davidson,  numbered 16 printed in Part B of House Report 118-269 to prohibit funding for the Treasury Department to design or develop a Central Bank Digital Currency, or establish a United States Central Bank Digital Currency as legal tender.","actionTimeStamp":"Wed, 08 Nov 2023 10:58:52 -0500"},{"index":69,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Harshbarger amendment No. 15, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Ms. Harshbarger demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 08 Nov 2023 10:58:15 -0500"},{"index":70,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Harshbarger amendment No. 15.","actionTimeStamp":"Wed, 08 Nov 2023 10:51:43 -0500"},{"index":71,"header":"--","actionItem":"An amendment, offered by Mrs. Harshbarger,  numbered 15 printed in Part B of House Report 118-269 to strike funding for firearms and ammunition for the Internal Revenue Service.","actionTimeStamp":"Wed, 08 Nov 2023 10:51:12 -0500"},{"index":72,"header":"--","actionItem":"On agreeing to the Bice amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 08 Nov 2023 10:50:57 -0500"},{"index":73,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Bice amendment No. 12.","actionTimeStamp":"Wed, 08 Nov 2023 10:41:03 -0500"},{"index":74,"header":"--","actionItem":"An amendment, offered by Mrs. Bice,  numbered 12 printed in Part B of House Report 118-269 to increase and decrease funding for the Internal Revenue Service by $5,000 with the intent to direct the agency to provide Congress with the quantity and types(s) of: weapons, weapons systems, ammunition, explosive devices, armored vehicles, drones/UAVs, and chemical weapons such as tear gas and calming agents in their possession.","actionTimeStamp":"Wed, 08 Nov 2023 10:40:19 -0500"},{"index":75,"header":"--","actionItem":"On agreeing to the Schweikert amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 08 Nov 2023 10:40:07 -0500"},{"index":76,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Schweikert amendment No. 11.","actionTimeStamp":"Wed, 08 Nov 2023 10:35:52 -0500"},{"index":77,"header":"--","actionItem":"An amendment, offered by Mr. Schweikert,  numbered 11 printed in Part B of House Report 118-269 to increase and decrease funding, by $1 million, for the United States Postal Service Inspector General, to instruct the Postal Service IG to provide Congress with the operating expenses and annual revenue for each post office location for the last five years.","actionTimeStamp":"Wed, 08 Nov 2023 10:35:36 -0500"},{"index":78,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Grothman amendment No. 9, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Grothman demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 08 Nov 2023 10:34:55 -0500"},{"index":79,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Grothman amendment No. 9.","actionTimeStamp":"Wed, 08 Nov 2023 10:29:08 -0500"},{"index":80,"header":"--","actionItem":"An amendment, offered by Mr. Grothman,  numbered 9 printed in Part B of House Report 118-269 to eliminate funding for the Department of Treasury's Community Development Financial Institutions Fund.","actionTimeStamp":"Wed, 08 Nov 2023 10:28:29 -0500"},{"index":81,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Molinaro amendment No. 2, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Molinaro demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 08 Nov 2023 10:28:00 -0500"},{"index":82,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 10 minutes of debate on the Molinaro amendment No. 2.","actionTimeStamp":"Wed, 08 Nov 2023 10:25:24 -0500"},{"index":83,"header":"--","actionItem":"An amendment, offered by Mr. Molinaro,  numbered 2 printed in Part B of House Report 118-269 to increase and decrease funding by $21 million for the Committee on Foreign Investment in the United States to encourage the Committee to evaluate the rising threat of farmland owned by adversarial nations.","actionTimeStamp":"Wed, 08 Nov 2023 10:25:02 -0500"},{"index":84,"header":"--","actionItem":"On agreeing to the Womack amendments; Agreed to by voice vote.","actionTimeStamp":"Wed, 08 Nov 2023 10:24:32 -0500"},{"index":85,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 847, the Committee of the Whole proceeded with 20 minutes of debate on the Womack amendment en bloc.","actionTimeStamp":"Wed, 08 Nov 2023 10:18:17 -0500"},{"index":86,"header":"--","actionItem":"Amendments en bloc  offered by Mr. Womack,  comprised of the following amendments printed in Part B of House Report 118-269 as en bloc: Nos. 1, 3, 4, 5, 6, 7, 8, 10, 13, 14, 17, 20, 22, 23, 29, 33, 34, 36, 66, 67, 71, and 75.","actionTimeStamp":"Wed, 08 Nov 2023 10:17:34 -0500"},{"index":87,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 4664.","actionTimeStamp":"Wed, 08 Nov 2023 09:12:49 -0500"},{"index":88,"header":"--","actionItem":"The Speaker designated the Honorable Brandon Williams to act as Chairman of the Committee.","actionTimeStamp":"Wed, 08 Nov 2023 09:12:16 -0500"},{"index":89,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 847 and Rule XVIII.","actionTimeStamp":"Wed, 08 Nov 2023 09:12:14 -0500"},{"index":90,"header":"--","actionItem":"Rule provides for consideration of H.R. 4664. The resolution provides for consideration of H.R. 4664 under a structured rule with one hour of general debate, with one motion to recommit.","actionTimeStamp":"Wed, 08 Nov 2023 09:11:42 -0500"},{"index":91,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 847. H.R. 4664 — \"Making appropriations for financial services and general government for the fiscal year ending September 30, 2024, and for other purposes.\"","actionTimeStamp":"Wed, 08 Nov 2023 09:11:37 -0500"},{"index":92,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair would be limited to 5 per side of the aisle.","actionTimeStamp":"Wed, 08 Nov 2023 09:02:31 -0500"},{"index":93,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Thompson of PA to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 08 Nov 2023 09:02:07 -0500"},{"index":94,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 08 Nov 2023 09:02:01 -0500"},{"index":95,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Wed, 08 Nov 2023 09:00:29 -0500"},{"index":96,"header":"--","actionItem":"The Speaker designated the Honorable Brandon Williams to act as Speaker pro tempore for today.","actionTimeStamp":"Wed, 08 Nov 2023 09:00:18 -0500"},{"index":97,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 08 Nov 2023 09:00:00 -0500"}]}