{"retrieved-date":"2026-1-28","actions-date":"Tuesday, January 27, 2026","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, January 27)","actionItem":"H.R. 7148 (Rep. Cole):\n        A bill making further consolidated appropriations for the fiscal year ending September 30, 2026, and for other purposes .\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.\n\n\n S. 3627 (Sen. Moody):\n        A bill to require institutions of higher education to disseminate information on the rights of, and accommodations and resources for, pregnant students, and for other purposes .\n\n        -- Cloture on the motion to proceed to the measure not invoked in Senate by Yea-Nay Vote. 47 - 45. Record Vote Number: 12 \n\n\n\n S. 3705 (Sen. Tillis):\n        A bill to provide for the creation of a congressional time capsule in commemoration of the semiquincentennial of the United States, and for other purposes.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.\n\n\n S.Res. 589 (Sen. Daines):\n        A resolution congratulating the Montana State University football team for winning the 2025 Division I Football Championship Subdivision Championship.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  6:30 p.m., the Senate adjourned, under its order of today, until 11 a.m. tomorrow.","actionTimeStamp":"--"}]}