{"retrieved-date":"2023-2-16","actions-date":"Wednesday, February 15, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, February 15)","actionItem":"S.Res. 49 (Sen. Hawley):\n        A resolution expressing the sense of the Senate that the Chinese Communist Party's espionage mission to send a surveillance balloon across the United States, in violation of international law, is unacceptable and should be condemned.\n\n        -- Senate Committee on Armed Services discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 59 (Sen. Klobuchar):\n        An original resolution authorizing expenditures by committees of the Senate for the periods March 1, 2023, through September 30, 2023, October 1, 2023, through September 30, 2024, and October 1, 2024, through February 28, 2025.\n\n        -- Resolution agreed to in Senate without amendment by Unanimous Consent.\n\n\n S.Res. 66 (Sen. Tester):\n        A resolution condemning the use by the People's Republic of China of a high-altitude surveillance balloon over the territory of the United States as a brazen violation of United States sovereignty.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 67 (Sen. Kaine):\n        A resolution supporting the goals and ideals of \"Career and Technical Education Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 68 (Sen. Klobuchar):\n        A resolution designating the week of February 11 through February 18, 2023, as \"National Entrepreneurship Week\" to recognize the importance and contributions of entrepreneurs and startups to the economic prosperity of the United States and the well-being of every community across the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 69 (Sen. Young):\n        A resolution expressing support for the designation of February 18 through February 25, 2023, as \"National FFA Week\", recognizing the important role of the National FFA Organization in developing the next generation of globally conscious leaders who will change the world and in celebration of the 95th anniversary of the National FFA Organization.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 70 (Sen. Ernst):\n        A resolution expressing support for the designation of February 1, 2023, as \"George Washington Carver Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, February 15)","actionItem":"PN3:\n        Lester Martinez-Lopez, of Florida, to be an Assistant Secretary of Defense\n\n        -- By unanimous consent agreement, vote 2/15/2023.\n\n        -- By unanimous consent agreement, vote 2/16/2023.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 64 - 33. Record Vote Number: 21 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate 2/16/2023.\n\n\n PN71:\n        Adrienne C. Nelson, of Oregon, to be United States District Judge for the District of Oregon\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 46. Record Vote Number: 17 \n\n\n\n PN73:\n        Daniel J. Calabretta, of California, to be United States District Judge for the Eastern District of California\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 46. Record Vote Number: 19 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, vote 2/16/2023.\n\n\n PN80:\n        Ana C. Reyes, of the District of Columbia, to be United States District Judge for the District of Columbia\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 47. Record Vote Number: 18 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, vote 2/15/2023.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 47. Record Vote Number: 20","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Ms. Cantwell, at 6:19 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}