{"retrieved-date":"2025-7-15","actions-date":"Thursday, July 10, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, July 10)","actionItem":"H.R. 517 (Rep. Kustoff):\n        A bill to amend the Internal Revenue Code of 1986 to modify the rules for postponing certain deadlines by reason of disaster.\n\n        -- Senate Committee on Finance discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 315 (Sen. Cortez Masto):\n        A resolution expressing support for the designation of July 10, 2025, as Journeyman Lineworkers Recognition Day.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 319 (Sen. Daines):\n        A resolution recognizing and celebrating 100 years of quantum mechanics.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, July 10)","actionItem":"PN22-26:\n        Anthony Tata, of Florida, to be Under Secretary of Defense for Personnel and Readiness\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN25-15:\n        Jonathan Gould, of Virginia, to be Comptroller of the Currency for a term of five years\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 45. Record Vote Number: 381 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 45. Record Vote Number: 383 \n\n\n\n PN25-39:\n        Luke Pettit, of the District of Columbia, to be an Assistant Secretary of the Treasury\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN26-15:\n        Joseph Edlow, of Maryland, to be Director of United States Citizenship and Immigration Services, Department of Homeland Security\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN150-3:\n        Whitney D. Hermandorfer, of Tennessee, to be United States Circuit Judge for the Sixth Circuit\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 43. Record Vote Number: 382 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, vote 7/14/2025.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  2:41 p.m., the Senate adjourned, under its order of today, until  3 p.m. on Monday, July 14, 2025.","actionTimeStamp":"--"}]}