{"retrieved-date":"2025-2-27","actions-date":"Thu, 27 Feb 2025 11:17:14 -0500","actions-title":"House Floor Proceedings","actions-count":17,"actions-list":[{"index":1,"header":"SPECIAL ORDER SPEECHES","actionItem":"The House has concluded all anticipated legislative business and has proceeded to Special Order speeches.","actionTimeStamp":"Thu, 27 Feb 2025 11:17:14 -0500"},{"index":2,"header":"The Speaker laid before the House a message from the President transmitting a notification stating that the national emergency declared in Executive Order 13660 of March 6, 2014 with respect to Ukraine, which was expanded in scope in Executive Order 13661, Executive Order 13662, and Executive Order 14065, and under which additional steps were taken in Executive Order 13685 and Executive Order 13849, is to continue in effect beyond March 6, 2025","actionItem":"referred to the Committee on Foreign Affairs and ordered to be printed (H. Doc. 119-22).","actionTimeStamp":"Thu, 27 Feb 2025 11:15:08 -0500"},{"index":3,"header":"The Speaker laid before the House a message from the President transmitting a notification stating that the national emergency declared in Executive Order 13692 of March 8, 2015, with respect to the situation in Venezuela is to continue in effect beyond March 8, 2025","actionItem":"referred to the Committee on Foreign Affairs and ordered to be printed (H. Doc. 119-21).","actionTimeStamp":"Thu, 27 Feb 2025 11:13:49 -0500"},{"index":4,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with further one minute speeches.","actionTimeStamp":"Thu, 27 Feb 2025 10:31:25 -0500"},{"index":5,"header":"--","actionItem":"Mr. Jack asked unanimous consent That, when the House adjourns on Thursday, February 27, 2025, it adjourn to meet on Monday, March 3, 2025, at noon for morning-hour debate and 2:00 p.m. for legislative business. Agreed to without objection.","actionTimeStamp":"Thu, 27 Feb 2025 10:29:50 -0500"},{"index":6,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Thu, 27 Feb 2025 10:29:13 -0500"},{"index":7,"header":"On passage Passed by the Yeas and Nays: 221","actionItem":"198, 2 Present (Roll no. 53).","actionTimeStamp":"Thu, 27 Feb 2025 10:29:11 -0500"},{"index":8,"header":"--","actionItem":"The previous question was ordered pursuant to the rule.","actionTimeStamp":"Thu, 27 Feb 2025 09:51:31 -0500"},{"index":9,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H.J. Res. 20.","actionTimeStamp":"Thu, 27 Feb 2025 09:13:50 -0500"},{"index":10,"header":"--","actionItem":"Rule provides for consideration of H.J. Res. 20, H.J. Res. 35 and H. Con. Res. 14. The resolution provides for consideration of two joint resolutions, H.J. Res. 20, under a closed rule and H.J. Res. 35, under a closed rule. Also, the resolution provides for consideration of H. Con. Res. 14, under a closed rule. The joint resolutions are debated for one hour each and the concurrent resolution is debated for 3 hours.","actionTimeStamp":"Thu, 27 Feb 2025 09:13:03 -0500"},{"index":11,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 161. H.J. Res. 20 — \"Providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Department of Energy relating to \"Energy Conservation Program: Energy Conservation Standards for Consumer Gas-fired Instantaneous Water Heaters\".\"","actionTimeStamp":"Thu, 27 Feb 2025 09:12:58 -0500"},{"index":12,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair would be limited to 5 per side of the aisle.","actionTimeStamp":"Thu, 27 Feb 2025 09:02:45 -0500"},{"index":13,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Carey to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 27 Feb 2025 09:02:23 -0500"},{"index":14,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Thu, 27 Feb 2025 09:02:20 -0500"},{"index":15,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Thu, 27 Feb 2025 09:00:45 -0500"},{"index":16,"header":"--","actionItem":"The Speaker designated the Honorable Tom McClintock to act as Speaker pro tempore for today.","actionTimeStamp":"Thu, 27 Feb 2025 09:00:29 -0500"},{"index":17,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 27 Feb 2025 09:00:00 -0500"}]}