{"retrieved-date":"2025-12-5","actions-date":"Wednesday, December 3, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, December  3)","actionItem":"S.J.Res. 91 (Sen. Murkowski):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Bureau of Land Management relating to \"Coastal Plain Oil and Gas Leasing Program Record of Decision\".\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 49 - 47. Record Vote Number: 630 \n\n\n        -- Measure laid before Senate by motion.\n\n\n S.Res. 516 (Sen. Husted):\n        A resolution ensuring that the adoption and foster care system in the United States is child-centered and compassionate and that young people aging out of foster care are provided with adequate support and resources to transition successfully to independent adulthood.\n\n        -- Senate Committee on Health, Education, Labor, and Pensions discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 518 (Sen. Smith):\n        A resolution designating October 2025 as \"National Principals Month\".\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 527 (Sen. Blumenthal):\n        A resolution supporting the goals and ideals of a National Move Over Law Day.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 528 (Sen. Smith):\n        A resolution supporting after-school programs and Lights On Afterschool, a national celebration of after-school programs held on October 23, 2025.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, December  3)","actionItem":"PN520-3:\n        Matthew E. Orso, of North Carolina, to be United States District Judge for the Western District of North Carolina\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 56 - 40. Record Vote Number: 628 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 57 - 41. Record Vote Number: 629 \n\n\n\n PN520-4:\n        Susan Courtwright Rodriguez, of North Carolina, to be United States District Judge for the Western District of North Carolina\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 63 - 34. Record Vote Number: 631 \n\n\n        -- By unanimous consent agreement, vote 12/4/2025.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  6:43 p.m, the Presiding Officer (Mr. Justice in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}