{"retrieved-date":"2022-11-22","actions-date":"Thursday, November 17, 2022","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday,the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, November 17)","actionItem":"H.R. 521 (Rep. Connolly):\n        A bill to permit disabled law enforcement officers, customs and border protection officers, firefighters, air traffic controllers, nuclear materials couriers, members of the Capitol Police, members of the Supreme Court Police, employees of the Central Intelligence Agency performing intelligence activities abroad or having specialized security requirements, and diplomatic security special agents of the Department of State to receive retirement benefits in the same manner as ifthey had not been disabled.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 1437 (Rep. Sherrill):\n        A bill to amend the Weather Research and Forecasting Innovation Act of 2017 to direct the National Oceanic and Atmospheric Administration to provide comprehensive and regularly updated Federal precipitation information, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6485 (Sen. Wicker):\n        In the nature of a substitute.\n\n        --Amendment SA 6485 proposed by Senator Schumer for Senator Wicker.\n\n        --Amendment SA 6485 agreed to in Senate by Unanimous Consent.\n\n\n\n\n H.R. 7132 (Rep. Kuster):\n        A bill to preserve safe access to communications services for survivors of domestic violence and other crimes, and for otherpurposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 8404 (Rep. Nadler):\n        A bill to repeal the Defense of Marriage Act and ensure respect for State regulation of marriage, and for other purposes.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 53 - 23. Record Vote Number: 357 \n\n\n        -- Measure laid before Senate by motion.\n\n        -- Motion by Senator Schumer to refer to Senate Committee on the Judiciary with instructions to report back forthwith with the following amendment (SA6490) made in Senate.\n\n        -- Cloture motion on the measure presented in Senate.\n \n\n S.Amdt. 6487 (Sen. Baldwin):\n        In the nature of a substitute.\n\n        --Amendment SA 6487 proposed by Senator Schumer for Senator Baldwin.\n\n        --Cloture motion on amendment SA 6487 presented in Senate.\n\n\n S.Amdt. 6488 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 6488 proposed by Senator Schumer to Amendment SA 6487.\n\n\n S.Amdt. 6489 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 6489 proposed by Senator Schumer to Amendment SA 6488.\n\n\n S.Amdt. 6490 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 6490 proposed by Senator Schumer.\n\n\n S.Amdt. 6491 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 6491 proposed by Senator Schumer to Amendment SA 6490 (the instructions of the motion to refer).\n\n\n S.Amdt. 6492 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 6492 proposed by Senator Schumer to Amendment SA 6491.\n\n\n\n\n S. 7 (Sen. Hirono):\n        A bill to make a technical amendment to the Violence Against Women Act of 1994, and for other purposes.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.\n\n\n S. 1725 (Sen. Rounds):\n        A bill to grant a Federal charter to the National American Indian Veterans, Incorporated.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 3092 (Sen. Padilla):\n        A bill to amend the Robert T. Stafford Disaster Relief and Emergency Assistance Act to improve the provision of certain disaster assistance, and for other purposes.\n\n        -- Message on House action received in Senate and at desk: House amendment to Senate bill.\n\n\n S.Res. 800 (Sen. Hyde-Smith):\n        A resolution celebrating the 100th anniversary of the Mississippi Farm Bureau Federation.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Resolution agreed to in Senate without amendment and an amended preamble byUnanimous Consent.\n \n\n S.Amdt. 6484 (Sen. Hyde-Smith):\n        To amend the preamble.\n\n        --Amendment SA 6484 proposed by Senator Schumer for Senator Hyde-Smith.\n\n        --Amendment SA 6484 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 801 (Sen. Hirono):\n        A resolution recognizing the 50th anniversary of the establishment of Hanalei National Wildlife Refuge and Pearl Harbor National Wildlife Refuge in the State of Hawaii.\n\n        -- Senate Committee on Environment and Public Works discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 839 (Sen. Young):\n        A resolution expressing support for the goals of Stomach Cancer Awareness Month.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 840 (Sen. Smith):\n        A resolution supporting afterschool programs and Lights On Afterschool, a national celebration of afterschool programs held on October 20, 2022.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 841 (Sen. Smith):\n        A resolution recognizing October 2022 as \"NationalPrincipals Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 842 (Sen. Shaheen):\n        A resolution supporting the goals and ideals of American Diabetes Month.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 843 (Sen. Padilla):\n        A resolution expressing support for the designation of the week beginning on November 7, 2022 as \"National School Psychology Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 844 (Sen. Cornyn):\n        A resolution congratulating the Houston Astros forwinning the 2022 Major League Baseball World Series.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 845 (Sen. Schatz):\n        A resolution recognizing National Native American Heritage Month and celebrating the heritages and cultures of Native Americans and the contributions of Native Americans to the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 846 (Sen. Coons):\n        A resolution designating November 2022 as \"National College Application Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 847 (Sen. Baldwin):\n        A resolution recognizing the 1-year anniversary ofthe tragic attack at the Waukesha Christmas Parade on November 21, 2021, and honoring the 6 individuals who lost their lives and the 62 others who were injured.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 848 (Sen. Grassley):\n        A resolution designating the week beginning October 16, 2022, as \"National Character Counts Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, November 17)","actionItem":"PN1860:\n        Rheanne Wirkkala, of Maryland, to be an Assistant Secretary of Defense\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2143:\n        Anne M. Nardacci, of New York, to be United StatesDistrict Judge for the Northern District of New York\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN2264:\n        Camille L. Velez-Rive, of Puerto Rico, to be United States District Judge for the District of Puerto Rico\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at 12:01 a.m, the Presiding Officer (Ms. Klobuchar in the chair) declared the Senate adjourned, under its order of today, until  5:30 p.m. on Tuesday, November 22, 2022.","actionTimeStamp":"--"}]}