{"retrieved-date":"2025-3-7","actions-date":"Thursday, March 6, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, March  6)","actionItem":"S. 331 (Sen. Cassidy):\n        A bill to amend the Controlled Substances Act with respect to the scheduling of fentanyl-related substances, and for other purposes.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Cloture on the motion to proceed to the measure invoked in Senate by Yea-Nay Vote. 82 - 12. Record Vote Number: 110 \n\n\n\n S.Res. 117 (Sen. McConnell):\n        A resolution providing for members on the part of the Senate of the Joint Committee on Printing and the Joint Committee of Congress on the Library.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.\n\n\n S.Res. 118 (Sen. Scott, of FL):\n        A resolution designating March 6, 2025, as \"National Slam the Scam Day\" to raise awareness about pervasive scams and to promote education to prevent government imposter scams and other types of scams.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, March  6)","actionItem":"PN10:\n        Samuel B. Hafensteiner, in the Coast Guard, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN11-4:\n        Lori Chavez-DeRemer, of Oregon, to be Secretary of Labor\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 66 - 30. Record Vote Number: 109 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate and vote 3/10/2025.\n\n\n PN12-14:\n        Troy Edgar, of California, to be Deputy Secretary of Homeland Security\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 43. Record Vote Number: 107 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 43. Record Vote Number: 108 \n\n\n\n PN12-41:\n        Abigail Slater, of the District of Columbia, to be an Assistant Attorney General\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN13-2:\n        Steven Bradbury, of Virginia, to be Deputy Secretary of Transportation\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  4:31 p.m., the Senate adjourned, under its order of today, until  3 p.m. on Monday, March 10, 2025.","actionTimeStamp":"--"}]}