{"retrieved-date":"2023-11-2","actions-date":"Tuesday, October 31, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, October 31)","actionItem":"H.R. 4366 (Rep. Carter):\n        A bill making appropriations for military construction, the Department of Veterans Affairs, and related agencies for the fiscal year ending September 30, 2024, and for other purposes.\n\n        -- Considered by Senate.\n \n\n S.Amdt. 1092 (Sen. Murray):\n        In the nature of a substitute.\n\n        --Considered by Senate.\n\n\n S.Amdt. 1177 (Sen. Ernst):\n        To require reporting regarding telework by employees of agencies funded under the Consolidated Appropriations Act, 2024.\n\n        --Amendment SA 1177 proposed by Senator Ernst to Amendment SA 1092.\n\n        --Amendment SA 1177 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1200 (Sen. Hawley):\n        To prohibit the use of funds for providing grants, funding, or any financial benefit to Chinese entities.\n\n        --Amendment SA 1200 proposed by Senator Hawley to Amendment SA 1092.\n\n        --Amendment SA 1200 agreed to in Senate by Yea-Nay Vote. 61 - 36. Record Vote Number: \n\n\n S.Amdt. 1243 (Sen. Budd):\n        To prohibit the use of funds to implement or enforce Executive Order 14019.\n\n        --Amendment SA 1243 proposed by Senator Budd to Amendment SA 1092.\n\n        --Amendment SA 1243 not agreed to in Senate by Yea-Nay Vote. 45 - 50. Record Vote Number: \n\n\n S.Amdt. 1296 (Sen. Cruz):\n        To prohibit using funds to pay the salary of an individual who was nominated to the position of Administrator of the National Highway Traffic Safety Administration and whose nomination was subsequently withdrawn.\n\n        --Amendment SA 1296 proposed by Senator Cruz to Amendment SA 1092.\n\n        --Amendment SA 1296 not agreed to in Senate by Yea-Nay Vote. 47 - 49. Record Vote Number: \n\n\n S.Amdt. 1349 (Sen. Blackburn):\n        To withhold Federal funding from the Department of Transportation for awarding any Federal assistance to entities from certain foreign countries for projects related to unmanned aircraft systems, and for other purposes.\n\n        --Amendment SA 1349 proposed by Senator Collins for Senator Blackburn to Amendment SA 1092.\n\n        --Amendment SA 1349 agreed to in Senate by Voice Vote.\n\n\n\n\n S. 447 (Sen. Hickenlooper):\n        A bill to establish a demonstration program for the active remediation of orbital debris and to require the development of uniform orbital debris standard practices in order to support a safe and sustainable orbital environment, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee amendment as amended agreed to by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 1358 (Sen. Hickenlooper):\n        In the nature of a substitute.\n\n        --Amendment SA 1358 proposed by Senator Schumer for Senator Hickenlooper.\n\n        --Amendment SA 1358 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 1648 (Sen. Schmitt):\n        A bill to facilitate access to the electromagnetic spectrum for commercial space launches and commercial space reentries, and for other purposes.\n\n        -- Passed Senate with amendments by Unanimous Consent.\n\n\n S.Res. 442 (Sen. Blackburn):\n        A resolution designating October 2023 as \"National Country Music Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 443 (Sen. Brown):\n        A resolution designating October 2023 as \"National Farm to School Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, October 31)","actionItem":"PN452:\n        Matthew James Maddox, of Maryland, to be United States District Judge for the District of Maryland\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 55 - 42. Record Vote Number: 274 \n\n\n\n PN877:\n        Gen. David W. Allvin, in the Air Force, to be General\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN881:\n        Lt. Gen. Christopher J. Mahoney, in the Marine Corps, to be General\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN882:\n        Adm. Lisa M. Franchetti, in the Navy, to be Admiral\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN1062:\n        Jacob J. Lew, of New York, to be Ambassador to the State of Israel\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 44. Record Vote Number: 275 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 43. Record Vote Number: 276","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  7:28 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}