{"retrieved-date":"2023-6-16","actions-date":"Fri, 16 Jun 2023 14:04:04 -0400","actions-title":"House Floor Proceedings","actions-count":11,"actions-list":[{"index":1,"header":"--","actionItem":"The Speaker announced that the House do now adjourn pursuant to a previous special order. The next meeting is scheduled for 12:00 p.m. on June 20, 2023.","actionTimeStamp":"Fri, 16 Jun 2023 14:04:04 -0400"},{"index":2,"header":"Canada-United States Interparliamentary Group","actionItem":"Pursuant to 22 U.S.C. 276d and the order of the House of January 9, 2023, the Speaker appointed the following members of the House to the Canada-United States Interparliamentary Group: Mr. Huizenga, Mr. Bergman, Mr. Stauber, Ms. Tenney, Mr. Finstad and Mr. Langworthy.","actionTimeStamp":"Fri, 16 Jun 2023 14:03:50 -0400"},{"index":3,"header":"Mexico-United States Interparliamentary Group","actionItem":"Pursuant to 22 U.S.C. 276h, and the order of the House of January 9, 2023, the Speaker appointed the following members of the House to the Mexico-United States Interparliamentary Group: Mr. McCaul, Mr. Valadao, Mr. Gimenez, Mr. Ciscomani and Ms. De La Cruz.","actionTimeStamp":"Fri, 16 Jun 2023 14:03:30 -0400"},{"index":4,"header":"British-American Interparliamentary Group","actionItem":"Pursuant to 22 U.S.C. 276/, and the order of the House of January 9, 2023, the Speaker appointed the following members of the House to the British-American Interparliamentary Group: Mr. Latta, Mr. Aderholt, Mr. Cole, Mr. Meuser, Mr. Smucker, Mrs. Kim of California and Mr. Kean of New Jersey.","actionTimeStamp":"Fri, 16 Jun 2023 14:03:00 -0400"},{"index":5,"header":"--","actionItem":"Board of Trustees of the American Folklife Center in the Library of Congress- Pursuant to 20 U.S.C. 2103(b), and the order of the House of January 9, 2023, the Speaker appointed Mrs. Heather Obernolte, Big Bear Lake, California (six year term).","actionTimeStamp":"Fri, 16 Jun 2023 14:02:24 -0400"},{"index":6,"header":"--","actionItem":"The House received a message from the Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Representatives, the Clerk received the following message from the Secretary of the Senate on June 15, 2023, at 3:16 p.m.: That the Senate agreed to: H. Con. Res. 43.","actionTimeStamp":"Fri, 16 Jun 2023 14:01:50 -0400"},{"index":7,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair led the House in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Fri, 16 Jun 2023 14:01:39 -0400"},{"index":8,"header":"--","actionItem":"The Speaker announced approval of the Journal. Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Fri, 16 Jun 2023 14:01:29 -0400"},{"index":9,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Fri, 16 Jun 2023 14:00:22 -0400"},{"index":10,"header":"--","actionItem":"The Speaker designated the Honorable Guy Reschenthaler to act as Speaker pro tempore for today.","actionTimeStamp":"Fri, 16 Jun 2023 14:00:03 -0400"},{"index":11,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Fri, 16 Jun 2023 14:00:00 -0400"}]}