{"retrieved-date":"2025-1-17","actions-date":"Wednesday, January 15, 2025","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, January 15)","actionItem":"S. 5 (Sen. Britt):\n        A bill to require the Secretary of Homeland Security to take into custody aliens who have been charged in the United States with theft, and for other purposes.\n\n        -- Considered by Senate.\n\n        -- Cloture motion on the measure presented in Senate.\n \n\n S.Amdt. 8 (Sen. Ernst):\n        To include crimes resulting in death or serious bodily injury to the list of offenses that, if committed by an inadmissible alien, require mandatory detention.\n\n        --Considered by Senate.\n\n\n S.Amdt. 14 (Sen. Cornyn):\n        To expand the list of criminal offenses that subject inadmissible aliens to mandatory detention.\n\n        --Amendment SA 14 proposed by Senator Cornyn to Amendment SA 8.\n\n        --Amendment SA 14 agreed to in Senate by Yea-Nay Vote. 70 - 25. Record Vote Number: \n\n\n S.Amdt. 23 (Sen. Coons):\n        To strike the section that authorizes State attorneys general to sue Federal immigration authorities for alleged violations relating to the detention of aliens.\n\n        --Amendment SA 23 proposed by Senator Coons.\n\n        --Amendment SA 23 not agreed to in Senate by Yea-Nay Vote. 46 - 49. Record Vote Number: \n\n\n\n\n S.Res. 27 (Sen. Hoeven):\n        A resolution congratulating the North Dakota State University Bison football team for winning the 2024 National Collegiate Athletic Association Division I Football Championship Subdivision title.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  7:09 p.m., the Senate adjourned, under its order of today, until 12 noon tomorrow.","actionTimeStamp":"--"}]}