{"retrieved-date":"2026-2-9","actions-date":"Thursday, February 5, 2026","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, February  5)","actionItem":"S.Res. 600 (Sen. Whitehouse):\n        A resolution recognizing January 2026 as \"National Mentoring Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 601 (Sen. Heinrich):\n        A resolution designating the week beginning February 2, 2026, as \"National Tribal Colleges and Universities Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Con.Res. 25 (Sen. Gillibrand):\n        A concurrent resolution recognizing the 15th anniversary of the January 8, 2011, Tucson, Arizona, shooting and honoring the survivors and victims, including former Congresswoman Gabby Giffords, a gun violence survivor and one of the most influential voices of courage in the United States in the fight to end gun violence.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, February  5)","actionItem":"PN621:\n        Vice Adm. Thomas G. Allan, Jr., in the Coast Guard, to be Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN675:\n        2 nominations in the Coast Guard beginning with Jarod M. Ross and ending with Andrew R. Younkle\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN676:\n        11 nominations in the Coast Guard beginning with Jonathan B. Bernhardt and ending with Ryan S. Townsend\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN677-1:\n        82 nominations in the Coast Guard beginning with Michael Adams and ending with Dewey W. Worker\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN682:\n        2 nominations in the Coast Guard beginning with Margaret A. Harward and ending with Jennifer A. Rogers\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN697:\n        2 nominations in the Coast Guard beginning with James M. Hurtt and ending with Kelli A. Knight\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN698:\n        Michelle J. Moravek, in the Coast Guard, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN726-4:\n        Daniel E. Burrows, of Colorado, to be an Assistant Attorney General\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN726-9:\n        Brian Charles Lea, of Tennessee, to be United States District Judge for the Western District of Tennessee\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 46. Record Vote Number: 30 \n\n\n\n PN726-11:\n        Justin R. Olson, of Indiana, to be United States District Judge for the Southern District of Indiana\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 47. Record Vote Number: 31 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 47. Record Vote Number: 32","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  2:54 p.m, the Presiding Officer (Mr. Moreno in the chair) declared the Senate adjourned, under its order of today, until  3 p.m. on Monday, February 9, 2026.","actionTimeStamp":"--"}]}