{"retrieved-date":"2022-12-5","actions-date":"Thursday, December 1, 2022","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, December  1)","actionItem":"H.R. 1193 (Rep. Barr):\n        To amend title IV of the Public Health Service Act to direct the Director of the National Institutes of Health, in consultation with the Director of the National Heart, Lung, and Blood Institute, to establish a program under which the Director of the National Institutes of Health shall support or conduct research on valvular heart disease, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute withdrawn by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6504 (Sen. McConnell):\n        In the nature of a substitute.\n\n        --Amendment SA 6504 proposed by Senator King for Senator McConnell.\n\n        --Amendment SA 6504 agreed to in Senate by Unanimous Consent.\n\n\n\n\n H.J.Res. 100 (Rep. Payne):\n        A joint resolution to provide for a resolution with respect to the unresolved disputes between certain railroads represented by the National Carriers' Conference Committee of the National Railway Labor Conference and certain of their employees.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate, under the order of 12/1/22, having achieved 60 votes in the affirmative, without amendment by Yea-Nay Vote. 80 - 15. Record Vote Number: 372 \n\n\n        -- Message on Senate action sent to the House.\n \n\n S.Amdt. 6503 (Sen. Sullivan):\n        In the nature of a substitute.\n\n        --Amendment SA 6503 proposed by Senator Sullivan.\n\n        --Amendment SA 6503, under the order of 12/1/22, not having achieved 60 votes in the affirmative, not agreed to in Senate by Yea-Nay Vote. 25 - 70. Record Vote Number: \n\n\n\n\n H.Con.Res. 119 (Rep. DeFazio):\n        A concurrent resolution providing for a correction in the enrollment of H.J. Res. 100.\n\n        -- Under the order of 12/1/22, not having achieved 60 votes in the affirmative , failed of passage in Senate by Yea-Nay Vote. 52 - 43. Record Vote Number: 371 \n\n\n        -- Message on Senate action sent to the House.\n\n\n S. 3662 (Sen. Peters):\n        A bill to temporarily increase the cost share authority for aqueous film forming foam input-based testing equipment, and for other purposes.\n\n        -- Senate agreed to the House amendment to S. 3662 by Unanimous Consent.\n\n\n S. 4052 (Sen. Portman):\n        A bill to reauthorize a program for early detection, diagnosis, and treatment regarding deaf and hard-of-hearing newborns, infants, and young children, and for other purposes.\n\n        -- Passed Senate with an amendment by Voice Vote.\n\n\n S. 4171 (Sen. Menendez):\n        A bill to reauthorize the Trafficking Victims Protection Act of 2000, and for other purposes.\n\n        -- Passed Senate with an amendment by Voice Vote.\n\n        -- Message on Senate action sent to the House.\n\n\n S.Res. 786 (Sen. Braun):\n        A resolution recognizing the history of women's professional baseball in Indiana.\n\n        -- Senate Committee on Commerce, Science, and Transportation discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 857 (Sen. Padilla):\n        A resolution congratulating the Los Angeles Football Club for winning the 2022 Major League Soccer Cup.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, December  1)","actionItem":"PN2192:\n        Doris L. Pryor, of Indiana, to be United States Circuit Judge for the Seventh Circuit\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 62 - 31. Record Vote Number: 369 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, vote 12/5/2022.\n\n\n PN2266:\n        Jerry W. Blackwell, of Minnesota, to be United States District Judge for the District of Minnesota\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 54 - 42. Record Vote Number: 368 \n\n\n        -- By unanimous consent agreement, vote to be determined.\n\n\n PN2314:\n        Frances Kay Behm, of Michigan, to be United States District Judge for the Eastern District of Michigan\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- By unanimous consent agreement, debate 12/5/2022.\n\n\n PN2365:\n        Kelley Brisbon Hodge, of Pennsylvania, to be United States District Judge for the Eastern District of Pennsylvania\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN2366:\n        Kai N. Scott, of Pennsylvania, to be United States District Judge for the Eastern District of Pennsylvania\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN2367:\n        Mia Roberts Perez, of Pennsylvania, to be United States District Judge for the Eastern District of Pennsylvania\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN2368:\n        John Frank Murphy, of Pennsylvania, to be United States District Judge for the Eastern District of Pennsylvania\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. King, at  5:11 p.m., the Senate adjourned, under its order of today, until  3 p.m. on Monday, December 5, 2022.","actionTimeStamp":"--"}]}