{"retrieved-date":"2023-12-7","actions-date":"Wednesday, December 6, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, December  6)","actionItem":"H.R. 815 (Rep. Rodgers):\n        A bill to amend title 38, United States Code, to make certain improvements relating to the eligibility of veterans to receive reimbursement for emergency treatment furnished through the Veterans Community Care program, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture on the motion to proceed to the measure not invoked in Senate by Yea-Nay Vote. 49 - 51. Record Vote Number: 332 \n\n\n        -- Motion by Senator Schumer to reconsider the vote by which cloture was not invoked on the motion to proceed to H.R. 815 (Record Vote No. 332) entered in Senate.\n\n\n S. 3250 (Sen. Cornyn):\n        A bill to provide remote access to court proceedings for victims of the 1988 Bombing of Pan Am Flight 103 over Lockerbie, Scotland.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 1372 (Sen. Cornyn):\n        To improve the bill.\n\n        --Amendment SA 1372 proposed by Senator Schatz for Senator Cornyn.\n\n        --Amendment SA 1372 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 445 (Sen. Blackburn):\n        A resolution recognizing the importance of the economic relationship between the United States and Israel and affirming that trade facilitated by the United States-Israel Free Trade Agreement is a tool to support the economy of Israel during the conflict with Hamas.\n\n        -- Senate Committee on Finance discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 487 (Sen. Moran):\n        A resolution commemorating the centennial of the American Battle Monuments Commission.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 488 (Sen. Blackburn):\n        A resolution recognizing Jobs for America's Graduates for helping young people of truly great promise in the United States succeed in school, on the job, and in postsecondary education, leading to generations of productive and rewarding careers.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 489 (Sen. Collins):\n        A resolution designating December 16, 2023, as \"National Wreaths Across America Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 490 (Sen. Scott, of FL):\n        A resolution remembering the December 6, 2019, terrorist attack at Naval Air Station Pensacola and commemorating those who lost their lives, and those who were injured, in the line of duty.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, December  6)","actionItem":"PN140:\n        Kathleen Cunningham Matthews, of Maryland, to be a Member of the International Broadcasting Advisory Board for a term expiring January 1, 2027\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN141:\n        Jeffrey Gedmin, of the District of Columbia, to be a Member of the International Broadcasting Advisory Board for a term expiring January 1, 2025\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN142:\n        Kenneth M. Jarin, of Pennsylvania, to be Chair of the International Broadcasting Advisory Board\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN143:\n        Kenneth M. Jarin, of Pennsylvania, to be a Member of the International Broadcasting Advisory Board for a term expiring January 1, 2027\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN144:\n        Luis Manuel Botello, of Maryland, to be a Member of the International Broadcasting Advisory Board for a term expiring January 1, 2025\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN145:\n        Michelle Mai Selesky Giuda, of Virginia, to be a Member of the International Broadcasting Advisory Board for a term expiring January 1, 2027\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN152:\n        Dante Quintin Allen, of California, to be Commissioner of the Rehabilitation Services Administration, Department of Education\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN648:\n        Nathalie Rayes, of Massachusetts, to be Ambassador to the Republic of Croatia\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 47. Record Vote Number: 330 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 47. Record Vote Number: 331 \n\n\n\n PN802:\n        Jamie Fly, of Virginia, to be a Member of the International Broadcasting Advisory Board for a term expiring January 1, 2027\n\n        -- Senate Committee on Foreign Relations discharged by Unanimous Consent.\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schatz, at  7:07 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}