{"retrieved-date":"2023-4-18","actions-date":"Tue, 18 Apr 2023 14:55:35 -0400","actions-title":"House Floor Proceedings","actions-count":20,"actions-list":[{"index":1,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is subject to the call of the Chair.","actionTimeStamp":"Tue, 18 Apr 2023 14:55:35 -0400"},{"index":2,"header":"The Speaker laid before the House a message from the President transmitting a notification stating that the national emergency declared in Proclamation 10371 of April 21, 2022, with respect to the Russian Federation and the emergency authority relating to the regulation of the anchorage and movement of Russian-affiliated vessels to United States ports, is to continue in effect beyond April 21, 2023.","actionItem":"referred to the Committee on Foreign Affairs and ordered to be printed.","actionTimeStamp":"Tue, 18 Apr 2023 14:55:10 -0400"},{"index":3,"header":"POSTPONED PROCEEDINGS","actionItem":"Pursuant to clause 8, rule XX, the Chair postponed further proceedings on the question of passage of H.J. Res. 27, the objections of the President to the contrary notwithstanding, until later in the legislative day.","actionTimeStamp":"Tue, 18 Apr 2023 14:54:37 -0400"},{"index":4,"header":"--","actionItem":"The previous question was ordered without objection.","actionTimeStamp":"Tue, 18 Apr 2023 14:54:09 -0400"},{"index":5,"header":"DEBATE","actionItem":"Pursuant to a previous order of the House of April 10, 2023, the unfinished business is the further consideration of the veto message of the President on H.J. Res. 27. The House proceeded with one hour of debate on the objection of the President.","actionTimeStamp":"Tue, 18 Apr 2023 14:13:01 -0400"},{"index":6,"header":"--","actionItem":"The Chair laid before the House the veto message from the President.","actionTimeStamp":"Tue, 18 Apr 2023 14:12:44 -0400"},{"index":7,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Tue, 18 Apr 2023 14:10:51 -0400"},{"index":8,"header":"On agreeing to the resolution Agreed to by recorded vote: 217","actionItem":"202 (Roll no. 186).","actionTimeStamp":"Tue, 18 Apr 2023 14:10:48 -0400"},{"index":9,"header":"On ordering the previous question Agreed to by the Yeas and Nays: 218","actionItem":"203 (Roll no. 185).","actionTimeStamp":"Tue, 18 Apr 2023 14:01:43 -0400"},{"index":10,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 298.","actionTimeStamp":"Tue, 18 Apr 2023 12:28:30 -0400"},{"index":11,"header":"--","actionItem":"Considered as privileged matter. H. Res. 298 — \"Providing for consideration of the bill (H.R. 734) to amend the Education Amendments of 1972 to provide that for purposes of determining compliance with title IX of such Act in athletics, sex shall be recognized based solely on a person's reproductive biology and genetics at birth, and providing for consideration of the joint resolution (H.J. Res. 42) disapproving the action of the District of Columbia Council in approving the Comprehensive Policing and Justice Reform Amendment Act of 2022.\"","actionTimeStamp":"Tue, 18 Apr 2023 12:24:52 -0400"},{"index":12,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair, would be limited to 15 per side of the aisle.","actionTimeStamp":"Tue, 18 Apr 2023 12:02:44 -0400"},{"index":13,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Balderson to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Tue, 18 Apr 2023 12:02:27 -0400"},{"index":14,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Tue, 18 Apr 2023 12:02:22 -0400"},{"index":15,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Tue, 18 Apr 2023 12:00:31 -0400"},{"index":16,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of April 18.","actionTimeStamp":"Tue, 18 Apr 2023 12:00:20 -0400"},{"index":17,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Tue, 18 Apr 2023 10:56:13 -0400"},{"index":18,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Tue, 18 Apr 2023 10:01:05 -0400"},{"index":19,"header":"--","actionItem":"The Speaker designated the Honorable Mike Carey to act as Speaker pro tempore for today.","actionTimeStamp":"Tue, 18 Apr 2023 10:00:00 -0400"},{"index":20,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Tue, 18 Apr 2023 10:00:00 -0400"}]}