{"retrieved-date":"2025-10-21","actions-date":"Monday, October 20, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Thursday, October 16, 2025,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Thursday, October 16, 2025, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, October 20)","actionItem":"H.R. 998 (Rep. Feenstra):\n        A bill to amend the Internal Revenue Code of 1986 to require additional information on math and clerical error notices .\n\n        -- Senate Committee on Finance discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 5371 (Rep. Cole):\n        A bill making continuing appropriations and extensions for fiscal year 2026, and for other purposes .\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Sixth cloture motion on the motion to proceed to the measure not invoked in Senate by Yea-Nay Vote. 50 - 43. Record Vote Number: 576 \n\n\n        -- Motion by Senator Thune to reconsider the vote by which the sixth cloture on the motion to proceed to H.R. 5371 was not invoked (Record Vote No. 576) made in Senate.\n\n        -- Seventh cloture motion on the motion to proceed to the measure presented in Senate.\n\n\n S. 284 (Sen. Lummis):\n        A bill to reauthorize the Congressional Award Act .\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Monday, October 20)","actionItem":"PN466-3:\n        Bill Lewis, of Alabama, to be United States District Judge for the Middle District of Alabama\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  6:26 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}