{"retrieved-date":"2023-11-7","actions-date":"Monday, November 6, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Thursday, November 2, 2023,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Thursday, November 2, 2023, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, November  6)","actionItem":"S. 41 (Sen. Durbin):\n        A bill to reauthorize the READ Act.\n\n        -- Senate Committee on Foreign Relations discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n S.Res. 126 (Sen. Merkley):\n        A resolution recognizing the vital importance of the Mekong River to Southeast Asia and the role of the Mekong-United States Partnership in supporting the prosperity of the region.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee amendment as amended agreed to by Unanimous Consent.\n\n        -- Resolution agreed to in Senate with an amendment and an amended preamble by Unanimous Consent.\n \n\n S.Amdt. 1362 (Sen. Merkley):\n        To make technical amendments.\n\n        --Amendment SA 1362 proposed by Senator Merkley.\n\n        --Amendment SA 1362 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 396 (Sen. Coons):\n        A resolution designating the week beginning on October 8, 2023, as \"National Wildlife Refuge Week\".\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 451 (Sen. Tester):\n        A resolution permitting the collection of clothing , toys, food, and housewares during the holiday season for charitable purposes in Senate buildings.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.\n\n\n S.Res. 452 (Sen. Murray):\n        A resolution designating October 30, 2023, as a national day of remembrance for the workers of the nuclear weapons program of the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Monday, November  6)","actionItem":"PN165:\n        Monica Ramirez Almadani, of California, to be United States District Judge for the Central District of California\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN499:\n        Ana de Alba, of California, to be United States Circuit Judge for the Ninth Circuit\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN649:\n        Monica M. Bertagnolli, of Massachusetts, to be Director of the National Institutes of Health\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 59 - 32. Record Vote Number: 292 \n\n\n        -- By unanimous consent agreement, debate 11/7/2023.\n\n\n PN786:\n        Charlotte A. Burrows, of the District of Columbia, to be a Member of the Equal Employment Opportunity Commission for a term expiring July 1, 2028\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN813:\n        Brandy R. McMillion, of Michigan, to be United States District Judge for the Eastern District of Michigan\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Merkley, at  6:43 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}