{"retrieved-date":"2023-2-2","actions-date":"Wednesday, February 1, 2023","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday,the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, February  1)","actionItem":"S. 223 (Sen. Grassley):\n        A bill to amend the Controlled Substances Act to fix a technical error in the definitions.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.\n\n\n S.Res. 11 (Sen. Scott, of SC):\n        A resolution designating the week of January 22 through January 28, 2023, as \"National School Choice Week\".\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 21 (Sen. Feinstein):\n        A resolution supporting the observation of National Trafficking and Modern Slavery Prevention Month during the period beginning on January 1, 2023, and ending on February 1, 2023, to raise awareness of, and opposition to, human trafficking and modern slavery.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Yea-Nay. 97 - 0. Record Vote Number: 4 \n\n\n\n S.Res. 22 (Sen. Thune):\n        A resolution congratulating the South Dakota StateUniversity Jackrabbits on winning the 2023 National Collegiate Athletic Association Division I Football Championship Subdivision title.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Ms. Cortez Masto,at  5:59 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}