{"retrieved-date":"2024-3-7","actions-date":"Wednesday, March 6, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, March  6)","actionItem":"H.R. 4366 (Rep. Carter):\n        A bill making appropriations for military construction, the Department of Veterans Affairs, and related agencies for the fiscal year ending September 30, 2024, and for other purposes.\n\n        -- Message on House action received in Senate and at desk: House amendment to Senate amendment.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Motion by Senator Schumer to concur in the House amendment to the Senate amendment to H.R. 4366 made in Senate.\n\n        -- Cloture motion on the motion to concur in the House amendment to the Senate amendment to H.R. 4366 presented in Senate.\n\n        -- Motion by Senator Schumer to concur in the House amendment to the Senate amendment to H.R. 4366 with an amendment (SA 1618) made in Senate.\n\n        -- Motion by Senator Schumer to refer to Senate Committee on Appropriations the House message to accompany H.R. 4366 with instructions to report back forthwith with the following amendment (SA 1620) made in Senate.\n \n\n S.Amdt. 1618 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 1618 proposed by Senator Schumer.\n\n\n S.Amdt. 1619 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 1619 proposed by Senator Schumer to Amendment SA 1618.\n\n\n S.Amdt. 1620 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 1620 proposed by Senator Schumer.\n\n\n S.Amdt. 1621 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 1621 proposed by Senator Schumer to Amendment SA 1620 (the instructions of the motion to refer).\n\n\n S.Amdt. 1622 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 1622 proposed by Senator Schumer to Amendment SA 1621.\n\n\n\n\n H.R. 7454 (Rep. Graves):\n        A bill to amend title 49, United States Code, to extend authorizations for the airport improvement program, to amend the Internal Revenue Code of 1986 to extend the funding and expenditure authority of the Airport and Airway Trust Fund, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.Con.Res. 93 (Rep. Scalise):\n        A concurrent resolution providing for a joint session of Congress to receive a message from the President.\n\n        -- Received in the Senate, considered, and agreed to without amendment by Unanimous Consent.\n\n\n S.Res. 577 (Sen. Klobuchar):\n        A resolution recognizing and honoring Burnsville, Minnesota, law enforcement and first responders for their heroic actions.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 578 (Sen. Hawley):\n        A resolution congratulating the Kansas City Chiefs on their victory in Super Bowl LVIII in the successful 104th season of the National Football League.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 579 (Sen. Schumer):\n        A resolution to authorize testimony and representation in United States v. Kenyon.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, March  6)","actionItem":"PN1213:\n        Ronald T. Keohane, of New York, to be an Assistant Secretary of Defense\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 69 - 30. Record Vote Number: 69 \n\n\n\n PN1234:\n        Cathy Ann Harris, of Maryland, to be Chairman of the Merit Systems Protection Board\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 48. Record Vote Number: 72 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 48. Record Vote Number: 73 \n\n\n\n PN1348:\n        Moshe Z. Marvit, of Pennsylvania, to be a Member of the Federal Mine Safety and Health Review Commission for a term of six years expiring August 30, 2028\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 70 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 71","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  7:44 p.m, the Presiding Officer (Ms. Hassan in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}