{"retrieved-date":"2025-12-11","actions-date":"Wednesday, December 10, 2025","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, December 10)","actionItem":"S. 1071 (Sen. Cornyn):\n        A bill to require the Secretary of Veterans Affairs to disinter the remains of Fernando V. Cota from Fort Sam Houston National Cemetery, Texas, and for other purposes.\n\n        -- Message on House action received in Senate and at desk: House amendment to Senate bill.\n\n\n S. 1884 (Sen. Cornyn):\n        A bill to clarify the Holocaust Expropriated Art Recovery Act of 2016, to appropriately limit the application of defenses based on the passage of time and other non-merits defenses to claims under that Act.\n\n        -- Passed Senate with amendments by Unanimous Consent.\n\n\n S. 2584 (Sen. Cornyn):\n        A bill to amend title 18, United States Code, regarding additional assessments on convicted persons, and for other persons.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3958 (Sen. Cornyn):\n        In the nature of a substitute.\n\n        --Amendment SA 3958 proposed by Senator Barrasso for Senator Cornyn.\n\n        --Amendment SA 3958 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 3424 (Sen. Coons):\n        A bill to amend titles 11 and 28, United States Code, to modify the compensation payable to trustees serving in cases under chapter 7 of title 11, United States Code, to extend the term of certain temporary offices of bankruptcy judges, and for other purposes.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.\n\n\n S.J.Res. 82 (Sen. King):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Office of the Secretary of the Department of Health and Human Services relating to \"Policy on Adhering to the Text of the Administrative Procedure Act\".\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 641 \n\n\n        -- Measure laid before Senate by motion.\n\n\n S.Res. 532 (Sen. Thune):\n        An executive resolution authorizing the en bloc consideration in Executive Session of certain nominations on the Executive Calendar.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture on the measure invoked in Senate by Yea-Nay Vote. 51 - 47. Record Vote Number: 642 \n\n\n        -- Considered by Senate.","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  6:43 p.m, the Presiding Officer (Mr. Justice in the chair) declared the Senate adjourned, under its order of today, until  9:30 a.m. tomorrow.","actionTimeStamp":"--"}]}