{"retrieved-date":"2023-7-14","actions-date":"Fri, 14 Jul 2023 09:30:08 -0400","actions-title":"House Floor Proceedings","actions-count":12,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 583, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 64.","actionTimeStamp":"Fri, 14 Jul 2023 09:30:08 -0400"},{"index":2,"header":"--","actionItem":"An amendment, offered by Mr. Roy,  numbered 64 printed in House Report 118-142 to prohibit the DOD from carrying out President Biden's climate change executive orders.","actionTimeStamp":"Fri, 14 Jul 2023 09:30:06 -0400"},{"index":3,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Banks amendment No. 63, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Strickland demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Fri, 14 Jul 2023 09:29:22 -0400"},{"index":4,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 583, the Committee of the Whole proceeded with 10 minutes of debate on the Banks amendment No. 63.","actionTimeStamp":"Fri, 14 Jul 2023 09:16:25 -0400"},{"index":5,"header":"--","actionItem":"An amendment, offered by Mr. Banks,  numbered 63 printed in House Report 118-142 to prohibit any funds authorized in the bill from being used by the military service academies to discriminate on the basis of race or ethnicity in academy admissions or to establish quotas for admission on the basis of race or ethnicity.","actionTimeStamp":"Fri, 14 Jul 2023 09:16:21 -0400"},{"index":6,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Fri, 14 Jul 2023 09:15:16 -0400"},{"index":7,"header":"--","actionItem":"Considered as unfinished business. H.R. 2670 — \"To authorize appropriations for fiscal year 2024 for military activities of the Department of Defense and for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\"","actionTimeStamp":"Fri, 14 Jul 2023 09:14:54 -0400"},{"index":8,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches which by direction of the Chair, would be limited to 5 per side of the aisle.","actionTimeStamp":"Fri, 14 Jul 2023 09:03:19 -0400"},{"index":9,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Ms. Dean of PA to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Fri, 14 Jul 2023 09:02:50 -0400"},{"index":10,"header":"SPEAKER'S APPROVAL OF THE JOURNAL","actionItem":"The Chair announced that he had examined the Journal of the last day's proceedings and had approved it. Mr. Davidson demanded that the question be put on agreeing to the Speaker's approval of the Journal and by voice vote, the Chair announced that the ayes had prevailed. Mr. Davidson objected to the voice vote based upon the absence of a quorum and the Chair postponed further proceedings on the question of agreeing to the Speaker's approval of the Journal until a time to be announced.","actionTimeStamp":"Fri, 14 Jul 2023 09:01:52 -0400"},{"index":11,"header":"--","actionItem":"Today's prayer was offered by Dr. Tony Foster, Restoration Worship Center, Greenwood, South Carolina.","actionTimeStamp":"Fri, 14 Jul 2023 09:00:21 -0400"},{"index":12,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Fri, 14 Jul 2023 09:00:00 -0400"}]}