{"retrieved-date":"2023-9-27","actions-date":"Wed, 27 Sep 2023 12:13:26 -0400","actions-title":"House Floor Proceedings","actions-count":69,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 164.","actionTimeStamp":"Wed, 27 Sep 2023 12:13:26 -0400"},{"index":2,"header":"--","actionItem":"An amendment, offered by Ms. Greene (GA),  numbered 164 printed in Part A of House Report 118-216 to reduce the salary of Lloyd James Austin III to $1.","actionTimeStamp":"Wed, 27 Sep 2023 12:12:52 -0400"},{"index":3,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Gaetz amendment No. 161, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Calvert demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 27 Sep 2023 12:12:15 -0400"},{"index":4,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Gaetz amendment No. 161.","actionTimeStamp":"Wed, 27 Sep 2023 12:05:52 -0400"},{"index":5,"header":"--","actionItem":"An amendment, offered by Mr. Gaetz,  numbered 161 printed in Part A of House Report 118-216 to prohibit funds made available by the bill from being used to transfer cluster munitions.","actionTimeStamp":"Wed, 27 Sep 2023 12:04:41 -0400"},{"index":6,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Gaetz amendment No. 160, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Mr. Gaetz demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 27 Sep 2023 12:04:07 -0400"},{"index":7,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Gaetz amendment No. 160.","actionTimeStamp":"Wed, 27 Sep 2023 11:57:15 -0400"},{"index":8,"header":"--","actionItem":"An amendment, offered by Mr. Gaetz,  numbered 160 printed in Part A of House Report 118-216 to prohibit security assistance for Ukraine.","actionTimeStamp":"Wed, 27 Sep 2023 11:57:07 -0400"},{"index":9,"header":"--","actionItem":"By unanimous consent, the Fallon amendment was withdrawn.","actionTimeStamp":"Wed, 27 Sep 2023 11:56:40 -0400"},{"index":10,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Fallon amendment No. 158.","actionTimeStamp":"Wed, 27 Sep 2023 11:56:27 -0400"},{"index":11,"header":"--","actionItem":"An amendment, offered by Mr. Fallon, An Amendment numbered 158 printed in Part A of House Report 118-216 to reduce the salary of Kelisa Wing to $1.","actionTimeStamp":"Wed, 27 Sep 2023 11:56:13 -0400"},{"index":12,"header":"--","actionItem":"On agreeing to the Norton amendment; Failed by voice vote.","actionTimeStamp":"Wed, 27 Sep 2023 11:54:05 -0400"},{"index":13,"header":"VACATING DEMAND FOR A RECORDED VOTE","actionItem":"Ms. McCollum asked unanimous consent that the request for a recorded vote on the Norton amendment No. 125 be withdrawn to the end that the amendment stands disposed by the earlier voice vote that was recorded thereon. Agreed to without objection.","actionTimeStamp":"Wed, 27 Sep 2023 11:54:00 -0400"},{"index":14,"header":"--","actionItem":"On agreeing to the Crane amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 27 Sep 2023 11:53:26 -0400"},{"index":15,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Crane amendment No. 157.","actionTimeStamp":"Wed, 27 Sep 2023 11:53:14 -0400"},{"index":16,"header":"--","actionItem":"An amendment, offered by Mr. Crane,  numbered 157 printed in Part A of House Report 118-216 to prohibit funds from being used to deploy United States Armed Forces to Ukraine.","actionTimeStamp":"Wed, 27 Sep 2023 11:53:02 -0400"},{"index":17,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Connolly amendment No. 156, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Mr. Connolly demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 27 Sep 2023 11:36:20 -0400"},{"index":18,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Connolly amendment No. 156.","actionTimeStamp":"Wed, 27 Sep 2023 11:28:58 -0400"},{"index":19,"header":"--","actionItem":"An amendment, offered by Mr. Connolly,  numbered 156 printed in Part A of House Report 118-216 to prohibit funds from being used in violation of section 129a of title 10, United States Code.","actionTimeStamp":"Wed, 27 Sep 2023 11:28:49 -0400"},{"index":20,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Clyde amendment No. 155, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Ms. McCollum demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 27 Sep 2023 11:28:06 -0400"},{"index":21,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Clyde amendment No. 155.","actionTimeStamp":"Wed, 27 Sep 2023 11:19:56 -0400"},{"index":22,"header":"--","actionItem":"An amendment, offered by Mr. Clyde,  numbered 155 printed in Part A of House Report 118-216 to prohibit funds from being used to implement section 370 of Public Law 116-283.","actionTimeStamp":"Wed, 27 Sep 2023 11:19:41 -0400"},{"index":23,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Clyde amendment No. 154, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Molinaro demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 27 Sep 2023 11:19:12 -0400"},{"index":24,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Clyde amendment No. 154.","actionTimeStamp":"Wed, 27 Sep 2023 11:12:05 -0400"},{"index":25,"header":"--","actionItem":"An amendment, offered by Mr. Clyde,  numbered 154 printed in Part A of House Report 118-216 to prohibit funds to implement or enforce recommendation of the Naming Commission in regards to the Reconciliation Monument in Arlington National Cemetery.","actionTimeStamp":"Wed, 27 Sep 2023 11:11:46 -0400"},{"index":26,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Boebert amendment No. 153, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. McCollum demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 27 Sep 2023 11:11:19 -0400"},{"index":27,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 153.","actionTimeStamp":"Wed, 27 Sep 2023 11:00:12 -0400"},{"index":28,"header":"--","actionItem":"An amendment, offered by Mrs. Boebert,  numbered 153 printed in Part A of House Report 118-216 to reduce the salary of Norvel Dillard to $1.","actionTimeStamp":"Wed, 27 Sep 2023 11:00:02 -0400"},{"index":29,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Boebert amendment No. 152, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. McCollum demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 27 Sep 2023 10:59:40 -0400"},{"index":30,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 152.","actionTimeStamp":"Wed, 27 Sep 2023 10:52:30 -0400"},{"index":31,"header":"--","actionItem":"An amendment, offered by Mrs. Boebert,  numbered 152 printed in Part A of House Report 118-216 to reduce the salary of Shawn Skelly, Assistant Secretary of Defense for Readiness to $1.","actionTimeStamp":"Wed, 27 Sep 2023 10:52:10 -0400"},{"index":32,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Plaskett amendment No. 151, the Chair put the question on agreeing to the amendment and by voice vote announced that the noes had prevailed. Ms. Plaskett demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 27 Sep 2023 10:51:37 -0400"},{"index":33,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Plaskett amendment No. 151.","actionTimeStamp":"Wed, 27 Sep 2023 10:45:37 -0400"},{"index":34,"header":"--","actionItem":"An amendment, offered by Ms. Plaskett,  numbered 151 printed in Part A of House Report 118-216 to strike section 8149 of the bill.","actionTimeStamp":"Wed, 27 Sep 2023 10:45:27 -0400"},{"index":35,"header":"--","actionItem":"On agreeing to the Griffith amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 27 Sep 2023 10:45:12 -0400"},{"index":36,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Griffith amendment No. 150.","actionTimeStamp":"Wed, 27 Sep 2023 10:38:55 -0400"},{"index":37,"header":"--","actionItem":"An amendment, offered by Mr. Griffith,  numbered 150 printed in Part A of House Report 118-216 to strike references to China in lines 18 and 19 on page 132.","actionTimeStamp":"Wed, 27 Sep 2023 10:38:41 -0400"},{"index":38,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Biggs amendment No. 149, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. McCollum demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 27 Sep 2023 10:36:49 -0400"},{"index":39,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 149.","actionTimeStamp":"Wed, 27 Sep 2023 10:25:16 -0400"},{"index":40,"header":"--","actionItem":"An amendment, offered by Mr. Biggs,  numbered 149 printed in Part A of House Report 118-216 to decrease Section 8104, Ukraine Security Assistance Initiative bye Initiative by $300,000,000, and increase the Spending Reduction Account by $300,000,000.","actionTimeStamp":"Wed, 27 Sep 2023 10:24:46 -0400"},{"index":41,"header":"--","actionItem":"On agreeing to the Crenshaw amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 27 Sep 2023 10:24:28 -0400"},{"index":42,"header":"--","actionItem":"An amendment, offered by Mr. Crenshaw,  numbered 137 printed in Part A of House Report 118-216 to provide funding for the Defense Health Agency to submit a report to Congress on options to ensure that active-duty service members who are suffering from Traumatic Brain Injuries (TBI) and Post-Traumatic Stress Disorder (PTSD) are able to participate in clinical trials.","actionTimeStamp":"Wed, 27 Sep 2023 10:21:00 -0400"},{"index":43,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Norton amendment No. 125, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Ms. Norton demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 27 Sep 2023 10:20:20 -0400"},{"index":44,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Norton amendment No. 125.","actionTimeStamp":"Wed, 27 Sep 2023 10:18:55 -0400"},{"index":45,"header":"--","actionItem":"An amendment, offered by Ms. Norton,  numbered 125 printed in Part A of House Report 118-216 to increase and decrease by $10 million for research, development, test and evaluation for the Space Force with the intent that the $10 million will be used for Single-Stage-to- Orbit Propulsion Research.","actionTimeStamp":"Wed, 27 Sep 2023 10:18:38 -0400"},{"index":46,"header":"--","actionItem":"On agreeing to the Luttrell amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 27 Sep 2023 10:18:27 -0400"},{"index":47,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Luttrell amendment No. 48.","actionTimeStamp":"Wed, 27 Sep 2023 10:10:40 -0400"},{"index":48,"header":"--","actionItem":"An amendment, offered by Mr. Luttrell,  numbered 48 printed in Part A of House Report 118-216 to provide $15 million in funding for the DoD wide Psychedelic Medical Clinical Trials.","actionTimeStamp":"Wed, 27 Sep 2023 10:10:28 -0400"},{"index":49,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Houlahan amendment No. 34, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Ms. Houlahan demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 27 Sep 2023 10:09:59 -0400"},{"index":50,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 10 minutes of debate on the Houlahan amendment No. 34.","actionTimeStamp":"Wed, 27 Sep 2023 10:05:37 -0400"},{"index":51,"header":"--","actionItem":"An amendment, offered by Ms. Houlahan,  numbered 34 printed in Part A of House Report 118-216 to direct $50 million from O&amp;M Defense-Wide to the Defense Production Act Purchases account, intended to fund the Advanced Defense Capabilities Pilot Program, as authorized by Section 853 of the House-passed FY24 NDAA and Section 831 of the Senate-passed FY24 NDAA.","actionTimeStamp":"Wed, 27 Sep 2023 10:05:16 -0400"},{"index":52,"header":"--","actionItem":"On agreeing to the Calvert amendments; Agreed to by voice vote.","actionTimeStamp":"Wed, 27 Sep 2023 10:04:41 -0400"},{"index":53,"header":"--","actionItem":"Amendments en bloc  offered by Mr. Calvert,  comprised of the following amendments printed in Part A of House Report 118-216 as en bloc No. 3: Nos. 86, 89, 98, 100, 102, 104, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, and 159.","actionTimeStamp":"Wed, 27 Sep 2023 09:57:30 -0400"},{"index":54,"header":"--","actionItem":"On agreeing to the Calvert amendments; Agreed to by voice vote.","actionTimeStamp":"Wed, 27 Sep 2023 09:57:11 -0400"},{"index":55,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 20 minutes of debate on the Calvert amendment en bloc No. 2.","actionTimeStamp":"Wed, 27 Sep 2023 09:49:52 -0400"},{"index":56,"header":"--","actionItem":"Amendments en bloc  offered by Mr. Calvert,  comprised of the following amendments printed in Part A of House Report 118-216 as en bloc No. 2: Nos. 43, 44, 45, 50, 52, 53, 54, 55, 56, 58, 59, 60, 61, 62, 63, 64, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 87, 88, 90, 91, 92, 93, 94, 95, 96, 97, 99, 101, 103, 105, 106, 107, 108, and 109.","actionTimeStamp":"Wed, 27 Sep 2023 09:49:43 -0400"},{"index":57,"header":"--","actionItem":"On agreeing to the Calvert amendments; Agreed to by voice vote.","actionTimeStamp":"Wed, 27 Sep 2023 09:47:08 -0400"},{"index":58,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 723, the Committee of the Whole proceeded with 20 minutes of debate on the Calvert amendment en bloc No. 1.","actionTimeStamp":"Wed, 27 Sep 2023 09:45:56 -0400"},{"index":59,"header":"--","actionItem":"Amendments en bloc  offered by Mr. Calvert,  comprised of the following amendments printed in Part A of House Report 118-216 as en bloc No. 1: Nos. 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 30, 31, 32, 33, 35, 36, 37, 38, 39, 40, 41, 42, 46, 47, 49, 51, and 65.","actionTimeStamp":"Wed, 27 Sep 2023 09:45:44 -0400"},{"index":60,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 4365.","actionTimeStamp":"Wed, 27 Sep 2023 09:07:34 -0400"},{"index":61,"header":"--","actionItem":"The Speaker designated the Honorable Mike Carey to act as Chairman of the Committee.","actionTimeStamp":"Wed, 27 Sep 2023 09:06:54 -0400"},{"index":62,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 723 and Rule XVIII.","actionTimeStamp":"Wed, 27 Sep 2023 09:06:50 -0400"},{"index":63,"header":"--","actionItem":"Rule provides for consideration of H.R. 4365, H.R. 4367, H.R. 4368 and H.R. 4665. The resolution provides for consideration of H.R. 4365, H.R. 4367, H.R. 4368, and H.R. 4665, under a structured rule for each bill. The resolution provides for one hour of general debate for each bill and one motion to recommit.","actionTimeStamp":"Wed, 27 Sep 2023 09:06:14 -0400"},{"index":64,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 723. H.R. 4365 — \"Making appropriations for the Department of Defense for the fiscal year ending September 30, 2024, and for other purposes.\"","actionTimeStamp":"Wed, 27 Sep 2023 09:06:09 -0400"},{"index":65,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches which by direction of the Chair, would be limited to 15 per side of the aisle.","actionTimeStamp":"Wed, 27 Sep 2023 09:02:05 -0400"},{"index":66,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Carey to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 27 Sep 2023 09:01:51 -0400"},{"index":67,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 27 Sep 2023 09:01:41 -0400"},{"index":68,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Wed, 27 Sep 2023 09:00:10 -0400"},{"index":69,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 27 Sep 2023 09:00:00 -0400"}]}