{"retrieved-date":"2023-11-15","actions-date":"Monday, November 13, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Thursday, November 9, 2023,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Thursday, November 9, 2023, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, November 13)","actionItem":"S.Res. 427 (Sen. Cassidy):\n        A resolution calling on Congress, schools, and State and local educational agencies to recognize the significant educational implications of dyslexia that must be addressed, and designating October 2023 as \"National Dyslexia Awareness Month\".\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 461 (Sen. Cruz):\n        A resolution congratulating the Texas Rangers for winning the 2023 Major League Baseball World Series.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Monday, November 13)","actionItem":"PN499:\n        Ana de Alba, of California, to be United States Circuit Judge for the Ninth Circuit\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 48 - 43. Record Vote Number: 308","actionTimeStamp":"--"},{"index":6,"header":"Recess","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  7:10 p.m., the Senate recessed, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}