{"retrieved-date":"2023-7-13","actions-date":"Thu, 13 Jul 2023 17:52:41 -0400","actions-title":"House Floor Proceedings","actions-count":81,"actions-list":[{"index":1,"header":"On agreeing to the Ogles amendment (A014) Roll Call 307","actionItem":"Recorded vote pending.","actionTimeStamp":"Thu, 13 Jul 2023 17:52:41 -0400"},{"index":2,"header":"--","actionItem":"On agreeing to the Davidson amendment; Failed by recorded vote: (Roll no. 306).","actionTimeStamp":"Thu, 13 Jul 2023 17:52:35 -0400"},{"index":3,"header":"--","actionItem":"On agreeing to the Greene (GA) amendment; Failed by recorded vote: (Roll no. 305).","actionTimeStamp":"Thu, 13 Jul 2023 17:48:20 -0400"},{"index":4,"header":"--","actionItem":"On agreeing to the Gaetz amendment; Failed by recorded vote: (Roll no. 304).","actionTimeStamp":"Thu, 13 Jul 2023 17:45:07 -0400"},{"index":5,"header":"--","actionItem":"On agreeing to the Greene (GA) amendment; Failed by recorded vote: (Roll no. 303).","actionTimeStamp":"Thu, 13 Jul 2023 17:42:21 -0400"},{"index":6,"header":"--","actionItem":"On agreeing to the Norman amendment; Agreed to by recorded vote: (Roll no. 302).","actionTimeStamp":"Thu, 13 Jul 2023 17:39:40 -0400"},{"index":7,"header":"--","actionItem":"On agreeing to the Rosendale amendment; Agreed to by recorded vote: (Roll no. 301).","actionTimeStamp":"Thu, 13 Jul 2023 17:36:38 -0400"},{"index":8,"header":"--","actionItem":"On agreeing to the Jackson (TX) amendment; Agreed to by recorded vote: (Roll no. 300).","actionTimeStamp":"Thu, 13 Jul 2023 17:33:30 -0400"},{"index":9,"header":"--","actionItem":"On agreeing to the Tlaib amendment; Failed by recorded vote: (Roll no. 299).","actionTimeStamp":"Thu, 13 Jul 2023 17:29:39 -0400"},{"index":10,"header":"--","actionItem":"On agreeing to the Blumenauer amendment; Failed by recorded vote: (Roll no. 298).","actionTimeStamp":"Thu, 13 Jul 2023 17:26:27 -0400"},{"index":11,"header":"UNFINISHED BUSINESS","actionItem":"The Chair announced the unfinished business was the question on agreeing to the amendments to H.R. 2670 which had been debated earlier and on which further proceedings had been postponed.","actionTimeStamp":"Thu, 13 Jul 2023 17:00:54 -0400"},{"index":12,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Roy amendment No. 31, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Mr. Roy demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jul 2023 16:59:53 -0400"},{"index":13,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 583, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 31.","actionTimeStamp":"Thu, 13 Jul 2023 16:48:44 -0400"},{"index":14,"header":"--","actionItem":"An amendment, offered by Mr. Roy,  numbered 31 printed in House Report 118-143 to prohibit funds authorized for DoDEA from being used to promote that idea that, 1) Any race is inherently superior or inferior to any other race, color, or national origin. 2) The US is a fundamentally racist country. 3) The Declaration of Independence or the US Constitution are racist documents, 4) An individual's moral character or worth is determined by the individual's race, color, or national origin. 5) An individual, by virtue of the individual's race, is inherently racist or oppressive, whether consciously or unconsciously. 6) An individual, because of the individuals race, bears responsibility for the actions committed by other members of the individuals race, color, or national origin.","actionTimeStamp":"Thu, 13 Jul 2023 16:48:43 -0400"},{"index":15,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Roy amendment No. 30, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Mr. Roy demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jul 2023 16:48:03 -0400"},{"index":16,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 583, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 30.","actionTimeStamp":"Thu, 13 Jul 2023 16:35:57 -0400"},{"index":17,"header":"--","actionItem":"An amendment, offered by Mr. Roy,  numbered 30 printed in House Report 118-143 to amend Section 904 to prohibit federal funds from being used to establish a position within the Department of Defense for anything similar to Chief Diversity Officers or Senior Advisors for Diversity and Inclusion.","actionTimeStamp":"Thu, 13 Jul 2023 16:35:54 -0400"},{"index":18,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Tlaib amendment No. 28, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Ms. Tlaib demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jul 2023 16:35:27 -0400"},{"index":19,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 583, the Committee of the Whole proceeded with 10 minutes of debate on the Tlaib amendment No. 28.","actionTimeStamp":"Thu, 13 Jul 2023 16:24:57 -0400"},{"index":20,"header":"--","actionItem":"An amendment, offered by Ms. Tlaib,  numbered 28 printed in House Report 118-143 to strike the prohibition on the reduction of the total number of nuclear armed Intercontinental Ballistic Missiles (ICBMs) deployed in the United States in Sec. 1638.","actionTimeStamp":"Thu, 13 Jul 2023 16:24:55 -0400"},{"index":21,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Blumenauer amendment No. 27, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Mr. Blumenauer demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jul 2023 16:24:22 -0400"},{"index":22,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 583, the Committee of the Whole proceeded with 10 minutes of debate on the Blumenauer amendment No. 27.","actionTimeStamp":"Thu, 13 Jul 2023 16:14:50 -0400"},{"index":23,"header":"--","actionItem":"An amendment, offered by Mr. Blumenauer,  numbered 27 printed in House Report 118-143 to strike section 1639 and to prohibit the use of funds for the sustainment of the B83-1 bomb.","actionTimeStamp":"Thu, 13 Jul 2023 16:14:48 -0400"},{"index":24,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Ogles amendment No. 25, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Mr. Ogles demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jul 2023 16:14:09 -0400"},{"index":25,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 583, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 25.","actionTimeStamp":"Thu, 13 Jul 2023 16:03:07 -0400"},{"index":26,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 25 printed in House Report 118-143 to strike section 1224 of the bill, which extends lend-lease authority to Ukraine.","actionTimeStamp":"Thu, 13 Jul 2023 16:03:05 -0400"},{"index":27,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Davidson amendment No. 24, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Mr. Davidson demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jul 2023 16:02:11 -0400"},{"index":28,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 583, the Committee of the Whole proceeded with 10 minutes of debate on the Davidson amendment No. 24.","actionTimeStamp":"Thu, 13 Jul 2023 15:51:27 -0400"},{"index":29,"header":"--","actionItem":"An amendment, offered by Mr. Davidson,  numbered 24 printed in House Report 118-143 to require the President, in coordination with the Secretary of Defense and Secretary of State, to develop and submit a report to Congress that contains a strategy for U.S. involvement in Ukraine.","actionTimeStamp":"Thu, 13 Jul 2023 15:51:25 -0400"},{"index":30,"header":"--","actionItem":"Subsequently, the Committee of the Whole resumed it's sitting.","actionTimeStamp":"Thu, 13 Jul 2023 15:50:30 -0400"},{"index":31,"header":"--","actionItem":"The Committee of the Whole rose informally to receive a message from the President.","actionTimeStamp":"Thu, 13 Jul 2023 15:50:25 -0400"},{"index":32,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Greene (GA) amendment No. 23, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Ms. Greene (GA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jul 2023 15:49:25 -0400"},{"index":33,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 583, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 23.","actionTimeStamp":"Thu, 13 Jul 2023 15:37:31 -0400"},{"index":34,"header":"--","actionItem":"An amendment, offered by Ms. Greene (GA),  numbered 23 printed in House Report 118-143 to strike the creation of a Center of Excellence in Ukraine.","actionTimeStamp":"Thu, 13 Jul 2023 15:37:25 -0400"},{"index":35,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Gaetz amendment No. 22, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Mr. Gaetz demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jul 2023 15:36:50 -0400"},{"index":36,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 583, the Committee of the Whole proceeded with 10 minutes of debate on the Gaetz amendment No. 22.","actionTimeStamp":"Thu, 13 Jul 2023 15:26:05 -0400"},{"index":37,"header":"--","actionItem":"An amendment, offered by Mr. Gaetz,  numbered 22 printed in House Report 118-142 to prohibit security assistance for Ukraine.","actionTimeStamp":"Thu, 13 Jul 2023 15:25:10 -0400"},{"index":38,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Greene (GA) amendment No. 21, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Mr. Gaetz demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jul 2023 15:24:57 -0400"},{"index":39,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 583, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 21.","actionTimeStamp":"Thu, 13 Jul 2023 15:12:16 -0400"},{"index":40,"header":"--","actionItem":"An amendment, offered by Ms. Greene (GA),  numbered 21 printed in House Report 118-142 to strike $300 million of Ukraine funding.","actionTimeStamp":"Thu, 13 Jul 2023 15:11:48 -0400"},{"index":41,"header":"POSTPONED PROCEEDINGS","actionItem":"At conclusion of debate on the Norman (SC) amendment No. 20, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Smith (WA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jul 2023 15:11:11 -0400"},{"index":42,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 583, the Committee of the Whole proceeded with 10 minutes of debate on the Norman (SC) amendment No. 20.","actionTimeStamp":"Thu, 13 Jul 2023 15:00:13 -0400"},{"index":43,"header":"--","actionItem":"An amendment, offered by Mr. Norman,  numbered 20 printed in House Report 118-142 to prohibit provision of gender transition procedures, including surgery or medication, through the Exceptional Family Member Program.","actionTimeStamp":"Thu, 13 Jul 2023 14:59:16 -0400"},{"index":44,"header":"POSTPONED PROCEEDINGS","actionItem":"At conclusion of debate on the Rosendale amendment No. 10, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Jacobs demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jul 2023 14:58:19 -0400"},{"index":45,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 583, the Committee of the Whole proceeded with 10 minutes of debate on the Rosendale amendment No. 10.","actionTimeStamp":"Thu, 13 Jul 2023 14:46:48 -0400"},{"index":46,"header":"--","actionItem":"An amendment, offered by Mr. Rosendale,  numbered 10 printed in House Report 118-142 to prohibit TRICARE from covering and the Department of Defense from furnishing sex reassignment surgeries and gender hormone treatments for transgender individuals.","actionTimeStamp":"Thu, 13 Jul 2023 14:45:28 -0400"},{"index":47,"header":"POSTPONED PROCEEDINGS","actionItem":"At conclusion of debate on the Jackson (TX) amendment No. 5, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Sherrill demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jul 2023 14:44:38 -0400"},{"index":48,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 583, the Committee of the Whole proceeded with 10 minutes of debate on the Jackson (TX) amendment No. 5.","actionTimeStamp":"Thu, 13 Jul 2023 14:32:56 -0400"},{"index":49,"header":"--","actionItem":"An amendment, offered by Mr. Jackson (TX),  numbered 5 printed in House Report 118-142 to prohibit the Secretary of Defense from paying for or reimbursing expenses relating to abortion services.","actionTimeStamp":"Thu, 13 Jul 2023 14:32:01 -0400"},{"index":50,"header":"--","actionItem":"On agreeing to the Luna amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 13 Jul 2023 14:31:06 -0400"},{"index":51,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 583, the Committee of the Whole proceeded with 10 minutes of debate on the Luna amendment No. 1.","actionTimeStamp":"Thu, 13 Jul 2023 14:25:16 -0400"},{"index":52,"header":"--","actionItem":"An amendment, offered by Mrs. Luna,  numbered 1 printed in House Report 118-142 to prohibit any form of support or direct involvement by federal agencies in research that is conducted by the Chinese government, the Chinese Communist Party, or any of their affiliated agents, intstruments, or entities.","actionTimeStamp":"Thu, 13 Jul 2023 14:25:00 -0400"},{"index":53,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 583 and Rule XVIII.","actionTimeStamp":"Thu, 13 Jul 2023 14:23:34 -0400"},{"index":54,"header":"--","actionItem":"Rule provides for consideration of H.R. 2670. The resolution provides for further consideration of H.R. 2670 under a structured rule. The resolution makes in order only those further amendments printed in House Report 118-142. One motion to recommit provided.","actionTimeStamp":"Thu, 13 Jul 2023 14:23:17 -0400"},{"index":55,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 583. H.R. 2670 — \"To authorize appropriations for fiscal year 2024 for military activities of the Department of Defense and for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\"","actionTimeStamp":"Thu, 13 Jul 2023 14:23:12 -0400"},{"index":56,"header":"--","actionItem":"Committee of the Whole House on the state of the Union rises leaving H.R. 2670 as unfinished business.","actionTimeStamp":"Thu, 13 Jul 2023 14:19:33 -0400"},{"index":57,"header":"On agreeing to the Rogers (AL) amendments; Agreed to by recorded vote: 399","actionItem":"31 (Roll no. 297).","actionTimeStamp":"Thu, 13 Jul 2023 14:17:57 -0400"},{"index":58,"header":"UNFINISHED BUSINESS","actionItem":"The Chair announced that the unfinished business is the question on agreeing to the Rogers (AL) en bloc amendment No. 5, which had been debated earlier and on which further proceedings had been postponed.","actionTimeStamp":"Thu, 13 Jul 2023 14:11:05 -0400"},{"index":59,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Thu, 13 Jul 2023 14:10:28 -0400"},{"index":60,"header":"--","actionItem":"Considered as unfinished business. H.R. 2670 — \"To authorize appropriations for fiscal year 2024 for military activities of the Department of Defense and for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\"","actionTimeStamp":"Thu, 13 Jul 2023 14:09:55 -0400"},{"index":61,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Thu, 13 Jul 2023 14:09:46 -0400"},{"index":62,"header":"On agreeing to the resolution Agreed to by recorded vote: 220","actionItem":"208 (Roll no. 296).","actionTimeStamp":"Thu, 13 Jul 2023 14:09:43 -0400"},{"index":63,"header":"On ordering the previous question Agreed to by the Yeas and Nays: 214","actionItem":"207 (Roll no. 295).","actionTimeStamp":"Thu, 13 Jul 2023 13:56:33 -0400"},{"index":64,"header":"--","actionItem":"Considered as unfinished business. H. Res. 583 — \"Providing for further consideration of the bill (H.R. 2670) to authorize appropriations for fiscal year 2024 for military activities of the Department of Defense and for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\"","actionTimeStamp":"Thu, 13 Jul 2023 13:30:10 -0400"},{"index":65,"header":"UNFINISHED BUSINESS","actionItem":"The Chair announced the unfinished business was the question on ordering the previous question on H. Res. 583, and agreeing to the resolution if ordered, which had been debated earlier and on which further proceedings had been postponed.","actionTimeStamp":"Thu, 13 Jul 2023 13:30:08 -0400"},{"index":66,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of July 13.","actionTimeStamp":"Thu, 13 Jul 2023 13:30:07 -0400"},{"index":67,"header":"--","actionItem":"The Speaker announced that the House do now recess for a period of less than 15 minutes.","actionTimeStamp":"Thu, 13 Jul 2023 13:22:03 -0400"},{"index":68,"header":"The Speaker laid before the House a message from the President transmitting a notification stating that the national emergency with respect to hostage-taking and the wrongful detention of United States nationals abroad declared in Executive Order 14078 of July 19, 2022, is to continue in effect beyond July 19, 2023","actionItem":"referred to the Committee on Foreign Affairs and ordered to be printed (H. Doc. 118-52).","actionTimeStamp":"Thu, 13 Jul 2023 13:20:15 -0400"},{"index":69,"header":"--","actionItem":"The House received a message from the Acting Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Represenatives, the Acting Clerk transmitted a sealed envlope received from the White House on July 12, 2023, at 4:14 p.m., said to contain a message from the President regarding the Continuation of the National Emergency with Respect to Hostage-Taking and Wrongful Detention of United States Nationals Abroad.","actionTimeStamp":"Thu, 13 Jul 2023 13:20:14 -0400"},{"index":70,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on H. Res. 583, the Chair put the question on ordering the previous question and by voice announced the ayes had prevailed. Mr. McGovern demanded the yeas and nays and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jul 2023 13:19:55 -0400"},{"index":71,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 583.","actionTimeStamp":"Thu, 13 Jul 2023 12:25:33 -0400"},{"index":72,"header":"--","actionItem":"Considered as privileged matter. H. Res. 583 — \"Providing for further consideration of the bill (H.R. 2670) to authorize appropriations for fiscal year 2024 for military activities of the Department of Defense and for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\"","actionTimeStamp":"Thu, 13 Jul 2023 12:23:57 -0400"},{"index":73,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair, would be limited to 15 per side of the aisle.","actionTimeStamp":"Thu, 13 Jul 2023 12:06:06 -0400"},{"index":74,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Ms. Tokuda to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 13 Jul 2023 12:05:51 -0400"},{"index":75,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Thu, 13 Jul 2023 12:05:45 -0400"},{"index":76,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Thu, 13 Jul 2023 12:04:04 -0400"},{"index":77,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of July 13.","actionTimeStamp":"Thu, 13 Jul 2023 12:00:00 -0400"},{"index":78,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Thu, 13 Jul 2023 11:48:00 -0400"},{"index":79,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Thu, 13 Jul 2023 10:00:47 -0400"},{"index":80,"header":"--","actionItem":"The Speaker designated the Honorable John S. Duarte to act as Speaker pro tempore for today.","actionTimeStamp":"Thu, 13 Jul 2023 10:00:27 -0400"},{"index":81,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 13 Jul 2023 10:00:00 -0400"}]}