{"retrieved-date":"2026-2-4","actions-date":"Tuesday, February 3, 2026","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, February  3)","actionItem":"S.Res. 581 (Sen. Blunt Rochester):\n        A resolution honoring the life of Corporal Grade One Matthew T. \"Ty\" Snook of the Delaware State Police.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, February  3)","actionItem":"PN726-5:\n        David Clay Fowlkes, of Arkansas, to be United States District Judge for the Western District of Arkansas\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 54 - 40. Record Vote Number: 22 \n\n\n\n PN726-6:\n        Nicholas Jon Ganjei, of Texas, to be United States District Judge for the Southern District of Texas\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 49 - 44. Record Vote Number: 23 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 45. Record Vote Number: 24 \n\n\n\n PN726-11:\n        Justin R. Olson, of Indiana, to be United States District Judge for the Southern District of Indiana\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN726-12:\n        Aaron Christian Peterson, of Alaska, to be United States District Judge for the District of Alaska\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 55 - 39. Record Vote Number: 25 \n\n\n        -- Considered by Senate.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Banks, at  5:19 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}