{"retrieved-date":"2024-9-3","actions-date":"Thursday, August 1, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, August  1)","actionItem":"H.R. 7024 (Rep. Smith):\n        A bill to make improvements to the child tax credit, to provide tax incentives to promote economic growth, to provide special rules for the taxation of certain residents of Taiwan with income from sources within the United States, to provide tax relief with respect to certain Federal disasters, to make improvements to the low-income housing tax credit, and for other purposes.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Cloture on the motion to proceed to the measure not invoked in Senate by Yea-Nay Vote. 48 - 44. Record Vote Number: 230 \n\n\n        -- Motion by Senator Schumer to reconsider the vote by which cloture on the motion to proceed to the measure was not invoked (Record Vote No. 230) made in Senate.\n\n\n S. 211 (Sen. Peters):\n        A bill to authorize the Administrator of General Services to establish an enhanced use lease pilot program, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 3938 (Sen. Warner):\n        A bill to designate the community-based outpatient clinic of the Department of Veterans Affairs in Lynchburg, Virginia, as the \"Private First Class Desmond T. Doss VA Clinic\".\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 4199 (Sen. Young):\n        A bill to authorize additional district judges for the district courts and convert temporary judgeships.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 4235 (Sen. Hawley):\n        A bill to amend the Omnibus Crime Control and Safe Streets Act of 1968 to reauthorize grants to support for law enforcement officers and families, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 4367 (Sen. Carper):\n        A bill to provide for improvements to the rivers and harbors of the United States, to provide for the conservation and development of water and related resources, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute withdrawn by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3224 (Sen. Carper):\n        In the nature of a substitute.\n\n        --Amendment SA 3224 proposed by Senator Capito for Senator Carper.\n\n        --Amendment SA 3224 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 752 (Sen. Durbin):\n        A resolution expressing the condolences of the Senate and honoring the memory of the victims on the second anniversary of the mass shooting at the Fourth of July parade in Highland Park, Illinois, on July 4, 2022.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 753 (Sen. Ossoff):\n        A resolution calling for the immediate release of George Glezmann, a United States citizen who was wrongfully detained by the Taliban on December 5, 2022, and condemning the wrongful detention of all Americans by the Taliban.\n\n        -- Senate Committee on Foreign Relations discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 797 (Sen. Murkowski):\n        A resolution designating August 16, 2024, as \"National Airborne Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 798 (Sen. Tester):\n        A resolution commemorating the 75th Anniversary of the Mann Gulch fire by designating August 5, 2024, as \"Mann Gulch Memorial Tribute Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 799 (Sen. Grassley):\n        A resolution supporting the goals and ideals of Fentanyl Prevention and Awareness Day on August 21, 2024.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 800 (Sen. Barrasso):\n        A resolution condemning the attempted assassination of former President Donald J. Trump during a political rally in Butler, Pennsylvania, honoring the victims who were killed and injured at the rally, and calling for unity and civility in the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 801 (Sen. Britt):\n        A resolution honoring the life and enduring legacy of William \"Willie\" Howard Mays, Jr.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 802 (Sen. Wicker):\n        A resolution designating August 2024 as \"National Catfish Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, August  1)","actionItem":"PN440-2:\n        Andrew D. Ray, in the Coast Guard, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1116-2:\n        John C. Vann, in the Coast Guard, to be Rear Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1150:\n        Dafna Hochman Rand, of Maryland, to be Assistant Secretary of State for Democracy, Human Rights, and Labor\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1223:\n        Dorothy Camille Shea, of North Carolina, to be Deputy Representative of the United States of America to the United Nations, with the rank and status of Ambassador and the Deputy Representative of the United States of America in the Security Council of the United Nations\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 59 - 34. Record Vote Number: 229 \n\n\n\n PN1369:\n        David O. Barnett, Jr., of New Mexico, to be United States Marshal for the District of New Mexico for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1567:\n        Michael Louis Sulmeyer, of California, to be an Assistant Secretary of Defense\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1576:\n        Jeannette A. Vargas, of New York, to be United States District Judge for the Southern District of New York\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN1580:\n        Chad M. Cary, in the National Oceanic and Atmospheric Administration, to be Rear Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1748:\n        Adam B. Abelson, of Maryland, to be United States District Judge for the District of Maryland\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- By unanimous consent agreement, debate 9/9/2024.\n\n\n PN1803:\n        7 nominations in the Coast Guard beginning with Nicholas G. Derenzo and ending with Isaac Yates\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1804:\n        2 nominations in the Coast Guard beginning with Douglas D. Graul and ending with Benedict S. Gullo\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1900:\n        Philip J. Granati, in the Coast Guard, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1901:\n        4 nominations in the Coast Guard beginning with Derek A. Williams and ending with Trent J. Lamun\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  5:03 p.m, the Presiding Officer (Mr. Sanders in the chair) declared the Senate adjourned, under its order of today, until 12 noon tomorrow.","actionTimeStamp":"--"}]}