{"retrieved-date":"2025-12-3","actions-date":"Tuesday, December 2, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, December  2)","actionItem":"H.R. 4016 (Rep. Calvert):\n        A bill making appropriations for the Department of Defense for the fiscal year ending September 30, 2026, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n\n S.Res. 512 (Sen. Warnock):\n        A resolution designating November 30, 2025, as \"Drive Safer Sunday\".\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 520 (Sen. Thune):\n        An executive resolution authorizing the en bloc consideration in Executive Session of certain nominations on the Executive Calendar.\n\n        -- Motion to proceed to executive session to consideration of measure agreed to in Senate by Voice Vote.\n\n        -- Measure laid before Senate by motion.\n\n        -- Cloture motion on the measure presented in Senate.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, December  2)","actionItem":"PN520-1:\n        David A. Bragdon, of North Carolina, to be United States District Judge for the Middle District of North Carolina\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 45. Record Vote Number: 625 \n\n\n\n PN520-2:\n        Lindsey Ann Freeman, of North Carolina, to be United States District Judge for the Middle District of North Carolina\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 61 - 36. Record Vote Number: 626 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 60 - 39. Record Vote Number: 627","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Lee, at  5:30 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}