{"retrieved-date":"2024-3-8","actions-date":"Fri, 08 Mar 2024 12:23:23 -0500","actions-title":"House Floor Proceedings","actions-count":37,"actions-list":[{"index":1,"header":"--","actionItem":"The House adjourned pursuant to a previous special order. The next meeting is scheduled for 12:00 p.m. on March 11, 2024.","actionTimeStamp":"Fri, 08 Mar 2024 12:23:23 -0500"},{"index":2,"header":"--","actionItem":"On motion to adjourn Agreed to by voice vote.","actionTimeStamp":"Fri, 08 Mar 2024 12:23:22 -0500"},{"index":3,"header":"--","actionItem":"Mr. Hill moved that the House do now adjourn.","actionTimeStamp":"Fri, 08 Mar 2024 12:23:00 -0500"},{"index":4,"header":"SPECIAL ORDER SPEECHES","actionItem":"The House has concluded all anticipated legislative business and has proceeded to Special Order speeches.","actionTimeStamp":"Fri, 08 Mar 2024 11:23:01 -0500"},{"index":5,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with further one minute speeches.","actionTimeStamp":"Fri, 08 Mar 2024 10:56:56 -0500"},{"index":6,"header":"--","actionItem":"Mr. Ciscomani asked unanimous consent That when the House adjourns on Friday, March 8, 2024, it adjourn to meet on Monday, March 11, 2024, at noon for morning-hour debate and 2:00 p.m. for legislative business. Agreed to without objection.","actionTimeStamp":"Fri, 08 Mar 2024 10:56:09 -0500"},{"index":7,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Fri, 08 Mar 2024 10:55:46 -0500"},{"index":8,"header":"On passage Passed by recorded vote: 212","actionItem":"205 (Roll no. 78).","actionTimeStamp":"Fri, 08 Mar 2024 10:55:44 -0500"},{"index":9,"header":"On motion to recommit Failed by the Yeas and Nays: 205","actionItem":"213 (Roll no. 77).","actionTimeStamp":"Fri, 08 Mar 2024 10:49:05 -0500"},{"index":10,"header":"--","actionItem":"The previous question on the motion to recommit was ordered pursuant to clause 2(b) of rule XIX.","actionTimeStamp":"Fri, 08 Mar 2024 10:42:57 -0500"},{"index":11,"header":"--","actionItem":"Ms. Houlahan moved to recommit to the Committee on Financial Services.","actionTimeStamp":"Fri, 08 Mar 2024 10:42:43 -0500"},{"index":12,"header":"--","actionItem":"The House adopted the amendments en gross as agreed to by the Committee of the Whole House on the state of the Union.","actionTimeStamp":"Fri, 08 Mar 2024 10:41:42 -0500"},{"index":13,"header":"--","actionItem":"The previous question was ordered pursuant to the rule.","actionTimeStamp":"Fri, 08 Mar 2024 10:41:20 -0500"},{"index":14,"header":"--","actionItem":"The House rose from the Committee of the Whole House on the state of the Union to report H.R. 2799.","actionTimeStamp":"Fri, 08 Mar 2024 10:40:23 -0500"},{"index":15,"header":"On agreeing to the Waters amendment; Failed by recorded vote: 206","actionItem":"217 (Roll no. 76).","actionTimeStamp":"Fri, 08 Mar 2024 10:40:17 -0500"},{"index":16,"header":"On agreeing to the Lynch amendment; Failed by recorded vote: 208","actionItem":"211 (Roll no. 75).","actionTimeStamp":"Fri, 08 Mar 2024 10:35:43 -0500"},{"index":17,"header":"On agreeing to the Tlaib amendment; Failed by recorded vote: 204","actionItem":"212 (Roll no. 74).","actionTimeStamp":"Fri, 08 Mar 2024 10:31:21 -0500"},{"index":18,"header":"On agreeing to the Houlahan amendment; Failed by recorded vote: 200","actionItem":"203 (Roll no. 73).","actionTimeStamp":"Fri, 08 Mar 2024 10:26:20 -0500"},{"index":19,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Waters amendment No. 9, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Ms. Waters demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Fri, 08 Mar 2024 09:52:29 -0500"},{"index":20,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1052, the Committee of the Whole proceeded with 10 minutes of debate on the Waters amendment No. 9.","actionTimeStamp":"Fri, 08 Mar 2024 09:45:26 -0500"},{"index":21,"header":"--","actionItem":"An amendment, offered by Ms. Waters,  numbered 9 printed in Part B of House Report 118-407 to requi re any investment adviser, private fund, or an investment company that is subject to the bill to annually and publicly disclose their investments into women-owned, minority-owned, veteran-owned, rural-domiciled, and other businesses.","actionTimeStamp":"Fri, 08 Mar 2024 09:44:52 -0500"},{"index":22,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Lynch amendment No. 8, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Mr. Lynch demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Fri, 08 Mar 2024 09:44:26 -0500"},{"index":23,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1052, the Committee of the Whole proceeded with 10 minutes of debate on the Lynch amendment No. 8.","actionTimeStamp":"Fri, 08 Mar 2024 09:35:32 -0500"},{"index":24,"header":"--","actionItem":"An amendment, offered by Mr. Lynch,  numbered 8 printed in Part B of House Report 118-407 to provide that the bill may take effect only when the Securities and Exchange Commission, in consultation with State securities regulators, certifies to Congress that nothing in the bill will increase fraud.","actionTimeStamp":"Fri, 08 Mar 2024 09:34:49 -0500"},{"index":25,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Tlaib amendment No. 7, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Ms. Tlaib demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Fri, 08 Mar 2024 09:34:13 -0500"},{"index":26,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1052, the Committee of the Whole proceeded with 10 minutes of debate on the Tlaib amendment No. 7.","actionTimeStamp":"Fri, 08 Mar 2024 09:25:19 -0500"},{"index":27,"header":"--","actionItem":"An amendment, offered by Ms. Tlaib,  numbered 7 printed in Part B of House Report 118-407 to ensure that exemptions or benefits provided by the bill may only apply to companies that do not impose \"junk fees\" on customers.","actionTimeStamp":"Fri, 08 Mar 2024 09:25:03 -0500"},{"index":28,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Houlahan amendment No. 6, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Ms. Houlahan demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Fri, 08 Mar 2024 09:24:35 -0500"},{"index":29,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1052, the Committee of the Whole proceeded with 10 minutes of debate on the Houlahan amendment No. 6.","actionTimeStamp":"Fri, 08 Mar 2024 09:16:15 -0500"},{"index":30,"header":"--","actionItem":"An amendment, offered by Ms. Houlahan,  numbered 6 printed in Part B of House Report 118-407 to require the Advocate for Small Business Capital Formation to include in its report the effects of the failure of Silicon Valley Bank on community banks and small business lending.","actionTimeStamp":"Fri, 08 Mar 2024 09:15:56 -0500"},{"index":31,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Fri, 08 Mar 2024 09:14:48 -0500"},{"index":32,"header":"--","actionItem":"Considered as unfinished business. H.R. 2799 — \"To make reforms to the capital markets of the United States, and for other purposes.\"","actionTimeStamp":"Fri, 08 Mar 2024 09:14:29 -0500"},{"index":33,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair would be limited to 5 per side of the aisle.","actionTimeStamp":"Fri, 08 Mar 2024 09:03:40 -0500"},{"index":34,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Tonko to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Fri, 08 Mar 2024 09:02:01 -0500"},{"index":35,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Fri, 08 Mar 2024 09:01:57 -0500"},{"index":36,"header":"--","actionItem":"Today's prayer was offered by Reverend Sean Raftis, St. Charles Borromeo Church, Whitefish, Montana","actionTimeStamp":"Fri, 08 Mar 2024 09:00:24 -0500"},{"index":37,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Fri, 08 Mar 2024 09:00:00 -0500"}]}