{"retrieved-date":"2023-12-11","actions-date":"Thursday, December 7, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, December  7)","actionItem":"H.R. 815 (Rep. Rodgers):\n        A bill to amend title 38, United States Code, to make certain improvements relating to the eligibility of veterans to receive reimbursement for emergency treatment furnished through the Veterans Community Care program, and for other purposes .\n\n        -- Motion to proceed to measure considered in Senate.\n\n\n H.R. 2670 (Rep. Rogers):\n        A bill to authorize appropriations for fiscal year 2024 for military activities of the Department of Defense and for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\n\n        -- Conference papers: Senate report and manager's statement and official papers held at the desk in Senate.\n\n        -- Motion to proceed to consideration of the conference report to accompany H .R. 2670, agreed to in Senate by Yea-Nay Vote. 82 - 15. Record Vote Number:334 \n\n\n        -- Conference report considered in Senate.\n\n        -- Cloture motion on the conference report to accompany H.R. 2670 presented in Senate.\n\n        -- Motion by Senator Schumer to recommit the conference report to accompany H .R. 2670 to the committee on conference with instructions made in Senate.\n \n\n S.Amdt. 1373 (Sen. Schumer):\n        To modify the effective date.\n\n        --Amendment SA 1373 proposed by Senator Schumer to the instructions of the motion to recommit the conference report to accompany H.R. 2670 to the committee on conference.\n\n\n S.Amdt. 1374 (Sen. Schumer):\n        To modify the effective date.\n\n        --Amendment SA 1374 proposed by Senator Schumer to Amendment SA 1373.\n\n\n\n\n S.Res. 492 (Sen. Warnock):\n        A resolution honoring the life of the First Lady Rosalynn Carter.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, December  7)","actionItem":"PN362-3:\n        Col. Andrew O. Saslav, in the Army, to be Brigadier General\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN876:\n        Harry Coker, Jr., of Kansas, to be National Cyber Director\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN904:\n        Richard E.N. Federico, of Kansas, to be United States Circuit Judge for the Tenth Circuit\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 63 - 32. Record Vote Number: 335 \n\n\n\n PN948:\n        6 nominations in the Coast Guard beginning with Capt. Jason P. Tama and ending with Capt. Zeita Merchant\n\n        -- Reported by Senator Cantwell, Committee on Commerce, Science, and Transportation, without printed report.\n\n        -- Placed on Senate Executive Calendar. Calendar No. 443. Subject to nominee's commitment to respond to requests to appear and testify before any duly constituted committee of the Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1108:\n        212 nominations in the Coast Guard beginning with Mark R. Allen and ending with James B. Zorn\n\n        -- Reported by Senator Cantwell, Committee on Commerce, Science, and Transportation, without printed report.\n\n        -- Placed on Senate Executive Calendar. Calendar No. DESK. Subject to nominee's commitment to respond to requests to appear and testify before any duly constituted committee of the Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1111:\n        11 nominations in the Coast Guard beginning with Lori A. Archer and ending with Sharon E. Russell\n\n        -- Reported by Senator Cantwell, Committee on Commerce, Science, and Transportation, without printed report.\n\n        -- Placed on Senate Executive Calendar. Calendar No. DESK. Subject to nominee's commitment to respond to requests to appear and testify before any duly constituted committee of the Senate.\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  4:50 p.m, the Presiding Officer (Mr. Fetterman in the chair) declared the Senate adjourned, under its order of today, until  3 p.m. on Monday, December 11, 2023.","actionTimeStamp":"--"}]}