{"retrieved-date":"2026-2-27","actions-date":"Wednesday, February 25, 2026","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, February 25)","actionItem":"S.Res. 602 (Sen. Klobuchar):\n        A resolution supporting the United States Olympic and Paralympic Teams in the 2026 Olympic and Paralympic Winter Games.\n\n        -- Senate Committee on Commerce, Science, and Transportation discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and an amended preamble by Unanimous Consent.\n \n\n S.Amdt. 4302 (Sen. Klobuchar):\n        To modify the number of medals won by Team USA.\n\n        --Amendment SA 4302 proposed by Senator Moreno for Senator Klobuchar.\n\n        --Amendment SA 4302 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 613 (Sen. Sheehy):\n        A resolution recognizing the Army-Navy football game as America's Game.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 614 (Sen. Durbin):\n        A resolution designating February 2026 as \"American Heart Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 615 (Sen. Booker):\n        A resolution celebrating Black History Month.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, February 25)","actionItem":"PN730-19:\n        John DeLeeuw, of Texas, to be a Member of the National Transportation Safety Board for the remainder of the term expiring December 31, 2026\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 45. Record Vote Number: 40 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 45. Record Vote Number: 41 \n\n\n\n PN730-46:\n        Ryan McCormack, of Virginia, to be Under Secretary of Transportation for Policy\n\n        -- Motion to proceed to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate 2/26/2026.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Moreno, at  6:06 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}