{"retrieved-date":"2025-10-15","actions-date":"Tuesday, October 14, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Friday, October 10, 2025,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Friday, October 10, 2025, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, October 14)","actionItem":"H.R. 4016 (Rep. Calvert):\n        A bill making appropriations for the Department of Defense for the fiscal year ending September 30, 2026, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.\n\n\n H.R. 5371 (Rep. Cole):\n        A bill making continuing appropriations and extensions for fiscal year 2026, and for other purposes .\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Fourth cloture motion on the motion to proceed to the measure not invoked in Senate by Yea-Nay Vote. 49 - 45. Record Vote Number: 571 \n\n\n        -- Motion by Senator Thune to reconsider the vote by which the fourth cloture on the motion to proceed to H.R. 5371 was not invoked (Record Vote No. 571) entered in Senate.\n\n        -- Fifth cloture motion on the motion to proceed to the measure presented in Senate.\n\n        -- Motion to proceed to consideration of measure withdrawn in Senate.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, October 14)","actionItem":"PN466-6:\n        Harold D. Mooty III, of Alabama, to be United States District Judge for the Northern District of Alabama\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  6:31 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}