{"retrieved-date":"2023-11-15","actions-date":"Wed, 15 Nov 2023 01:01:38 -0500","actions-title":"House Floor Proceedings","actions-count":317,"actions-list":[{"index":1,"header":"--","actionItem":"The House adjourned pursuant to a previous special order. The next meeting is scheduled for 9:00 a.m. on November 15, 2023.","actionTimeStamp":"Wed, 15 Nov 2023 01:01:38 -0500"},{"index":2,"header":"--","actionItem":"On motion to adjourn Agreed to by voice vote.","actionTimeStamp":"Wed, 15 Nov 2023 01:01:35 -0500"},{"index":3,"header":"--","actionItem":"Mr. Aderholt moved that the House do now adjourn.","actionTimeStamp":"Wed, 15 Nov 2023 01:01:30 -0500"},{"index":4,"header":"--","actionItem":"Mr. Aderholt asked unanimous consent that when the House adjourns today, it adjourn to meet at 9:00 a.m. on November 15. Agreed to without objection.","actionTimeStamp":"Wed, 15 Nov 2023 01:01:19 -0500"},{"index":5,"header":"The Speaker laid before the House a message from the President transmitting a notification stating that it is in the national security interests of the United States to extend the partial termination date specified in subsection (i)(1) of section 130i of title 10, United States Code, by 180 days","actionItem":"referred to the Committees on Armed Services and Transportation and Infrastructure and ordered to be printed (H. Doc. 118-82).","actionTimeStamp":"Wed, 15 Nov 2023 01:00:30 -0500"},{"index":6,"header":"--","actionItem":"Committee of the Whole House on the state of the Union rises leaving H.R. 5894 as unfinished business.","actionTimeStamp":"Wed, 15 Nov 2023 00:59:52 -0500"},{"index":7,"header":"--","actionItem":"On motion that the committee rise Agreed to by voice vote.","actionTimeStamp":"Wed, 15 Nov 2023 00:59:39 -0500"},{"index":8,"header":"--","actionItem":"Mr. Aderholt moved that the committee rise.","actionTimeStamp":"Wed, 15 Nov 2023 00:59:23 -0500"},{"index":9,"header":"--","actionItem":"On agreeing to the Lawler amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 15 Nov 2023 00:59:06 -0500"},{"index":10,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Lawler amendment No. 146.","actionTimeStamp":"Wed, 15 Nov 2023 00:47:34 -0500"},{"index":11,"header":"--","actionItem":"An amendment, offered by Mr. Lawler,  numbered 146 printed in Part B of House Report 118-272 to increase funding for Head Start.","actionTimeStamp":"Wed, 15 Nov 2023 00:47:32 -0500"},{"index":12,"header":"--","actionItem":"On agreeing to the Van Duyne amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 15 Nov 2023 00:47:18 -0500"},{"index":13,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Van Duyne amendment No. 144.","actionTimeStamp":"Wed, 15 Nov 2023 00:42:01 -0500"},{"index":14,"header":"--","actionItem":"An amendment, offered by Ms. Van Duyne,  numbered 144 printed in Part B of House Report 118-272 to prohibit funds from being used to enforce ASC-20 of the Ambulatory Surgical Center Quality Reporting Program (ASCQR) which requires ASCs to report their COVID-19 Vaccination Coverage Among Health Care Personnel data.","actionTimeStamp":"Wed, 15 Nov 2023 00:42:00 -0500"},{"index":15,"header":"--","actionItem":"On agreeing to the Tenney amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 15 Nov 2023 00:41:42 -0500"},{"index":16,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Tenney amendment No. 143.","actionTimeStamp":"Wed, 15 Nov 2023 00:34:10 -0500"},{"index":17,"header":"--","actionItem":"An amendment, offered by Ms. Tenney,  numbered 143 printed in Part B of House Report 118-272 to prohibit funding for Executive Order 14019.","actionTimeStamp":"Wed, 15 Nov 2023 00:33:29 -0500"},{"index":18,"header":"--","actionItem":"On agreeing to the Smucker amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 15 Nov 2023 00:33:12 -0500"},{"index":19,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Smucker amendment No. 142.","actionTimeStamp":"Wed, 15 Nov 2023 00:27:22 -0500"},{"index":20,"header":"--","actionItem":"An amendment, offered by Mr. Smucker,  numbered 142 printed in Part B of House Report 118-272 to prohibit the Department of Education from using funds to implement, administer, or enforce a provision of their Oct. 31 final rule that would prohibit education and training programs from exceeding their state's minimum hours requirements.","actionTimeStamp":"Wed, 15 Nov 2023 00:27:19 -0500"},{"index":21,"header":"--","actionItem":"On agreeing to the Schweikert amendment; Failed by voice vote.","actionTimeStamp":"Wed, 15 Nov 2023 00:27:02 -0500"},{"index":22,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Schweikert amendment No. 140.","actionTimeStamp":"Wed, 15 Nov 2023 00:16:18 -0500"},{"index":23,"header":"--","actionItem":"An amendment, offered by Mr. Schweikert,  numbered 140 printed in Part B of House Report 118-272 to reduce each amount appropriated or otherwise made available by this Act that is not required to be appropriated or made available by a provision of law by 26.2 percent, equal to the amount that entities with taxing authority receive in the bill.","actionTimeStamp":"Wed, 15 Nov 2023 00:16:17 -0500"},{"index":24,"header":"--","actionItem":"On agreeing to the Schweikert amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 15 Nov 2023 00:16:05 -0500"},{"index":25,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Schweikert amendment No. 139.","actionTimeStamp":"Wed, 15 Nov 2023 00:10:56 -0500"},{"index":26,"header":"--","actionItem":"An amendment, offered by Mr. Schweikert,  numbered 139 printed in Part B of House Report 118-272 to increase funding by $2 million for the CDC \"Emerging Zoonotic and Infectious Disease\" account with the intention that these funds be used for Coccidioidomycosis otherwise known as \"Valley Fever.\" Offsets the increase with a decrease in funding of $2 million from the General Departmental Management account under the Office of the Secretary of Health and Human Services.","actionTimeStamp":"Wed, 15 Nov 2023 00:10:54 -0500"},{"index":27,"header":"--","actionItem":"On agreeing to the Schweikert amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 15 Nov 2023 00:10:31 -0500"},{"index":28,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Schweikert amendment No. 138.","actionTimeStamp":"Wed, 15 Nov 2023 00:06:30 -0500"},{"index":29,"header":"--","actionItem":"An amendment, offered by Mr. Schweikert,  numbered 138 printed in Part B of House Report 118-272 to increase funding for the National Eye Institute by $5 million for the development of autonomous eye screening for diabetic retinopathy. Offsets the increase with a decrease in funding of $5 million from the General Departmental Management account under the Office of the Secretary of Health and Human Services.","actionTimeStamp":"Wed, 15 Nov 2023 00:06:28 -0500"},{"index":30,"header":"--","actionItem":"On agreeing to the Santos amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 15 Nov 2023 00:06:09 -0500"},{"index":31,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Santos amendment No. 137.","actionTimeStamp":"Wed, 15 Nov 2023 00:01:28 -0500"},{"index":32,"header":"--","actionItem":"An amendment, offered by Mr. Santos,  numbered 137 printed in Part B of House Report 118-272 to prohibit funds from being used to establish, implement, or enforce any vaccine mandate.","actionTimeStamp":"Wed, 15 Nov 2023 00:01:26 -0500"},{"index":33,"header":"--","actionItem":"On agreeing to the Roy amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 15 Nov 2023 00:01:17 -0500"},{"index":34,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 136.","actionTimeStamp":"Tue, 14 Nov 2023 23:52:23 -0500"},{"index":35,"header":"--","actionItem":"An amendment, offered by Mr. Roy,  numbered 136 printed in Part B of House Report 118-272 to prohibit funds appropriated by this Act to implement certain executive orders regarding climate change.","actionTimeStamp":"Tue, 14 Nov 2023 23:52:21 -0500"},{"index":36,"header":"--","actionItem":"By unanimous consent, the Rosendale amendment was withdrawn.","actionTimeStamp":"Tue, 14 Nov 2023 23:52:02 -0500"},{"index":37,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Rosendale amendment No. 135.","actionTimeStamp":"Tue, 14 Nov 2023 23:46:24 -0500"},{"index":38,"header":"--","actionItem":"An amendment, offered by Mr. Rosendale,  numbered 135 printed in Part B of House Report 118-272 to prohibit funds from being used to implement the proposed rule titled \"Unaccompanied Children Program Foundational Rule\" issued by the Administration for Children and Families.","actionTimeStamp":"Tue, 14 Nov 2023 23:46:22 -0500"},{"index":39,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Rosendale amendment No. 134, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. DeLauro demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 23:45:40 -0500"},{"index":40,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Rosendale amendment No. 134.","actionTimeStamp":"Tue, 14 Nov 2023 23:35:08 -0500"},{"index":41,"header":"--","actionItem":"An amendment, offered by Mr. Rosendale,  numbered 134 printed in Part B of House Report 118-272 to reduce the salary of Vincent Munster, Chief, Virus Ecology Section, National Institute of Allergy and Infectious Diseases to $1.","actionTimeStamp":"Tue, 14 Nov 2023 23:35:05 -0500"},{"index":42,"header":"--","actionItem":"On agreeing to the Rosendale amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 23:34:55 -0500"},{"index":43,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Rosendale amendment No. 133.","actionTimeStamp":"Tue, 14 Nov 2023 23:31:29 -0500"},{"index":44,"header":"--","actionItem":"An amendment, offered by Mr. Rosendale,  numbered 133 printed in Part B of House Report 118-272 to prohibit funds made available by this Act from conducting or supporting any gain-of-function research involving a potential pandemic pathogen by Rocky Mountain Laboratories.","actionTimeStamp":"Tue, 14 Nov 2023 23:31:27 -0500"},{"index":45,"header":"--","actionItem":"On agreeing to the Pfluger amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 23:31:05 -0500"},{"index":46,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Pfluger amendment No. 132.","actionTimeStamp":"Tue, 14 Nov 2023 23:24:10 -0500"},{"index":47,"header":"--","actionItem":"An amendment, offered by Mr. Pfluger,  numbered 132 printed in Part B of House Report 118-272 to prohibit funding to finalize, implement or enforce policies in CMS's policies included in the informational bulletin promulgated by the Centers for Medicare &amp; Medicaid Services Center for Medicaid &amp; CHIP Services on February 17, 2023, and proposed limitation for state directed payments as stated in the May 3, 2023, proposed rule titled \"Medicaid Program; Medicaid and Children's Health Insurance Program (CHIP) Managed Care Access, Finance, and Quality.\"","actionTimeStamp":"Tue, 14 Nov 2023 23:24:07 -0500"},{"index":48,"header":"--","actionItem":"On agreeing to the Perry amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 23:23:53 -0500"},{"index":49,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 131.","actionTimeStamp":"Tue, 14 Nov 2023 23:13:16 -0500"},{"index":50,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 131 printed in Part B of House Report 118-272 to prohibit the use of funds to implement or enforce the decision entitled \"Cemex Construction Materials Pacific, LLC.\"","actionTimeStamp":"Tue, 14 Nov 2023 23:13:14 -0500"},{"index":51,"header":"--","actionItem":"On agreeing to the Perry amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 23:12:57 -0500"},{"index":52,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 130.","actionTimeStamp":"Tue, 14 Nov 2023 23:03:35 -0500"},{"index":53,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 130 printed in Part B of House Report 118-272 to prohibit the use of funds for the National Labor Relations Board to implement, administer, or enforce the \"Representation-Case Procedures\" rule.","actionTimeStamp":"Tue, 14 Nov 2023 23:03:19 -0500"},{"index":54,"header":"--","actionItem":"On agreeing to the Perry amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 23:03:00 -0500"},{"index":55,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 129.","actionTimeStamp":"Tue, 14 Nov 2023 22:53:28 -0500"},{"index":56,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 129 printed in Part B of House Report 118-272 to prohibit the use of funds for the Mine Safety and Health Administration to finalize, implement, or enforce the proposed rule entitled, \"Lowering Miners' Exposure to Respirable Crystalline Silica and Improving Respiratory Protection.\"","actionTimeStamp":"Tue, 14 Nov 2023 22:53:10 -0500"},{"index":57,"header":"--","actionItem":"On agreeing to the Ogles amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 22:52:53 -0500"},{"index":58,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 128.","actionTimeStamp":"Tue, 14 Nov 2023 22:45:01 -0500"},{"index":59,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 128 printed in Part B of House Report 118-272 to prohibit funds for Guidance issued by the Secretary of Health and Human Services titled \"Gender Identity Non- Discrimination and Inclusion Policy for Employees and Applicants.\"","actionTimeStamp":"Tue, 14 Nov 2023 22:44:45 -0500"},{"index":60,"header":"--","actionItem":"On agreeing to the Ogles amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 22:44:28 -0500"},{"index":61,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 127.","actionTimeStamp":"Tue, 14 Nov 2023 22:40:08 -0500"},{"index":62,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 127 printed in Part B of House Report 118-272 to prohibit funds from being used to impose a COVID-19 mask mandate.","actionTimeStamp":"Tue, 14 Nov 2023 22:39:52 -0500"},{"index":63,"header":"--","actionItem":"On agreeing to the Murphy amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 22:39:34 -0500"},{"index":64,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Murphy amendment No. 126.","actionTimeStamp":"Tue, 14 Nov 2023 22:30:06 -0500"},{"index":65,"header":"--","actionItem":"An amendment, offered by Mr. Murphy,  numbered 126 printed in Part B of House Report 118-272 to prohibit funds from being used to finalize, implement, or enforce the proposed rule entitled: \"Medicare and Medicaid Programs: Minimum Staffing Standards for Long-Term Care Facilities and Medicaid Institutional Payment Transparency Reporting (CMS 3442-P)\".","actionTimeStamp":"Tue, 14 Nov 2023 22:29:47 -0500"},{"index":66,"header":"--","actionItem":"On agreeing to the Moore (UT) amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 22:29:30 -0500"},{"index":67,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Moore (UT) amendment No. 124.","actionTimeStamp":"Tue, 14 Nov 2023 22:26:23 -0500"},{"index":68,"header":"--","actionItem":"An amendment, offered by Mr. Moore (UT),  numbered 124 printed in Part B of House Report 118-272 to increase and decrease funding for the U.S. Department of Health and Human Services HRSA-Wide Activities and Programs Support account to urge HRSA to provide Congress an accounting of unpaid and partially paid claims by HRSA's COVID-19 Uninsured Program, an accounting of funding to pay these claims since its initiation, including instances in which funding intended for this program was diverted to other activities, and a plan for payment of legitimate claims still outstanding for services provided under this program.","actionTimeStamp":"Tue, 14 Nov 2023 22:26:16 -0500"},{"index":69,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Miller-Meeks amendment No. 123, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Ms. DeLauro demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 22:25:56 -0500"},{"index":70,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Miller-Meeks amendment No. 123.","actionTimeStamp":"Tue, 14 Nov 2023 22:18:54 -0500"},{"index":71,"header":"--","actionItem":"An amendment, offered by Mrs. Miller-Meeks,  numbered 123 printed in Part B of House Report 118-272 to prohibit funding for Centers for Disease Control and Prevention's firearm injury and mortality prevention research.","actionTimeStamp":"Tue, 14 Nov 2023 22:18:35 -0500"},{"index":72,"header":"--","actionItem":"On agreeing to the Murphy amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 22:18:10 -0500"},{"index":73,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Murphy amendment No. 122.","actionTimeStamp":"Tue, 14 Nov 2023 22:15:15 -0500"},{"index":74,"header":"--","actionItem":"An amendment, offered by Mr. Murphy,  numbered 122 printed in Part B of House Report 118-272 to prevent funds from being used to finalize, implement, or enforce the proposed rule published by the Department of Health and Human Services entitled \"Medicaid Program; Misclassification of Drugs, Program Administration and Program Integrity Updates Under the Medicaid Drug Rebate Program\"","actionTimeStamp":"Tue, 14 Nov 2023 22:15:03 -0500"},{"index":75,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Miller (IL) amendment No. 121, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Ms. DeLauro demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 22:14:31 -0500"},{"index":76,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Miller (IL) amendment No. 121.","actionTimeStamp":"Tue, 14 Nov 2023 22:07:29 -0500"},{"index":77,"header":"--","actionItem":"An amendment, offered by Mrs. Miller (IL),  numbered 121 printed in Part B of House Report 118-272 to prohibit funds for the Office of Population Affairs.","actionTimeStamp":"Tue, 14 Nov 2023 22:07:10 -0500"},{"index":78,"header":"--","actionItem":"On agreeing to the Miller (IL) amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 22:06:52 -0500"},{"index":79,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Miller (IL) amendment No. 120.","actionTimeStamp":"Tue, 14 Nov 2023 22:03:23 -0500"},{"index":80,"header":"--","actionItem":"An amendment, offered by Mrs. Miller (IL),  numbered 120 printed in Part B of House Report 118-272 to prohibit funds to the World Health Organization.","actionTimeStamp":"Tue, 14 Nov 2023 22:03:07 -0500"},{"index":81,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Miller (IL) amendment No. 119, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Ms. DeLauro demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 22:02:23 -0500"},{"index":82,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Miller (IL) amendment No. 119.","actionTimeStamp":"Tue, 14 Nov 2023 21:58:00 -0500"},{"index":83,"header":"--","actionItem":"An amendment, offered by Mrs. Miller (IL),  numbered 119 printed in Part B of House Report 118-272 to reduce the salary of Douglas L. Parker, Assistant Secretary of Labor for Occupational Safety and Health, to $1.","actionTimeStamp":"Tue, 14 Nov 2023 21:57:45 -0500"},{"index":84,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Miller (IL) amendment No. 118, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Ms. DeLauro demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 21:57:21 -0500"},{"index":85,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Miller (IL) amendment No. 118.","actionTimeStamp":"Tue, 14 Nov 2023 21:51:56 -0500"},{"index":86,"header":"--","actionItem":"An amendment, offered by Mrs. Miller (IL),  numbered 118 printed in Part B of House Report 118-272 to reduce the salary of Catherine E. Lhamon, Assistant Secretary for Civil Rights at the U.S. Department of Education, to $1.","actionTimeStamp":"Tue, 14 Nov 2023 21:51:38 -0500"},{"index":87,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the McCormick amendment No. 117, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Ms. DeLauro demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 21:51:10 -0500"},{"index":88,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the McCormick amendment No. 117.","actionTimeStamp":"Tue, 14 Nov 2023 21:43:48 -0500"},{"index":89,"header":"--","actionItem":"An amendment, offered by Mr. McCormick,  numbered 117 printed in Part B of House Report 118-272 to reduce the salary of Xavier Becerra, Secretary of the Department of Health and Human Services, to $1.","actionTimeStamp":"Tue, 14 Nov 2023 21:43:30 -0500"},{"index":90,"header":"--","actionItem":"On agreeing to the Massie amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 21:43:04 -0500"},{"index":91,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Massie amendment No. 116.","actionTimeStamp":"Tue, 14 Nov 2023 21:36:47 -0500"},{"index":92,"header":"--","actionItem":"An amendment, offered by Mr. Massie,  numbered 116 printed in Part B of House Report 118-272 to prohibit funds from being made available to conduct or support gain of function research.","actionTimeStamp":"Tue, 14 Nov 2023 21:36:33 -0500"},{"index":93,"header":"--","actionItem":"On agreeing to the Massie amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 21:36:15 -0500"},{"index":94,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Massie amendment No. 115.","actionTimeStamp":"Tue, 14 Nov 2023 21:31:34 -0500"},{"index":95,"header":"--","actionItem":"An amendment, offered by Mr. Massie,  numbered 115 printed in Part B of House Report 118-272 to prohibit funds from being used to fund any grant related to any transgenic edible vaccine.","actionTimeStamp":"Tue, 14 Nov 2023 21:31:17 -0500"},{"index":96,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Lawler amendment No. 114, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Lawler demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 21:30:55 -0500"},{"index":97,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Lawler amendment No. 114.","actionTimeStamp":"Tue, 14 Nov 2023 21:25:39 -0500"},{"index":98,"header":"--","actionItem":"An amendment, offered by Mr. Lawler,  numbered 114 printed in Part B of House Report 118-272 to prohibit funding under this Act from going toward colleges and universities that authorize, facilitate, provide funding for, or otherwise support any event promoting antisemitism on campus.","actionTimeStamp":"Tue, 14 Nov 2023 21:25:24 -0500"},{"index":99,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Higgins (LA) amendment No. 113, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Ms. DeLauro demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 21:25:01 -0500"},{"index":100,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Higgins (LA) amendment No. 113.","actionTimeStamp":"Tue, 14 Nov 2023 21:20:27 -0500"},{"index":101,"header":"--","actionItem":"An amendment, offered by Mr. Higgins (LA),  numbered 113 printed in Part B of House Report 118-272 to reduce the salary of William O'Dell, District Manager in Dallas, Texas, of the Mine Safety and Health Administration, to $1.","actionTimeStamp":"Tue, 14 Nov 2023 21:20:11 -0500"},{"index":102,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Higgins (LA) amendment No. 112, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Ms. DeLauro demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 21:19:44 -0500"},{"index":103,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Higgins (LA) amendment No. 112.","actionTimeStamp":"Tue, 14 Nov 2023 21:14:08 -0500"},{"index":104,"header":"--","actionItem":"An amendment, offered by Mr. Higgins (LA),  numbered 112 printed in Part B of House Report 118-272 to reduce the salary of Christopher Williamson, Assistant Secretary of the Mine Safety and Health Administration, to $1.","actionTimeStamp":"Tue, 14 Nov 2023 21:13:48 -0500"},{"index":105,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Hern amendment No. 111, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Hern demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 21:13:06 -0500"},{"index":106,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Hern amendment No. 111.","actionTimeStamp":"Tue, 14 Nov 2023 21:11:02 -0500"},{"index":107,"header":"--","actionItem":"An amendment, offered by Mr. Hern,  numbered 111 printed in Part B of House Report 118-272 to ensure the Department of Health and Human Services implements consumer protections passed in the surprise billing law that provides patients with an advanced cost estimate for their healthcare services.","actionTimeStamp":"Tue, 14 Nov 2023 21:10:48 -0500"},{"index":108,"header":"--","actionItem":"On agreeing to the Hern amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 21:10:27 -0500"},{"index":109,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Hern amendment No. 110.","actionTimeStamp":"Tue, 14 Nov 2023 20:59:36 -0500"},{"index":110,"header":"--","actionItem":"An amendment, offered by Mr. Hern,  numbered 110 printed in Part B of House Report 118-272 to prohibit funds from being used for a Confucius Classroom.","actionTimeStamp":"Tue, 14 Nov 2023 20:59:19 -0500"},{"index":111,"header":"--","actionItem":"By unanimous consent, the McCormick amendment was withdrawn.","actionTimeStamp":"Tue, 14 Nov 2023 20:58:57 -0500"},{"index":112,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the McCormick amendment No. 109.","actionTimeStamp":"Tue, 14 Nov 2023 20:54:33 -0500"},{"index":113,"header":"--","actionItem":"An amendment, offered by Mr. McCormick,  numbered 109 printed in Part B of House Report 118-272 to limit the amount that the National Institutes of Health provides grantees for facilities and administrative costs to 30% of the total grant.","actionTimeStamp":"Tue, 14 Nov 2023 20:54:16 -0500"},{"index":114,"header":"--","actionItem":"On agreeing to the Hageman amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 20:53:43 -0500"},{"index":115,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Hageman amendment No. 108.","actionTimeStamp":"Tue, 14 Nov 2023 20:48:56 -0500"},{"index":116,"header":"--","actionItem":"An amendment, offered by Ms. Hageman,  numbered 108 printed in Part B of House Report 118-272 to prohibit funds made available by this Act from being used to carry out educational priorities, including invitational priorities, concerning the American History and Civics Education programs, and referenced in 86 FR 20348 relating to \"Proposed Priorities American History and Civics Education.\"","actionTimeStamp":"Tue, 14 Nov 2023 20:48:37 -0500"},{"index":117,"header":"--","actionItem":"On agreeing to the Hageman amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 20:48:19 -0500"},{"index":118,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Hageman amendment No. 107.","actionTimeStamp":"Tue, 14 Nov 2023 20:44:18 -0500"},{"index":119,"header":"--","actionItem":"An amendment, offered by Ms. Hageman,  numbered 107 printed in Part B of House Report 118-272 to prohibit funds made available by this Act from being used to implement or carry out the strategies provided by the Department of Education's September 2023 report titled \"Strategies for Increasing Diversity and Opportunity in Higher Education.\"","actionTimeStamp":"Tue, 14 Nov 2023 20:43:48 -0500"},{"index":120,"header":"--","actionItem":"On agreeing to the Hageman amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 20:43:27 -0500"},{"index":121,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Hageman amendment No. 106.","actionTimeStamp":"Tue, 14 Nov 2023 20:39:03 -0500"},{"index":122,"header":"--","actionItem":"An amendment, offered by Ms. Hageman,  numbered 106 printed in Part B of House Report 118-272 to prohibit the Department of Labor from administering environmental justice grant programs.","actionTimeStamp":"Tue, 14 Nov 2023 20:38:48 -0500"},{"index":123,"header":"--","actionItem":"On agreeing to the Hageman amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 20:38:29 -0500"},{"index":124,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Hageman amendment No. 105.","actionTimeStamp":"Tue, 14 Nov 2023 20:34:16 -0500"},{"index":125,"header":"--","actionItem":"An amendment, offered by Ms. Hageman,  numbered 105 printed in Part B of House Report 118-272 to prohibit the Department of Labor from providing climate literacy training.","actionTimeStamp":"Tue, 14 Nov 2023 20:33:58 -0500"},{"index":126,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Greene (GA) amendment No. 104, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Ms. DeLauro demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 20:33:26 -0500"},{"index":127,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 104.","actionTimeStamp":"Tue, 14 Nov 2023 20:20:46 -0500"},{"index":128,"header":"--","actionItem":"An amendment, offered by Ms. Greene (GA),  numbered 104 printed in Part B of House Report 118-272 to reduce the salary of Miguel Cardona, Secretary of Education, to $1.","actionTimeStamp":"Tue, 14 Nov 2023 20:20:25 -0500"},{"index":129,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Greene (GA) amendment No. 103, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Ms. DeLauro demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 20:19:57 -0500"},{"index":130,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 103.","actionTimeStamp":"Tue, 14 Nov 2023 20:10:07 -0500"},{"index":131,"header":"--","actionItem":"An amendment, offered by Ms. Greene (GA),  numbered 103 printed in Part B of House Report 118-272 to reduce the salary of Rachel Levine, Assistant Secretary for Health, to $1.","actionTimeStamp":"Tue, 14 Nov 2023 20:09:53 -0500"},{"index":132,"header":"--","actionItem":"On agreeing to the Greene (GA) amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 20:09:30 -0500"},{"index":133,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 102.","actionTimeStamp":"Tue, 14 Nov 2023 20:01:24 -0500"},{"index":134,"header":"--","actionItem":"An amendment, offered by Ms. Greene (GA),  numbered 102 printed in Part B of House Report 118-272 to prohibit funding for vaccine mandates.","actionTimeStamp":"Tue, 14 Nov 2023 20:01:08 -0500"},{"index":135,"header":"--","actionItem":"On agreeing to the Greene (GA) amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 20:00:50 -0500"},{"index":136,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 101.","actionTimeStamp":"Tue, 14 Nov 2023 19:53:53 -0500"},{"index":137,"header":"--","actionItem":"An amendment, offered by Ms. Greene (GA),  numbered 101 printed in Part B of House Report 118-272 to prohibit funding for the implementation of the Centers for Disease Control and Prevention's recommendation to add the Covid vaccine to the child and adolescent immunization schedule.","actionTimeStamp":"Tue, 14 Nov 2023 19:53:38 -0500"},{"index":138,"header":"--","actionItem":"On agreeing to the Graves (LA) amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 19:53:12 -0500"},{"index":139,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Graves (LA) amendment No. 100.","actionTimeStamp":"Tue, 14 Nov 2023 19:48:24 -0500"},{"index":140,"header":"--","actionItem":"An amendment, offered by Mr. Graves (LA),  numbered 100 printed in Part B of House Report 118-272 to prohibit the use of funds to promulgate new major rules if the Office of Management and Budget determines that the regulation is likely to result in a significant impact on the economy, a major increase in prices for consumers, or adverse effects on American global competition.","actionTimeStamp":"Tue, 14 Nov 2023 19:48:06 -0500"},{"index":141,"header":"--","actionItem":"On agreeing to the Gosar amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 19:47:40 -0500"},{"index":142,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Gosar amendment No. 99.","actionTimeStamp":"Tue, 14 Nov 2023 19:42:42 -0500"},{"index":143,"header":"--","actionItem":"An amendment, offered by Mr. Gosar,  numbered 99 printed in Part B of House Report 118-272 to prohibit funding for National Institutes of Health grant R. 01AI110964 \"Understanding the Risk of Bat Coronavirus Emergence\" and Cooperative Agreement U01AI151797 \"Understanding Risk of Zoonotic Virus Emergence in EID Hotspots of Southeast Asia.\"","actionTimeStamp":"Tue, 14 Nov 2023 19:42:23 -0500"},{"index":144,"header":"--","actionItem":"On agreeing to the Good (VA) amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 19:41:58 -0500"},{"index":145,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Good (VA) amendment No. 96.","actionTimeStamp":"Tue, 14 Nov 2023 19:32:38 -0500"},{"index":146,"header":"--","actionItem":"An amendment, offered by Mr. Good (VA),  numbered 96 printed in Part B of House Report 118-272 to prohibit funds to require universities to enforce COVID-19 vaccine requirements for students and faculty.","actionTimeStamp":"Tue, 14 Nov 2023 19:32:25 -0500"},{"index":147,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Crane amendment No. 92, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. DeLauro demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 19:31:50 -0500"},{"index":148,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Crane amendment No. 92.","actionTimeStamp":"Tue, 14 Nov 2023 19:22:07 -0500"},{"index":149,"header":"--","actionItem":"An amendment, offered by Mr. Crane,  numbered 92 printed in Part B of House Report 118-272 to reduce funding for Department of Education Departmental Management by $37,735,000.","actionTimeStamp":"Tue, 14 Nov 2023 19:21:42 -0500"},{"index":150,"header":"--","actionItem":"On agreeing to the Cammack amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 19:21:12 -0500"},{"index":151,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Cammack amendment No. 90.","actionTimeStamp":"Tue, 14 Nov 2023 19:12:34 -0500"},{"index":152,"header":"--","actionItem":"An amendment, offered by Mrs. Cammack,  numbered 90 printed in Part B of House Report 118-272 to prohibit funds to finalize any rule or regulation that has resulted in or is likely to result in an annual effect on the economy of $100 million or more.","actionTimeStamp":"Tue, 14 Nov 2023 19:11:55 -0500"},{"index":153,"header":"--","actionItem":"On agreeing to the Brecheen amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 19:09:44 -0500"},{"index":154,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Brecheen amendment No. 87.","actionTimeStamp":"Tue, 14 Nov 2023 19:00:06 -0500"},{"index":155,"header":"--","actionItem":"An amendment, offered by Mr. Brecheen,  numbered 87 printed in Part B of House Report 118-272 to prohibit funds to finalize, implement, administer, or enforce the proposed rule entitled \"Safe and Appropriate Foster Care Placement Requirements for Titles IV-E and IV-B,\" regarding a foster child's LGBTQI+ identity.","actionTimeStamp":"Tue, 14 Nov 2023 18:59:48 -0500"},{"index":156,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Biggs amendment No. 86, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. DeLauro demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 18:59:20 -0500"},{"index":157,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 86.","actionTimeStamp":"Tue, 14 Nov 2023 18:50:52 -0500"},{"index":158,"header":"--","actionItem":"An amendment, offered by Mr. Biggs,  numbered 86 printed in Part B of House Report 118-272 to prohibit funds to pay for the salary and expenses of Office of Refugee Resettlement Director Robin Dunn Marcos.","actionTimeStamp":"Tue, 14 Nov 2023 18:50:30 -0500"},{"index":159,"header":"--","actionItem":"On agreeing to the Biggs amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 18:50:20 -0500"},{"index":160,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 85.","actionTimeStamp":"Tue, 14 Nov 2023 18:42:12 -0500"},{"index":161,"header":"--","actionItem":"An amendment, offered by Mr. Biggs,  numbered 85 printed in Part B of House Report 118-272 to prohibit funds by the Department of Health and Human Services to make voluntary contributions to the World Health Organization.","actionTimeStamp":"Tue, 14 Nov 2023 18:41:48 -0500"},{"index":162,"header":"--","actionItem":"On agreeing to the Norman amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 18:41:36 -0500"},{"index":163,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 84.","actionTimeStamp":"Tue, 14 Nov 2023 18:34:17 -0500"},{"index":164,"header":"--","actionItem":"An amendment, offered by Mr. Norman,  numbered 84 printed in Part B of House Report 118-272 to prohibit funds to carry out the actions described in the fact sheet released by the White House related to \"junk fees\" in retirement investment advice.","actionTimeStamp":"Tue, 14 Nov 2023 18:33:47 -0500"},{"index":165,"header":"--","actionItem":"On agreeing to the Wagner amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 18:33:27 -0500"},{"index":166,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Wagner amendment No. 83.","actionTimeStamp":"Tue, 14 Nov 2023 18:27:43 -0500"},{"index":167,"header":"--","actionItem":"An amendment, offered by Mrs. Wagner,  numbered 83 printed in Part B of House Report 118-272 to prohibit funds by the Labor Department to finalize, implement, or enforce proposed amendments to class prohibited transaction exemptions available to investment advice fiduciaries.","actionTimeStamp":"Tue, 14 Nov 2023 18:27:28 -0500"},{"index":168,"header":"--","actionItem":"On agreeing to the Allen amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 18:27:11 -0500"},{"index":169,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Allen amendment No. 82.","actionTimeStamp":"Tue, 14 Nov 2023 18:21:51 -0500"},{"index":170,"header":"--","actionItem":"An amendment, offered by Mr. Allen,  numbered 82 printed in Part B of House Report 118-272 to prohibit funds to finalize, implement, or enforce the proposed rule entitled \"Retirement Security Rule: Definition of an Investment Advice Fiduciary\" or any substantially similar rule.","actionTimeStamp":"Tue, 14 Nov 2023 18:21:34 -0500"},{"index":171,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 18:21:14 -0500"},{"index":172,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 81.","actionTimeStamp":"Tue, 14 Nov 2023 18:17:49 -0500"},{"index":173,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 81 printed in Part B of House Report 118-272 to transfer funds from the Department of Education to the Office of the Inspector General to combat Waste, Fraud, and abuse.","actionTimeStamp":"Tue, 14 Nov 2023 18:17:47 -0500"},{"index":174,"header":"--","actionItem":"On agreeing to the Kiley amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 18:17:22 -0500"},{"index":175,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Kiley amendment No. 80.","actionTimeStamp":"Tue, 14 Nov 2023 18:08:56 -0500"},{"index":176,"header":"--","actionItem":"An amendment, offered by Mr. Kiley,  numbered 80 printed in Part B of House Report 118-272 to prohibit funds made available under this Act from being used by the Department of Health and Human Services or any grantee to implement a mask mandate for children at Head Start programs.","actionTimeStamp":"Tue, 14 Nov 2023 18:08:55 -0500"},{"index":177,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Perry amendment No. 78, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. DeLauro demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 18:08:04 -0500"},{"index":178,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 78.","actionTimeStamp":"Tue, 14 Nov 2023 17:58:27 -0500"},{"index":179,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 78 printed in Part B of House Report 118-272 to reduce funding for the National Labor Relations Board by $100 million, and to apply the savings to the spending reduction account.","actionTimeStamp":"Tue, 14 Nov 2023 17:58:23 -0500"},{"index":180,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Tue, 14 Nov 2023 17:57:12 -0500"},{"index":181,"header":"--","actionItem":"Considered as unfinished business. H.R. 5894 — \"Making appropriations for the Departments of Labor, Health and Human Services, and Education, and related agencies for the fiscal year ending September 30, 2024, and for other purposes.\"","actionTimeStamp":"Tue, 14 Nov 2023 17:56:56 -0500"},{"index":182,"header":"--","actionItem":"On approving the Journal Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 17:54:41 -0500"},{"index":183,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Tue, 14 Nov 2023 17:50:39 -0500"},{"index":184,"header":"On motion to suspend the rules and pass the bill, as amended Agreed to by the Yeas and Nays: (2/3 required): 336","actionItem":"95 (Roll no. 658).","actionTimeStamp":"Tue, 14 Nov 2023 17:50:38 -0500"},{"index":185,"header":"--","actionItem":"Considered as unfinished business. H.R. 6363 — \"Making further continuing appropriations for fiscal year 2024, and for other purposes.\"","actionTimeStamp":"Tue, 14 Nov 2023 17:44:36 -0500"},{"index":186,"header":"UNFINISHED BUSINESS","actionItem":"The Chair announced that the unfinished business was the question on the motion to suspend the rules and pass H.R. 6363, as amended, and on agreeing to the Speaker's approval of the Journal, if ordered, on which further proceedings had been postponed.","actionTimeStamp":"Tue, 14 Nov 2023 17:44:00 -0500"},{"index":187,"header":"--","actionItem":"Committee of the Whole House on the state of the Union rises leaving H.R. 5894 as unfinished business.","actionTimeStamp":"Tue, 14 Nov 2023 17:43:22 -0500"},{"index":188,"header":"--","actionItem":"On motion that the committee rise Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 17:43:12 -0500"},{"index":189,"header":"--","actionItem":"Mr. Newhouse moved that the committee rise.","actionTimeStamp":"Tue, 14 Nov 2023 17:42:59 -0500"},{"index":190,"header":"On agreeing to the Biggs amendment; Failed by recorded vote: 118","actionItem":"316 (Roll no. 657).","actionTimeStamp":"Tue, 14 Nov 2023 17:42:50 -0500"},{"index":191,"header":"On agreeing to the Biggs amendment; Failed by recorded vote: 81","actionItem":"354 (Roll no. 656).","actionTimeStamp":"Tue, 14 Nov 2023 17:39:25 -0500"},{"index":192,"header":"On agreeing to the Biggs amendment; Failed by recorded vote: 81","actionItem":"353 (Roll no. 655).","actionTimeStamp":"Tue, 14 Nov 2023 17:35:50 -0500"},{"index":193,"header":"On agreeing to the Biggs amendment; Failed by recorded vote: 85","actionItem":"350 (Roll no. 654).","actionTimeStamp":"Tue, 14 Nov 2023 17:32:41 -0500"},{"index":194,"header":"On agreeing to the Good (VA) amendment; Failed by recorded vote: 109","actionItem":"324 (Roll no. 653).","actionTimeStamp":"Tue, 14 Nov 2023 17:29:26 -0500"},{"index":195,"header":"On agreeing to the Mills amendment; Failed by recorded vote: 186","actionItem":"247 (Roll no. 652).","actionTimeStamp":"Tue, 14 Nov 2023 17:25:49 -0500"},{"index":196,"header":"On agreeing to the Rosendale amendment; Failed by recorded vote: 183","actionItem":"251 (Roll no. 651).","actionTimeStamp":"Tue, 14 Nov 2023 17:22:31 -0500"},{"index":197,"header":"On agreeing to the Good (VA) amendment; Failed by recorded vote: 140","actionItem":"294 (Roll no. 650).","actionTimeStamp":"Tue, 14 Nov 2023 17:18:59 -0500"},{"index":198,"header":"On agreeing to the Good (VA) amendment; Failed by recorded vote: 190","actionItem":"241 (Roll no. 649).","actionTimeStamp":"Tue, 14 Nov 2023 17:14:39 -0500"},{"index":199,"header":"On agreeing to the Miller (IL) amendment; Failed by recorded vote: 131","actionItem":"300 (Roll no. 648).","actionTimeStamp":"Tue, 14 Nov 2023 17:10:20 -0500"},{"index":200,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Tue, 14 Nov 2023 16:38:37 -0500"},{"index":201,"header":"--","actionItem":"Considered as unfinished business. H.R. 5894 — \"Making appropriations for the Departments of Labor, Health and Human Services, and Education, and related agencies for the fiscal year ending September 30, 2024, and for other purposes.\"","actionTimeStamp":"Tue, 14 Nov 2023 16:38:17 -0500"},{"index":202,"header":"--","actionItem":"At the conclusion of debate, the Yeas and Nays were demanded and ordered. Pursuant to the provisions of clause 8, rule XX, the Chair announced that further proceedings on the motion would be postponed.","actionTimeStamp":"Tue, 14 Nov 2023 16:38:04 -0500"},{"index":203,"header":"DEBATE","actionItem":"The House proceeded with forty minutes of debate on H.R. 6363.","actionTimeStamp":"Tue, 14 Nov 2023 16:02:40 -0500"},{"index":204,"header":"--","actionItem":"Considered under suspension of the rules.","actionTimeStamp":"Tue, 14 Nov 2023 16:02:36 -0500"},{"index":205,"header":"--","actionItem":"Ms. Granger moved to suspend the rules and pass the bill, as amended. H.R. 6363 — \"Making further continuing appropriations for fiscal year 2024, and for other purposes.\"","actionTimeStamp":"Tue, 14 Nov 2023 16:02:22 -0500"},{"index":206,"header":"--","actionItem":"The Speaker announced that votes on suspensions, if ordered, will be postponed until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 16:02:15 -0500"},{"index":207,"header":"--","actionItem":"Committee of the Whole House on the state of the Union rises leaving H.R. 5894 as unfinished business.","actionTimeStamp":"Tue, 14 Nov 2023 15:59:09 -0500"},{"index":208,"header":"--","actionItem":"On motion moved that the committee rise Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 15:58:41 -0500"},{"index":209,"header":"--","actionItem":"Mr. Aderholt moved that the committee rise.","actionTimeStamp":"Tue, 14 Nov 2023 15:58:40 -0500"},{"index":210,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Biggs amendment No. 76, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. DeLauro demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 15:58:39 -0500"},{"index":211,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 76.","actionTimeStamp":"Tue, 14 Nov 2023 15:47:57 -0500"},{"index":212,"header":"--","actionItem":"An amendment, offered by Mr. Biggs,  numbered 76 printed in Part B of House Report 118-272 to reduce funding for the Institute of Education Sciences by $707,372,000, and transfer the savings to the Spending Reduction Account.","actionTimeStamp":"Tue, 14 Nov 2023 15:47:40 -0500"},{"index":213,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Biggs amendment No. 71, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Aderholt demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 15:47:17 -0500"},{"index":214,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 71.","actionTimeStamp":"Tue, 14 Nov 2023 15:36:25 -0500"},{"index":215,"header":"--","actionItem":"An amendment, offered by Mr. Biggs,  numbered 71 printed in Part B of House Report 118-272 to reduce funding for the Higher Education Program by $2,767,239,000, and transfer the savings to the Spending Reduction Account.","actionTimeStamp":"Tue, 14 Nov 2023 15:35:58 -0500"},{"index":216,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Biggs amendment No. 70, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. DeLauro demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 15:35:35 -0500"},{"index":217,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 70.","actionTimeStamp":"Tue, 14 Nov 2023 15:25:15 -0500"},{"index":218,"header":"--","actionItem":"An amendment, offered by Mr. Biggs,  numbered 70 printed in Part B of House Report 118-272 to reduce funding for the Student Aid Administration by $1,769,207,000, and transfer the savings to the Spending Reduction Account.","actionTimeStamp":"Tue, 14 Nov 2023 15:24:59 -0500"},{"index":219,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Biggs amendment No. 69, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Aderholt demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 15:24:28 -0500"},{"index":220,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 69.","actionTimeStamp":"Tue, 14 Nov 2023 15:12:11 -0500"},{"index":221,"header":"--","actionItem":"An amendment, offered by Mr. Biggs,  numbered 69 printed in Part B of House Report 118-272 to reduce funding for the Student Financial Assistance Program by $9.25 billion, and transfer the savings to the Spending Reduction Account.","actionTimeStamp":"Tue, 14 Nov 2023 15:12:01 -0500"},{"index":222,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 15:11:27 -0500"},{"index":223,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 63.","actionTimeStamp":"Tue, 14 Nov 2023 15:08:58 -0500"},{"index":224,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 63 printed in Part B of House Report 118-272 to reduce funding, by $2 million, for the Department of Education to the Office of Indian Education.","actionTimeStamp":"Tue, 14 Nov 2023 15:08:30 -0500"},{"index":225,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 15:08:21 -0500"},{"index":226,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 62.","actionTimeStamp":"Tue, 14 Nov 2023 15:05:10 -0500"},{"index":227,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 62 printed in Part B of House Report 118-272 to reduce funding, by $2 million, for the Department of Education, and transfer a similar amount to the Rural School Programs.","actionTimeStamp":"Tue, 14 Nov 2023 15:04:38 -0500"},{"index":228,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 14:59:08 -0500"},{"index":229,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 61.","actionTimeStamp":"Tue, 14 Nov 2023 14:50:57 -0500"},{"index":230,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 61 printed in Part B of House Report 118-272 to reduce funding, by $2 million, for the Department of Education, and increase funding for Charter School Grants by a similar amount.","actionTimeStamp":"Tue, 14 Nov 2023 14:49:57 -0500"},{"index":231,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Good (VA) amendment No. 55, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. DeLauro demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 14:48:54 -0500"},{"index":232,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Good (VA) amendment No. 55.","actionTimeStamp":"Tue, 14 Nov 2023 14:41:11 -0500"},{"index":233,"header":"--","actionItem":"An amendment, offered by Mr. Good (VA),  numbered 55 printed in Part B of House Report 118-272 to reducing funding, by $28 million, for the for Minority AIDS prevention, and transfer the savings to the Spending Reduction Account.","actionTimeStamp":"Tue, 14 Nov 2023 14:41:00 -0500"},{"index":234,"header":"--","actionItem":"On agreeing to the Carter (GA) amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 14:40:34 -0500"},{"index":235,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Carter (GA) amendment No. 54.","actionTimeStamp":"Tue, 14 Nov 2023 14:33:50 -0500"},{"index":236,"header":"--","actionItem":"An amendment, offered by Mr. Carter (GA),  numbered 54 printed in Part B of House Report 118-272 to direct $15 million to carry out section 2409 of Public Law 117-328 to allow states to build or maintain their own medical stockpile for their specific and unique needs, while coordinating with the strategic national stockpile.","actionTimeStamp":"Tue, 14 Nov 2023 14:33:29 -0500"},{"index":237,"header":"--","actionItem":"On agreeing to the Harris amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 14:32:55 -0500"},{"index":238,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Harris amendment No. 39.","actionTimeStamp":"Tue, 14 Nov 2023 14:24:11 -0500"},{"index":239,"header":"--","actionItem":"An amendment, offered by Mr. Harris,  numbered 39 printed in Part B of House Report 118-272 to decrease the appropriation for National Institutes of Health buildings and facilities by $119,000,000 and increase the appropriation for the Strategic National Stockpile by $100,000,000.","actionTimeStamp":"Tue, 14 Nov 2023 14:23:56 -0500"},{"index":240,"header":"--","actionItem":"On agreeing to the Harris amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 14:23:33 -0500"},{"index":241,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Harris amendment No. 38.","actionTimeStamp":"Tue, 14 Nov 2023 14:15:31 -0500"},{"index":242,"header":"--","actionItem":"An amendment, offered by Mr. Harris,  numbered 38 printed in Part B of House Report 118-272 to decrease the appropriation for the National Institutes of Health buildings and facilities by $59,000,000 and increase the appropriation for Project BioShield by $50,000,000.","actionTimeStamp":"Tue, 14 Nov 2023 14:15:16 -0500"},{"index":243,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 14:14:54 -0500"},{"index":244,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 36.","actionTimeStamp":"Tue, 14 Nov 2023 14:04:57 -0500"},{"index":245,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 36 printed in Part B of House Report 118-272 to reduce funds for the National Institutes of Health.","actionTimeStamp":"Tue, 14 Nov 2023 14:04:31 -0500"},{"index":246,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Mills amendment No. 35, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Ms. DeLauro demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 14:03:57 -0500"},{"index":247,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Mills amendment No. 35.","actionTimeStamp":"Tue, 14 Nov 2023 13:57:03 -0500"},{"index":248,"header":"--","actionItem":"An amendment, offered by Mr. Mills,  numbered 35 printed in Part B of House Report 118-272 to reduce the appropriated amount for the Office of the Director, National Institutes of Health to the FY19 appropriated amount.","actionTimeStamp":"Tue, 14 Nov 2023 13:56:49 -0500"},{"index":249,"header":"--","actionItem":"On agreeing to the Pfluger amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 13:56:21 -0500"},{"index":250,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Pfluger amendment No. 34.","actionTimeStamp":"Tue, 14 Nov 2023 13:49:53 -0500"},{"index":251,"header":"--","actionItem":"An amendment, offered by Mr. Pfluger,  numbered 34 printed in Part B of House Report 118-272 to decrease the amount appropriated to the National Institutes of Health's Office of the Director by $3,748,715 to redress the amount of federal funds the NIH awarded EcoHealth Alliance, Inc. to conduct gain-of-function research at the Wuhan Institute of Virology.","actionTimeStamp":"Tue, 14 Nov 2023 13:49:34 -0500"},{"index":252,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Rosendale amendment No. 33, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Ms. DeLauro demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 13:49:07 -0500"},{"index":253,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Rosendale amendment No. 33.","actionTimeStamp":"Tue, 14 Nov 2023 13:39:55 -0500"},{"index":254,"header":"--","actionItem":"An amendment, offered by Mr. Rosendale,  numbered 33 printed in Part B of House Report 118-272 to reduce funding for the John E. Fogarty International Center by $95,162,000.","actionTimeStamp":"Tue, 14 Nov 2023 13:39:40 -0500"},{"index":255,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Good (VA) amendment No. 32, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Ms. DeLauro demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 13:39:09 -0500"},{"index":256,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Good (VA) amendment No. 32.","actionTimeStamp":"Tue, 14 Nov 2023 13:31:50 -0500"},{"index":257,"header":"--","actionItem":"An amendment, offered by Mr. Good (VA),  numbered 32 printed in Part B of House Report 118-272 to transfer $524.4 million from the National Institute of Minority Health and Health Disparities to the Spending Reduction Account.","actionTimeStamp":"Tue, 14 Nov 2023 13:31:33 -0500"},{"index":258,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Good (VA) amendment No. 28, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Ms. DeLauro demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 13:30:56 -0500"},{"index":259,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Good (VA) amendment No. 28.","actionTimeStamp":"Tue, 14 Nov 2023 13:23:32 -0500"},{"index":260,"header":"--","actionItem":"An amendment, offered by Mr. Good (VA),  numbered 28 printed in Part B of House Report 118-272 to transfer $10 million allocated for the Office of Diversity in Biomedical Research to the Spending Reduction Account.","actionTimeStamp":"Tue, 14 Nov 2023 13:23:13 -0500"},{"index":261,"header":"--","actionItem":"On agreeing to the Grothman amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 13:22:15 -0500"},{"index":262,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Grothman amendment No. 22.","actionTimeStamp":"Tue, 14 Nov 2023 13:14:54 -0500"},{"index":263,"header":"--","actionItem":"An amendment, offered by Mr. Grothman,  numbered 22 printed in Part B of House Report 118-272 to increase and decrease funding in Centers for Disease Control and Prevention-Wide Activities and Program Support by $1,000,000 to express the intent for the CDC to conduct a study on the connection between vitamin D deficiencies and COVID-19 mortality rates in the United States; and the role of vitamin D in suppressing severe COVID-19 symptoms; and determine whether or not a recommendation should be made on the supplemental intake of vitamin D to boost immune health and protect against complications associated with respiratory illness and infections.","actionTimeStamp":"Tue, 14 Nov 2023 13:14:44 -0500"},{"index":264,"header":"--","actionItem":"On agreeing to the Mills amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 13:14:16 -0500"},{"index":265,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Mills amendment No. 19.","actionTimeStamp":"Tue, 14 Nov 2023 13:05:44 -0500"},{"index":266,"header":"--","actionItem":"An amendment, offered by Mr. Mills,  numbered 19 printed in Part B of House Report 118-272 to reduce the appropriated amount for the Public Health Scientific Services to the FY19 appropriated amount.","actionTimeStamp":"Tue, 14 Nov 2023 13:05:33 -0500"},{"index":267,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 13:05:00 -0500"},{"index":268,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 13.","actionTimeStamp":"Tue, 14 Nov 2023 13:01:37 -0500"},{"index":269,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 13 printed in Part B of House Report 118-272 to transfer funds from Health and Human Services General Department Management to the Inspector General to combat waste, fraud, and abuse.","actionTimeStamp":"Tue, 14 Nov 2023 13:01:23 -0500"},{"index":270,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 13:01:01 -0500"},{"index":271,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 11.","actionTimeStamp":"Tue, 14 Nov 2023 12:57:45 -0500"},{"index":272,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 11 printed in Part B of House Report 118-272 to transfer funds from Health and Human Services General Department Management to the Rural Residency Planning and Development Program to support physician workforce expansion in rural areas.","actionTimeStamp":"Tue, 14 Nov 2023 12:57:29 -0500"},{"index":273,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 12:57:12 -0500"},{"index":274,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 10.","actionTimeStamp":"Tue, 14 Nov 2023 12:54:56 -0500"},{"index":275,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 10 printed in Part B of House Report 118-272 to transfer funds from Health and Human Services General Department Management to the Rural Emergency Hospital Technical Assistance Program.","actionTimeStamp":"Tue, 14 Nov 2023 12:54:41 -0500"},{"index":276,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 12:54:22 -0500"},{"index":277,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 9.","actionTimeStamp":"Tue, 14 Nov 2023 12:51:13 -0500"},{"index":278,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 9 printed in Part B of House Report 118-272 to transfer funds from Health and Human Services General Department Management for the purchase and implementation of telehealth services to improve health care coordination for rural veterans between rural providers and the Department of Veterans Affairs.","actionTimeStamp":"Tue, 14 Nov 2023 12:51:02 -0500"},{"index":279,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 12:50:43 -0500"},{"index":280,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 8.","actionTimeStamp":"Tue, 14 Nov 2023 12:47:58 -0500"},{"index":281,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 8 printed in Part B of House Report 118-272 to transfer funds from Health and Human Services General Department Management to the Small Rural Hospital Improvement Grant Program.","actionTimeStamp":"Tue, 14 Nov 2023 12:47:43 -0500"},{"index":282,"header":"--","actionItem":"On agreeing to the Meuser amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 12:44:40 -0500"},{"index":283,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Meuser amendment No. 6.","actionTimeStamp":"Tue, 14 Nov 2023 12:37:15 -0500"},{"index":284,"header":"--","actionItem":"An amendment, offered by Mr. Meuser,  numbered 6 printed in Part B of House Report 118-272 to provide the Health Workforce Account with an additional $10 million for the Nurse Corps programs which is offset with a $19 million deduction to the National Institute of Nursing Research.","actionTimeStamp":"Tue, 14 Nov 2023 12:36:57 -0500"},{"index":285,"header":"--","actionItem":"On agreeing to the Cloud amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 12:36:36 -0500"},{"index":286,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Cloud amendment No. 4.","actionTimeStamp":"Tue, 14 Nov 2023 12:31:45 -0500"},{"index":287,"header":"--","actionItem":"An amendment, offered by Mr. Cloud,  numbered 4 printed in Part B of House Report 118-272 to strike a reference to a job corps center on Treasure Island in Section 114 and replace it with the job corps center located in San Marcos, Texas.","actionTimeStamp":"Tue, 14 Nov 2023 12:31:31 -0500"},{"index":288,"header":"--","actionItem":"On agreeing to the Higgins (LA) amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 12:31:05 -0500"},{"index":289,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Higgins (LA) amendment No. 2.","actionTimeStamp":"Tue, 14 Nov 2023 12:23:08 -0500"},{"index":290,"header":"--","actionItem":"An amendment, offered by Mr. Higgins (LA),  numbered 2 printed in Part B of House Report 118-272 to reduce the Mine Safety and Health Administration's Salary and Expenses account by $1,000,000, and to redirect these funds to the Department of Labor's Office of Inspector General's account.","actionTimeStamp":"Tue, 14 Nov 2023 12:22:48 -0500"},{"index":291,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Miller (IL) amendment No. 1, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Ms. DeLauro demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 12:22:28 -0500"},{"index":292,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 10 minutes of debate on the Miller (IL) amendment No. 1.","actionTimeStamp":"Tue, 14 Nov 2023 12:17:23 -0500"},{"index":293,"header":"--","actionItem":"An amendment, offered by Mrs. Miller (IL),  numbered 1 printed in Part B of House Report 118-272 to reduce funding for the Occupational Safety and Health Administration by $536,922,000 to $0.","actionTimeStamp":"Tue, 14 Nov 2023 12:17:12 -0500"},{"index":294,"header":"--","actionItem":"On agreeing to the Aderholt amendments; Agreed to by voice vote.","actionTimeStamp":"Tue, 14 Nov 2023 12:16:45 -0500"},{"index":295,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 864, the Committee of the Whole proceeded with 20 minutes of debate on the Aderholt amendment en bloc.","actionTimeStamp":"Tue, 14 Nov 2023 12:06:07 -0500"},{"index":296,"header":"--","actionItem":"Amendments en bloc  offered by Mr. Aderholt,  comprised of the following amendments printed in Part B of House Report 118-272 as en bloc: Nos. 3, 5, 7, 12, 14, 15, 16, 17, 18, 20, 21, 23, 24, 25, 27, 29, 30, 31, 37, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 56, 57, 59, 60, 64, 65, 66, 67, 68, 72, 73, 74, 75, 77, 79, and 141.","actionTimeStamp":"Tue, 14 Nov 2023 12:05:17 -0500"},{"index":297,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 5894.","actionTimeStamp":"Tue, 14 Nov 2023 11:20:59 -0500"},{"index":298,"header":"--","actionItem":"The Speaker designated the Honorable Scott DesJarlais to act as Chairman of the Committee.","actionTimeStamp":"Tue, 14 Nov 2023 11:20:41 -0500"},{"index":299,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 864 and Rule XVIII.","actionTimeStamp":"Tue, 14 Nov 2023 11:20:36 -0500"},{"index":300,"header":"--","actionItem":"Rule provides for consideration of H.R. 5894. The resolution provides for consideration of H.R. 5894 under a structured rule with one hour of general debate and one motion to recommit allowed.","actionTimeStamp":"Tue, 14 Nov 2023 11:16:32 -0500"},{"index":301,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 864. H.R. 5894 — \"Making appropriations for the Departments of Labor, Health and Human Services, and Education, and related agencies for the fiscal year ending September 30, 2024, and for other purposes.\"","actionTimeStamp":"Tue, 14 Nov 2023 11:16:27 -0500"},{"index":302,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Tue, 14 Nov 2023 11:16:24 -0500"},{"index":303,"header":"On agreeing to the resolution Agreed to by recorded vote: 217","actionItem":"209 (Roll no. 647).","actionTimeStamp":"Tue, 14 Nov 2023 11:16:22 -0500"},{"index":304,"header":"On ordering the previous question Agreed to by the Yeas and Nays: 217","actionItem":"208 (Roll no. 646).","actionTimeStamp":"Tue, 14 Nov 2023 11:04:09 -0500"},{"index":305,"header":"--","actionItem":"Considered as unfinished business. H. Res. 864 — \"Providing for consideration of the bill (H.R. 5894) making appropriations for the Departments of Labor, Health and Human Services, and Education, and related agencies for the fiscal year ending September 30, 2024, and for other purposes.\"","actionTimeStamp":"Tue, 14 Nov 2023 10:30:23 -0500"},{"index":306,"header":"UNFINISHED BUSINESS","actionItem":"The Chair announced the unfinished business was the question on ordering the previous question on H. Res. 864 and on agreeing to resolution, if ordered, which had been debated earlier and on which further proceedings had been postponed.","actionTimeStamp":"Tue, 14 Nov 2023 10:30:21 -0500"},{"index":307,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of November 14.","actionTimeStamp":"Tue, 14 Nov 2023 10:30:19 -0500"},{"index":308,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is subject to the call of the Chair.","actionTimeStamp":"Tue, 14 Nov 2023 09:46:43 -0500"},{"index":309,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on H. Res. 864, the Chair put the question on ordering the previous question and by voice vote, announced that the ayes had prevailed. Ms. Scanlon demanded the yeas and nays and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 09:45:52 -0500"},{"index":310,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 864.","actionTimeStamp":"Tue, 14 Nov 2023 09:17:23 -0500"},{"index":311,"header":"--","actionItem":"Considered as privileged matter. H. Res. 864 — \"Providing for consideration of the bill (H.R. 5894) making appropriations for the Departments of Labor, Health and Human Services, and Education, and related agencies for the fiscal year ending September 30, 2024, and for other purposes.\"","actionTimeStamp":"Tue, 14 Nov 2023 09:13:46 -0500"},{"index":312,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one-minute speeches, which by direction of the Chair, would be limited to five per side of the aisle.","actionTimeStamp":"Tue, 14 Nov 2023 09:04:40 -0500"},{"index":313,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Edwards to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Tue, 14 Nov 2023 09:04:26 -0500"},{"index":314,"header":"SPEAKERS APPROVAL OF THE JOURNAL","actionItem":"The Chair announced that he had examined the Journal of the last day's proceedings and had approved it. Mr. Burgess demanded that the question be put on agreeing to the Speaker's approval of the Journal and by voice vote, the Chair announced that the ayes had prevailed. Mr. Burgess objected to the voice vote based upon the absence of a quorum and the Chair postponed further proceedings on the question of agreeing to the Speaker's approval of the Journal until a time to be announced.","actionTimeStamp":"Tue, 14 Nov 2023 09:02:42 -0500"},{"index":315,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Tue, 14 Nov 2023 09:01:01 -0500"},{"index":316,"header":"--","actionItem":"The Speaker designated the Honorable Ben Cline to act as Speaker pro tempore for today.","actionTimeStamp":"Tue, 14 Nov 2023 09:00:41 -0500"},{"index":317,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Tue, 14 Nov 2023 09:00:00 -0500"}]}