{"retrieved-date":"2024-3-22","actions-date":"Thursday, March 21, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, March 21)","actionItem":"S. 4050 (Sen. Cassidy):\n        A bill to extend the deadline to commence construction of certain hydroelectric projects on the Red River.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.\n\n\n S.J.Res. 62 (Sen. Tester):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Animal and Plant Health Inspection Service relating to \"Importation of Fresh Beef From Paraguay\".\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Unanimous Consent.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 70 - 25. Record Vote Number: 101 \n\n\n\n S.Res. 611 (Sen. Manchin):\n        A resolution expressing support for the designation of March 22, 2024, as \"National Inland Waterways Workers Safety Awareness Day\" and supporting the goals and ideals of \"National Inland Waterways Workers Safety Awareness Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 612 (Sen. King):\n        A resolution recognizing the importance of maple syrup production to the State of Maine and designating March 24, 2024, as \"Maine Maple Sunday\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 613 (Sen. Braun):\n        A resolution supporting the designation of the week of April 15 through April 19, 2024, as \"National Work Zone Awareness Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 614 (Sen. Schumer):\n        A resolution to authorize testimony, documents, and representation in United States v. Miller.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 615 (Sen. Manchin):\n        A resolution designating April 5, 2024, as \"Gold Star Wives Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, March 21)","actionItem":"PN157:\n        Jose Javier Rodriguez, of Florida, to be an Assistant Secretary of Labor\n\n        -- Considered by Senate.\n\n        -- Motion to proceed to consideration of the motion to reconsider the vote (Record Vote No. 318), by which cloture was not invoked on the nomination, agreed to in Senate by Unanimous Consent.\n\n        -- Motion by Senator Schumer to reconsider the vote (Record Vote No. 318), by which cloture was not invoked on the nomination, agreed to in Senate by Unanimous Consent.\n\n        -- Upon reconsideration, cloture invoked in Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 99 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 48. Record Vote Number: 100 \n\n\n\n PN1428:\n        Leon Schydlower, of Texas, to be United States District Judge for the Western District of Texas\n\n        -- Considered by Senate.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  7:16 p.m, the Presiding Officer (Mr. Ossoff in the chair) declared the Senate adjourned, under its order of today, until 11 a.m. tomorrow.","actionTimeStamp":"--"}]}