{"retrieved-date":"2025-4-1","actions-date":"Thursday, March 27, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, March 27)","actionItem":"S.J.Res. 18 (Sen. Scott, of SC):\n        A joint resolution disapproving the rule submitted by the Bureau of Consumer Financial Protection relating to \"Overdraft Lending: Very Large Financial Institutions\".\n\n        -- Considered by Senate.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 52 - 48. Record Vote Number: 153 \n\n\n\n S.Res. 148 (Sen. Barrasso):\n        A resolution honoring the life of the Honorable Alan K. Simpson, former Senator for the State of Wyoming.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, March 27)","actionItem":"PN13-9:\n        Paul Lawrence, of Virginia, to be Deputy Secretary of Veterans Affairs\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 47. Record Vote Number: 154 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 45. Record Vote Number: 155 \n\n\n\n PN25-56:\n        Matthew Whitaker, of Iowa, to be United States Permanent Representative on the Council of the North Atlantic Treaty Organization, with the rank and status of Ambassador\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, debate and vote 3/31/2025.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Cornyn, at  4:39 p.m., the Senate adjourned, under its order of today, until  3 p.m. on Monday, March 31, 2025.","actionTimeStamp":"--"}]}