{"retrieved-date":"2026-2-24","actions-date":"Thursday, February 12, 2026","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, February 12)","actionItem":"H.R. 7147 (Rep. Cole):\n        A bill making further consolidated appropriations for the fiscal year ending September 30, 2026, and for other purposes.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Cloture on the motion to proceed to the measure not invoked in Senate by Yea-Nay Vote. 52 - 47. Record Vote Number: 38 \n\n\n        -- Motion by Senator Thune to reconsider the vote by which cloture on the motion to proceed to the measure was not invoked (Record Vote No. 38) entered in Senate.\n\n        -- Second cloture motion on the motion to proceed to the measure presented in Senate.\n\n\n H.J.Res. 142 (Rep. Gill):\n        A joint resolution disapproving the action of the District of Columbia Council in approving the D.C. Income and Franchise Tax Conformity and Revision Temporary Amendment Act of 2025.\n\n        -- Considered by Senate.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 49 - 47. Record Vote Number: 37 \n\n\n        -- Message on Senate action sent to the House.\n\n\n H.Con.Res. 74 (Rep. Mast):\n        A concurrent resolution providing for a joint session of Congress to receive a message from the President.\n\n        -- Resolution agreed to in Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S. 1383 (Sen. Scott, of FL):\n        A bill to establish the Veterans Advisory Committee on Equal Access, and for other purposes.\n\n        -- Message on House action received in Senate and at desk: House amendment to Senate bill.\n\n\n S.Res. 609 (Sen. Thune):\n        A resolution to authorize testimony and representation in United States v. Crouse.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 610 (Sen. Murray):\n        A resolution congratulating the Seattle Seahawks for winning Super Bowl LX.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 611 (Sen. Tillis):\n        A resolution authorizing the use of the atrium in the Philip A. Hart Senate Office Building for a Bipawtisan Doggi Gras Pawrade on February 25, 2026, from 4:00pm to 6:00pm.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, February 12)","actionItem":"PN620:\n        4 nominations in the Coast Guard beginning with Rear Adm. Jo-Ann F. Burdian and ending with Rear Adm. Douglas M. Schofield\n\n        -- Reported by Senator Cruz, Committee on Commerce, Science, and Transportation, without printed report.\n\n        -- Placed on Senate Executive Calendar. Calendar No. 656. Subject to nominee's commitment to respond to requests to appear and testify before any duly constituted committee of the Senate.\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schmitt, at  4:13 p.m., the Senate adjourned, under its order of today, until  9 a.m. tomorrow.","actionTimeStamp":"--"}]}