{"retrieved-date":"2024-5-23","actions-date":"Thu, 23 May 2024 10:21:04 -0400","actions-title":"House Floor Proceedings","actions-count":10,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H.R. 192.","actionTimeStamp":"Thu, 23 May 2024 10:21:04 -0400"},{"index":2,"header":"--","actionItem":"Rule provides for consideration of H.R. 4763, H.R. 5403 and H.R. 192. The resolution provides for one hour of debate on each bill. H.R. 4763 and H.R. 5403 are considered under a structured rule and H.R. 192 is considered under a closed rule. The resolution provides for one motion to recommit on each bill.","actionTimeStamp":"Thu, 23 May 2024 10:21:03 -0400"},{"index":3,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 1243. H.R. 192 — \"To prohibit individuals who are not citizens of the United States from voting in elections in the District of Columbia.\"","actionTimeStamp":"Thu, 23 May 2024 10:20:58 -0400"},{"index":4,"header":"The Speaker laid before the House a message from the President transmitting a notification announcing his intent to designate Kenya as a Major Non-NATO Ally in accordance with section 517 of the Foreign Assistance Act of 1961, as amended (22 U.S.C. 2321k).","actionItem":"referred to the Committee on Foreign Affairs and ordered to be printed (H. Doc. 118-144).","actionTimeStamp":"Thu, 23 May 2024 10:19:53 -0400"},{"index":5,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches which by direction of the Chair, would be limited to 15 per side of the aisle.","actionTimeStamp":"Thu, 23 May 2024 10:03:19 -0400"},{"index":6,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Williams of TX to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 23 May 2024 10:02:43 -0400"},{"index":7,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Thu, 23 May 2024 10:02:35 -0400"},{"index":8,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Thu, 23 May 2024 10:01:00 -0400"},{"index":9,"header":"--","actionItem":"The Speaker designated the Honorable Celeste Maloy to act as Speaker pro tempore for today.","actionTimeStamp":"Thu, 23 May 2024 10:00:41 -0400"},{"index":10,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 23 May 2024 10:00:00 -0400"}]}