{"retrieved-date":"2023-3-30","actions-date":"Thu, 30 Mar 2023 11:34:07 -0400","actions-title":"House Floor Proceedings","actions-count":46,"actions-list":[{"index":1,"header":"On motion to recommit Roll Call 181","actionItem":"Yea and Nay vote pending.","actionTimeStamp":"Thu, 30 Mar 2023 11:34:07 -0400"},{"index":2,"header":"--","actionItem":"The previous question on the motion to recommit was ordered pursuant to clause 2(b) of rule XIX.","actionTimeStamp":"Thu, 30 Mar 2023 11:34:01 -0400"},{"index":3,"header":"--","actionItem":"Ms. Porter moved to recommit to the Committee on Natural Resources.","actionTimeStamp":"Thu, 30 Mar 2023 11:33:36 -0400"},{"index":4,"header":"--","actionItem":"The House adopted the amendments en gross as agreed to by the Committee of the Whole House on the state of the Union.","actionTimeStamp":"Thu, 30 Mar 2023 11:32:43 -0400"},{"index":5,"header":"--","actionItem":"The previous question was ordered pursuant to the rule.","actionTimeStamp":"Thu, 30 Mar 2023 11:32:27 -0400"},{"index":6,"header":"--","actionItem":"The House rose from the Committee of the Whole House on the state of the Union to report H.R. 1.","actionTimeStamp":"Thu, 30 Mar 2023 11:32:12 -0400"},{"index":7,"header":"--","actionItem":"On agreeing to the Van Drew amendment; Agreed to by recorded vote: (Roll no. 180).","actionTimeStamp":"Thu, 30 Mar 2023 11:31:29 -0400"},{"index":8,"header":"--","actionItem":"On agreeing to the Smith (NJ) amendment; Agreed to by recorded vote: (Roll no. 179).","actionTimeStamp":"Thu, 30 Mar 2023 11:26:05 -0400"},{"index":9,"header":"--","actionItem":"On agreeing to the Perry amendment; Failed by recorded vote: (Roll no. 178).","actionTimeStamp":"Thu, 30 Mar 2023 11:21:19 -0400"},{"index":10,"header":"--","actionItem":"On agreeing to the Ogles amendment; Agreed to by recorded vote: (Roll no. 177).","actionTimeStamp":"Thu, 30 Mar 2023 11:18:09 -0400"},{"index":11,"header":"--","actionItem":"On agreeing to the Levin amendment; Failed by recorded vote: (Roll no. 176).","actionTimeStamp":"Thu, 30 Mar 2023 11:14:59 -0400"},{"index":12,"header":"--","actionItem":"On agreeing to the Leger Fernandez amendment; Agreed to by recorded vote: (Roll no. 175).","actionTimeStamp":"Thu, 30 Mar 2023 11:09:07 -0400"},{"index":13,"header":"--","actionItem":"On agreeing to the Westerman amendment; Agreed to by recorded vote: (Roll no. 174).","actionTimeStamp":"Thu, 30 Mar 2023 11:05:28 -0400"},{"index":14,"header":"UNFINISHED BUSINESS","actionItem":"The Chair announced that the unfinished business was on the question on agreeing to the amendments to H.R. 1, which had been debated earlier and on which further proceedings had been postponed","actionTimeStamp":"Thu, 30 Mar 2023 10:34:47 -0400"},{"index":15,"header":"--","actionItem":"On agreeing to the Graves (LA) amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 30 Mar 2023 10:34:46 -0400"},{"index":16,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 260, the Committee of the Whole proceeded with 10 minutes of debate on the Graves (LA) amendment No. 37.","actionTimeStamp":"Thu, 30 Mar 2023 10:18:08 -0400"},{"index":17,"header":"--","actionItem":"An amendment, offered by Mr. Graves (LA),  numbered 37 printed in Part B of House Report 118-30 to provide regulatory certainty by explicitly authorizing the common practice of NPDES general permits and providing for continuances during times of administrative delay.","actionTimeStamp":"Thu, 30 Mar 2023 10:17:25 -0400"},{"index":18,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Van Drew amendment No. 36, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Grijalva demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 30 Mar 2023 10:15:32 -0400"},{"index":19,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 260, the Committee of the Whole proceeded with 10 minutes of debate on the Van Drew amendment No. 36.","actionTimeStamp":"Thu, 30 Mar 2023 10:07:33 -0400"},{"index":20,"header":"--","actionItem":"An amendment, offered by Mr. Van Drew,  numbered 36 printed in Part B of House Report 118-30 to require the Government Accountability Office to publish a report on all potential adverse effects of wind energy development in the North Atlantic Planning Area.","actionTimeStamp":"Thu, 30 Mar 2023 10:06:56 -0400"},{"index":21,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Smith (NJ) amendment No. 35, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Grijalva demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 30 Mar 2023 10:05:22 -0400"},{"index":22,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 260, the Committee of the Whole proceeded with 10 minutes of debate on the Smith (NJ) amendment No. 35.","actionTimeStamp":"Thu, 30 Mar 2023 09:58:46 -0400"},{"index":23,"header":"--","actionItem":"An amendment, offered by Mr. Smith (NJ),  numbered 35 printed in Part B of House Report 118-30 to require a Government Accountability Office study of sufficiency of the environmental review process for offshore wind.","actionTimeStamp":"Thu, 30 Mar 2023 09:57:47 -0400"},{"index":24,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Perry amendment No. 34, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Garbarino demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 30 Mar 2023 09:57:25 -0400"},{"index":25,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 260, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 34.","actionTimeStamp":"Thu, 30 Mar 2023 09:49:16 -0400"},{"index":26,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 34 printed in Part B of House Report 118-30 to add to sec. 20305 an exception for certain actions under the Defense Production Act.","actionTimeStamp":"Thu, 30 Mar 2023 09:48:19 -0400"},{"index":27,"header":"--","actionItem":"On agreeing to the Perry amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 30 Mar 2023 09:47:58 -0400"},{"index":28,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 260, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 33.","actionTimeStamp":"Thu, 30 Mar 2023 09:40:31 -0400"},{"index":29,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 33 printed in Part B of House Report 118-30 to add a reporting requirement to sec. 20209 on non-Federal entities.","actionTimeStamp":"Thu, 30 Mar 2023 09:39:34 -0400"},{"index":30,"header":"--","actionItem":"On agreeing to the Perry amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 30 Mar 2023 09:39:16 -0400"},{"index":31,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 260, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 32.","actionTimeStamp":"Thu, 30 Mar 2023 09:34:18 -0400"},{"index":32,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 32 printed in Part B of House Report 118-30 to add a prohibition to sec. 20209 on contributions from CCP entities.","actionTimeStamp":"Thu, 30 Mar 2023 09:33:36 -0400"},{"index":33,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Ogles amendment No. 31, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Grijalva demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 30 Mar 2023 09:31:51 -0400"},{"index":34,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 260, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 31.","actionTimeStamp":"Thu, 30 Mar 2023 09:24:05 -0400"},{"index":35,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 31 printed in Part B of House Report 118-30 to provide that any entity subject to the jurisdiction of the Government of the Peoples Republic of China, or any entity that is owned by the Government of the Peoples Republic of China may not acquire any interest with respect to lands leased for oil or gas under the Mineral Leasing Act, the Outer Continental Shelf Lands Act, and may not acquire claims subject to the General Mining Law of 1872.","actionTimeStamp":"Thu, 30 Mar 2023 09:22:58 -0400"},{"index":36,"header":"--","actionItem":"On agreeing to the Ogles amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 30 Mar 2023 09:22:41 -0400"},{"index":37,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 260, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 30.","actionTimeStamp":"Thu, 30 Mar 2023 09:13:59 -0400"},{"index":38,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 30 printed in Part B of House Report 118-30 to express the Sense of Congress that the royalty rate for onshore Federal oil and gas leases be 12.5%.","actionTimeStamp":"Thu, 30 Mar 2023 09:12:59 -0400"},{"index":39,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Thu, 30 Mar 2023 09:12:03 -0400"},{"index":40,"header":"--","actionItem":"Considered as unfinished business. H.R. 1 — \"To lower energy costs by increasing American energy production, exports, infrastructure, and critical minerals processing, by promoting transparency, accountability, permitting, and production of American resources, and by improving water quality certification and energy projects, and for other purposes.\"","actionTimeStamp":"Thu, 30 Mar 2023 09:11:42 -0400"},{"index":41,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair, would be limited to 5 per side of the aisle.","actionTimeStamp":"Thu, 30 Mar 2023 09:02:26 -0400"},{"index":42,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Good of VA to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 30 Mar 2023 09:02:02 -0400"},{"index":43,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Thu, 30 Mar 2023 09:01:57 -0400"},{"index":44,"header":"--","actionItem":"The Speaker designated the Honorable Mike Flood to act as Speaker pro tempore for today.","actionTimeStamp":"Thu, 30 Mar 2023 09:00:16 -0400"},{"index":45,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Thu, 30 Mar 2023 09:00:00 -0400"},{"index":46,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 30 Mar 2023 09:00:00 -0400"}]}