{"retrieved-date":"2023-10-2","actions-date":"Saturday, September 30, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday,the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Saturday, September 30)","actionItem":"H.R. 3935 (Rep. Graves):\n        A bill to amend title 49, United States Code, to reauthorize and improve the Federal Aviation Administration and other civilaviation programs, and for other purposes.\n\n        -- Considered by Senate.\n\n        -- Cloture motion on the measure withdrawn by unanimous consent in Senate.\n \n\n S.Amdt. 1292 (Sen. Murray):\n        In the nature of a substitute.\n\n        --Considered by Senate.\n\n        --Cloture motion on amendment SA1292 withdrawn by unanimous consent in Senate.\n\n\n S.Amdt. 1293 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate.\n\n\n S.Amdt. 1294 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate.\n\n\n S.Amdt. 1295 (Sen. Schumer):\n        To modify the effective date.\n\n        --Considered by Senate.\n\n\n\n\n H.R. 5860 (Rep. Granger):\n        A bill making continuing appropriations for fiscalyear 2024, and for other purposes.\n\n        -- Received in the Senate, read twice, considered, read the third time, and passed, under the order of 9/30/23, having achieved 60 votes in the affirmative, without amendment by Yea-Nay Vote. 88 - 9. Record Vote Number:247 \n\n\n        -- Message on Senate action sent to the House.\n\n\n S. 2231 (Sen. Merkley):\n        A bill to amend title V of the Social Security Actto support stillbirth prevention and research, and for other purposes.\n\n        -- Senate Committee on Finance discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 310 (Sen. Peters):\n        A resolution recognizing the Motorcycle Safety Foundation for 50 years of safety education.\n\n        -- Senate Committee on Commerce, Science, and Transportation discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 390 (Sen. Shaheen):\n        A resolution designating the week of October 1, 2023, through October 7, 2023, as \"National Community Policing Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 391 (Sen. Grassley):\n        A resolution designating the week beginning October 15, 2023, as \"National Character Counts Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 392 (Sen. Hirono):\n        A resolution recognizing and honoring the first responders and those who lost their lives in the Maui wildfires in August 2023 that affected thousands of people.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 393 (Sen. Tillis):\n        A resolution to honor the life and death of DuncanMcLauchlin (\"Lauch\") Faircloth, former Senator for the State of North Carolina.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Saturday, September 30)","actionItem":"PN401:\n        Robert M. McTighe, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN402:\n        Edward B. Sauter, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN403:\n        Joan E. Sommers, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN451:\n        Brendan Abell Hurson, of Maryland, to be United States District Judge for the District of Maryland\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN465:\n        David M.P. Spitler, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN508:\n        Abraham N. Osborn, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN509:\n        Amanda E. Harrington, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN510:\n        Lee W. Doggett, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN519:\n        166 nominations in the Army beginning with Eli S. Adams and ending with D012613\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN520:\n        162 nominations in the Army beginning with Drew Q.Abell and ending with G010339\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN521:\n        112 nominations in the Army beginning with RomaineM. Aguon and ending with D017105\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN522:\n        16 nominations in the Army beginning with Michael L. Arner and ending with Mark M. Yeary\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN589:\n        Susan Kim DeClercq, of Michigan, to be United States District Judge for the Eastern District of Michigan\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN614:\n        Robert K. Furtick, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN615:\n        Joseph A. McCarthy, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN672:\n        Brendan Carr, of Virginia, to be a Member of the Federal Communications Commission for a term of five years from July 1, 2023\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN674:\n        Geoffrey Adam Starks, of Kansas, to be a Member ofthe Federal Communications Commission for a term of five years from July 1,2022\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN676:\n        James C. O'Brien, of Nebraska, to be an Assistant Secretary of State (European and Eurasian Affairs)\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- By unanimous consent agreement, debate 10/3/2023.\n\n\n PN708:\n        Michael S. McLeod, in the Marine Corps, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN782:\n        Bradley C. Fromm, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN790:\n        Vegas V. Coleman, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN855:\n        Ryan J. Nowlin, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN886:\n        7 nominations in the Air Force beginning with Heather A. Bodwell and ending with Christian L. Williams\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN887:\n        28 nominations in the Air Force beginning with Eglon Aubyn Angel and ending with Thomas H. West\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN889:\n        Martin J. Slovinsky, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN895:\n        59 nominations in the Army beginning with Matthew C. Ailstock and ending with 0002350680\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN896:\n        Russell W. Forkin, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN897:\n        Jessica L. Godsey, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN909:\n        Matthew F. Dabkowski, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN910:\n        Archie L. Bates III, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN911:\n        Jason S. Hawksworth, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN912:\n        5 nominations in the Army beginning with Paul A. Barnett, Jr. and ending with Robert P. Mason\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN913:\n        Douglas E. Cole, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN914:\n        Schadaq Torres, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN915:\n        Augustine R. Wilson, in the Navy, to be LieutenantCommander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN916:\n        Haney D. Hong, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN917:\n        Dylan S. Maya, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN949:\n        Jason E. Little, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN950:\n        11 nominations in the Army beginning with Larry K.Creel and ending with Audley S. Salmon\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN951:\n        5 nominations in the Army beginning with Alfred L.Booker, Jr. and ending with Melissa L. Wardlaw\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN952:\n        2 nominations in the Army beginning with Christopher J. Hankey and ending with Jennifer M. Jaegers\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN953:\n        Chris R. Larsen, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN954:\n        11 nominations in the Army beginning with Christopher J. Calvano and ending with Alfredo E. Urdaneta\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN955:\n        16 nominations in the Army beginning with Ryan S. Casper and ending with Benjamin J. Weitzel, Jr.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN956:\n        Eugene S. Johnson, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN957:\n        2 nominations in the Army beginning with Brian V. Crupi and ending with Nathan C. Parrish\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN958:\n        2 nominations in the Army beginning with Daniel J.Mcintyre and ending with Kelley A. Peterson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN959:\n        Cale D. Magnuson, in the Marine Corps, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN960:\n        3 nominations in the Navy beginning with David J. Brown and ending with Reno R. Perryman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN961:\n        35 nominations in the Navy beginning with JonathanW. Alexander and ending with Leotra L. West\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN962:\n        56 nominations in the Navy beginning with VincenzoG. Alberico and ending with Cori R. Wallace\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN963:\n        203 nominations in the Navy beginning with Rachel S. Abraham and ending with Alton J. Zurlohavey\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN964:\n        50 nominations in the Navy beginning with Charles D. Ball III and ending with Colin N. Zook\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN965:\n        124 nominations in the Navy beginning with Christopher B. Abel and ending with Justin B. Woods\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN966:\n        69 nominations in the Navy beginning with Mark Adjei and ending with Ashly L. Wisniewski\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN967:\n        Kevin L. Jackson, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN968:\n        28 nominations in the Navy beginning with Jason R.Arant and ending with Stephen E. Velthuis\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN969:\n        28 nominations in the Navy beginning with Michael A. Berl and ending with Christopher M. Willich\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN970:\n        227 nominations in the Navy beginning with Adrian Aceveshurtado and ending with Michael T. Wyngarden\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN971:\n        164 nominations in the Navy beginning with Jennifer T. Adcock and ending with Daniel S. Zimmer\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN972:\n        63 nominations in the Navy beginning with Matthew C. Anderson and ending with Ili Yuan\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN973:\n        Albetro Alshabazz, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN974:\n        24 nominations in the Navy beginning with Kees A. Anderson and ending with Toby G. Via\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN975:\n        45 nominations in the Navy beginning with Asia M. Allison and ending with Heather L. Willis\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN976:\n        27 nominations in the Navy beginning with Skyler S. Barger and ending with Michael P. Watrol\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN977:\n        1060 nominations in the Navy beginning with JeremyT. Aaron and ending with Jonathan E. Zurita\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN982:\n        Joanne M. Whitlock, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN983:\n        Freddy R. Orellana, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN984:\n        22 nominations in the Army beginning with Angela M. Allmer and ending with Barbara J. Webster\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN985:\n        28 nominations in the Army beginning with Charles S. Benner and ending with Larry T. Wilson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN986:\n        29 nominations in the Army beginning with Apolla A. Benito and ending with Seo Y. Yang\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN987:\n        38 nominations in the Army beginning with Marvin W. Ashford, Jr. and ending with Matthew B. Woods IV\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN988:\n        29 nominations in the Army beginning with Christine C. Ancajas and ending with Kirk A. Yegerlehner\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN989:\n        115 nominations in the Army beginning with JessicaM. Alarcon and ending with 0002901370\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN990:\n        191 nominations in the Army beginning with Olumuyiwa G. Adesoye and ending with Zheng W. Zou\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN991:\n        79 nominations in the Army beginning with Richard T. Ahlstrom and ending with 0002535729\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN992:\n        22 nominations in the Army beginning with Taylor A. Alton and ending with Sarah M. Waibelwarner\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN993:\n        Matthew W. P. Burgoon, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN994:\n        Tyler J. Bradley, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN995:\n        129 nominations in the Navy beginning with CrystalR. Aandahl and ending with Jaime M. York\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN996:\n        22 nominations in the Navy beginning with Sarah A.Aguero and ending with Alexandra M. Stormer\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN997:\n        66 nominations in the Navy beginning with TemitopeO. Ayeni and ending with Gregory A. Wolfley\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN998:\n        57 nominations in the Navy beginning with Brooke T. Ahlstrom and ending with Michael K. Yang\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN999:\n        119 nominations in the Navy beginning with Miguel M. Alampay and ending with Ashley L. Zander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1000:\n        49 nominations in the Navy beginning with Derrick Abson and ending with Roderick A. Yard\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1001:\n        35 nominations in the Navy beginning with Gerardo A. Arbulubarandiaran and ending with Marianogerard Y. Zamora\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1002:\n        40 nominations in the Navy beginning with Bradley A. Albers and ending with Sean E. Zetooney\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1003:\n        38 nominations in the Navy beginning with Joshua J. Austring and ending with Chris L. Wilson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1004:\n        89 nominations in the Navy beginning with Kristoffer M. S. Abonal and ending with Matthew B. Zinger\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1005:\n        66 nominations in the Navy beginning with Stefani Ahsanov and ending with Gertian Xhafa\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1006:\n        14 nominations in the Navy beginning with MohammadK. Bahadar and ending with Brandon T. Vitton\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1007:\n        2 nominations in the Navy beginning with Luke R. Baden and ending with Gregory I. Basior\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1008:\n        17 nominations in the Navy beginning with Sarah E.Beemiller and ending with Colleen M. Wilmington\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1009:\n        73 nominations in the Navy beginning with Charles A. Allen and ending with Martin A. Zuber\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1010:\n        8 nominations in the Navy beginning with Erin M. Bacon and ending with Caroline A. Weachter\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1011:\n        12 nominations in the Navy beginning with Davis J.Anderson and ending with Adagray A. Willis\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1012:\n        Megan E. Jamison, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1013:\n        8 nominations in the Navy beginning with NathanielB. Alexander and ending with Bansari Sarkar\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1014:\n        Von H. Fernandes, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1030:\n        Melissa L. Hull, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1031:\n        Alicia C. Pallett, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1033:\n        Joshua N. Young, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1034:\n        6 nominations in the Army beginning with Amanda R.Campeau and ending with Charles V. Slider\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1035:\n        13 nominations in the Army beginning with Brian J.Allen and ending with David A. Worthy\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1036:\n        4 nominations in the Army beginning with Krista L.Bartolomucci and ending with Brendan J. Mayer\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1037:\n        David A. Boudreaux, Jr., in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1038:\n        Arthur A. Blain IV, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1039:\n        James A. Favuzzi, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1040:\n        Bryan A. Shipman, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1041:\n        Peter D. Helzer, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1042:\n        6 nominations in the Army beginning with Stephen L. Bossier and ending with Stephen M. Warren\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  9:46 p.m, the Presiding Officer (Ms. Klobuchar in the chair) declared the Senate adjourned, under its order of today, until  3 p.m. on Tuesday, October 3, 2023.","actionTimeStamp":"--"}]}