{"retrieved-date":"2022-12-9","actions-date":"Wednesday, December 7, 2022","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, December  7)","actionItem":"S. 1687 (Sen. Rubio):\n        A bill to amend section 21 of the Small Business Act to require cyber certification for small business development center counselors, and for other purposes.\n\n        -- Message on House action received in Senate and at desk: House amendment to Senate bill.\n\n\n S. 3092 (Sen. Padilla):\n        A bill to amend the Robert T. Stafford Disaster Relief and Emergency Assistance Act to improve the provision of certain disaster assistance, and for other purposes.\n\n        -- Senate agreed to the House amendment to S. 3092 by Unanimous Consent.\n\n\n S. 3316 (Sen. Grassley):\n        A bill to provide for certain whistleblower incentives and protections.\n\n        -- Senate Committee on Banking, Housing, and Urban Affairs discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Voice Vote.\n \n\n S.Amdt. 6507 (Sen. Grassley):\n        In the nature of a substitute.\n\n        --Amendment SA 6507 proposed by Senator Hassan for Senator Grassley.\n\n        --Amendment SA 6507 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 4577 (Sen. Peters):\n        A bill to improve plain writing and public experience, and for other purposes.\n\n        -- Passed Senate with amendments by Unanimous Consent.\n\n\n S.Res. 754 (Sen. Shaheen):\n        A resolution designating November 13, 2022, as \"National Warrior Call Day\" in recognition of the importance of connecting warriors in the United States to support structures necessary to transition from the battlefield.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Resolution agreed to in Senate without amendment and an amended preamble by Unanimous Consent.\n \n\n S.Amdt. 6508 (Sen. Shaheen):\n        To amend the preamble.\n\n        --Amendment SA 6508 proposed by Senator Hassan for Senator Shaheen.\n\n        --Amendment SA 6508 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 851 (Sen. Scott, of SC):\n        A resolution celebrating the 45th anniversary of the Senate Black Legislative Staff Caucus and its achievements in the Senate.\n\n        -- Senate Committee on Rules and Administration discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 863 (Sen. Smith):\n        A resolution designating November 2022 as \"National Lung Cancer Awareness Month\" and expressing support for early detection and treatment of lung cancer.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, December  7)","actionItem":"PN2266:\n        Jerry W. Blackwell, of Minnesota, to be United States District Judge for the District of Minnesota\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 43. Record Vote Number: 383 \n\n\n\n PN2366:\n        Kai N. Scott, of Pennsylvania, to be United States District Judge for the Eastern District of Pennsylvania\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 42. Record Vote Number: 379 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 42. Record Vote Number: 380 \n\n\n\n PN2367:\n        Mia Roberts Perez, of Pennsylvania, to be United States District Judge for the Eastern District of Pennsylvania\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 43. Record Vote Number: 378 \n\n\n\n PN2368:\n        John Frank Murphy, of Pennsylvania, to be United States District Judge for the Eastern District of Pennsylvania\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 63 - 28. Record Vote Number: 381 \n\n\n\n PN2438:\n        Jeffery Paul Hopkins, of Ohio, to be United States District Judge for the Southern District of Ohio\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 60 - 34. Record Vote Number: 382 \n\n\n        -- By unanimous consent agreement, debate and vote 12/8/2022.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Ms. Hassan, at  7:03 p.m., the Senate adjourned, under its order of today, until 11 a.m. tomorrow.","actionTimeStamp":"--"}]}