{"retrieved-date":"2024-3-21","actions-date":"Tuesday, March 19, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Friday, March 15, 2024,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Friday, March 15, 2024, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, March 19)","actionItem":"S.Res. 595 (Sen. Coons):\n        A resolution recognizing the contributions of AmeriCorps members and alumni and AmeriCorps Seniors volunteers in the lives of the people and communities of the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 596 (Sen. Duckworth):\n        A resolution recognizing Girl Scouts of the United States of America on its 112th birthday and celebrating its legacy of providing girls with a secure, inclusive space where they can explore their world, build meaningful relationships, and have access to experiences that prepare them for a life of leadership.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 597 (Sen. Murkowski):\n        A resolution recognizing the heritage, culture, and contributions of American Indian, Alaska Native, and Native Hawaiian women in the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, March 19)","actionItem":"PN1241:\n        Nicole G. Berner, of Maryland, to be United States Circuit Judge for the Fourth Circuit\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 47. Record Vote Number: 94","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  6:39 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}