{"retrieved-date":"2024-5-21","actions-date":"Thursday, May 16, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, May 16)","actionItem":"H.J.Res. 109 (Rep. Flood):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Securities and Exchange Commission relating to \"Staff Accounting Bulletin No. 121\".\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 60 - 38. Record Vote Number: 169 \n\n\n\n S.Res. 695 (Sen. Peters):\n        A resolution expressing support for the designation of May 2024 as \"Motorcycle Safety Awareness Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 696 (Sen. Braun):\n        A resolution honoring the life and legacy of Carl Daniel Erskine.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 697 (Sen. Graham):\n        A resolution designating the week of May 12 through May 18, 2024, as \"National Police Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 698 (Sen. Cassidy):\n        A resolution expressing support for the designation of June 9, 2024, as \"Veterans Get Outside Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 699 (Sen. Scott, of SC):\n        A resolution congratulating the students, parents, teachers, and leaders of charter schools across the United States for making ongoing contributions to education and supporting the ideals and goals of the 25th Annual National Charter Schools Week, to be held May 12 through May 18, 2024.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, May 16)","actionItem":"PN1238:\n        Seth Robert Aframe, of New Hampshire, to be United States Circuit Judge for the First Circuit\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 43. Record Vote Number: 171 \n\n\n\n PN1437:\n        Camela C. Theeler, of South Dakota, to be United States District Judge for the District of South Dakota\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 90 - 4. Record Vote Number: 170 \n\n\n\n PN1460:\n        Krissa M. Lanham, of Arizona, to be United States District Judge for the District of Arizona\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN1462:\n        Angela M. Martinez, of Arizona, to be United States District Judge for the District of Arizona\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  3:51 p.m, the Presiding Officer (Mr. Booker in the chair) declared the Senate adjourned, under its order of today, until  3 p.m. on Monday, May 20, 2024.","actionTimeStamp":"--"}]}