{"retrieved-date":"2024-2-2","actions-date":"Thursday, February 1, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, February  1)","actionItem":"S.Res. 529 (Sen. Whitehouse):\n        A resolution recognizing January 2024 as \"National Mentoring Month\".\n\n        -- Senate Committee on Health, Education, Labor, and Pensions discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 541 (Sen. Grassley):\n        A resolution supporting the observation of National Trafficking and Modern Slavery Prevention Month during the period beginning on January 1, 2024, and ending on February 1, 2024, to raise awareness of, and opposition to, human trafficking and modern slavery.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, February  1)","actionItem":"PN1113:\n        Kurt Campbell, of the District of Columbia, to be Deputy Secretary of State\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- By unanimous consent agreement, debate 2/5/2024.\n\n\n PN1239:\n        Amy M. Baggio, of Oregon, to be United States District Judge for the District of Oregon\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN1247:\n        Joseph Albert Laroski, Jr., of Maryland, to be a Judge of the United States Court of International Trade\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 97 - 0. Record Vote Number: 32 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, vote 2/5/2024.\n\n\n PN1257:\n        Lisa W. Wang, of the District of Columbia, to be a Judge of the United States Court of International Trade\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 43. Record Vote Number: 31 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 42. Record Vote Number: 33","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  3:54 p.m, the Presiding Officer (Mr. Booker in the chair) declared the Senate adjourned, under its order of today, until  3 p.m. on Monday, February 5, 2024.","actionTimeStamp":"--"}]}