{"retrieved-date":"2025-7-24","actions-date":"Wednesday, July 23, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, July 23)","actionItem":"H.R. 3944 (Rep. Carter):\n        A bill making appropriations for military construction, the Department of Veterans Affairs, and related agencies for the fiscal year ending September 30, 2026, and for other purposes.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 90 - 8. Record Vote Number: 428 \n\n\n        -- Measure laid before Senate by motion.\n\n\n H.Con.Res. 39 (Rep. Suozzi):\n        A concurrent resolution authorizing the use of Emancipation Hall in the Capitol Visitor Center for a ceremony to present the Congressional Gold Medals awarded under the Harlem Hellfighters Congressional Gold Medal Act.\n\n        -- Resolution agreed to in Senate without amendment by Unanimous Consent.\n\n\n S.Res. 267 (Sen. Welch):\n        A resolution honoring the deep and enduring friendship between the Kingdom of Denmark and the United States on the occasion of Danish Constitution Day celebrations.\n\n        -- Senate Committee on Foreign Relations discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 333 (Sen. Moody):\n        A resolution commending and congratulating the Florida Panthers on winning the 2025 Stanley Cup Final.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, July 23)","actionItem":"PN22-15:\n        Matthew Lohmeier, of Arizona, to be Under Secretary of the Air Force\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 49 - 47. Record Vote Number: 433 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate and vote 7/24/2025.\n\n\n PN22-25:\n        Arielle Roth, of the District of Columbia, to be Assistant Secretary of Commerce for Communications and Information\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 41. Record Vote Number: 426 \n\n\n\n PN24-3:\n        John Hurley, of California, to be Under Secretary for Terrorism and Financial Crimes\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 47. Record Vote Number: 427 \n\n\n\n PN25-53:\n        Aaron Szabo, of Virginia, to be an Assistant Administrator of the Environmental Protection Agency\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 48 - 47. Record Vote Number: 431 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 49 - 47. Record Vote Number: 432 \n\n\n\n PN150-1:\n        Zachary M. Bluestone, of Missouri, to be United States District Judge for the Eastern District of Missouri\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 49 - 47. Record Vote Number: 429 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 49 - 47. Record Vote Number: 430","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  9:11 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}