{"retrieved-date":"2025-6-27","actions-date":"Thursday, June 26, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, June 26)","actionItem":"S. 98 (Sen. Capito):\n        A bill to require the Federal Communications Commission to establish a vetting process for prospective applicants for high-cost universal service program funding.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n S. 257 (Sen. Cantwell):\n        A bill to improve the resilience of critical supply chains, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee amendments agreed to by Unanimous Consent.\n\n        -- Passed Senate with amendments by Unanimous Consent.\n \n\n S.Amdt. 2358 (Sen. Cantwell):\n        To modify the list of relevant committees of Congress.\n\n        --Amendment SA 2358 proposed by Senator Husted for Senator Cantwell.\n\n        --Amendment SA 2358 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 301 (Sen. Klobuchar):\n        A resolution condemning the attacks on Minnesota lawmakers in Brooklyn Park and Champlin, Minnesota and calling for unity and the rejection of political violence in Minnesota and across the United States.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 308 (Sen. Blackburn):\n        A resolution honoring the life, achievements, and legacy of Frederick W. Smith.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, June 26)","actionItem":"PN13-7:\n        Kenneth Kies, of Virginia, to be an Assistant Secretary of the Treasury\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, vote 6/26/2026.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 45. Record Vote Number: 327","actionTimeStamp":"--"},{"index":6,"header":"Recess","actionItem":"By unanimous consent, on the request of Mr. Husted, at  7:15 p.m., the Senate recessed, under its order of today, until  3 p.m. tomorrow.","actionTimeStamp":"--"}]}