{"retrieved-date":"2025-3-25","actions-date":"Tue, 25 Mar 2025 17:00:35 -0400","actions-title":"House Floor Proceedings","actions-count":53,"actions-list":[{"index":1,"header":"SPECIAL ORDER SPEECHES","actionItem":"The House resumed with Special Order speeches.","actionTimeStamp":"Tue, 25 Mar 2025 17:00:35 -0400"},{"index":2,"header":"The Speaker laid before the House a message from the President transmitting a notification of the issuance of an Executive Order that takes additional steps with respect to the national emergency declared in Executive Order 13692 of March 8, 2015 (Blocking Property and Suspending Entry of Certain Persons Contibuting to the Situation in Venezuela)","actionItem":"referred to the Committees on Foreign Affairs and Ways and Means and ordered to be printed (H. Doc. 119-32).","actionTimeStamp":"Tue, 25 Mar 2025 17:00:34 -0400"},{"index":3,"header":"SPECIAL ORDER SPEECHES","actionItem":"The House has concluded all anticipated legislative business and has proceeded to Special Order speeches.","actionTimeStamp":"Tue, 25 Mar 2025 16:03:52 -0400"},{"index":4,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with further one minute speeches.","actionTimeStamp":"Tue, 25 Mar 2025 16:01:00 -0400"},{"index":5,"header":"--","actionItem":"Committee of the Whole House on the state of the Union rises leaving H.R. 1048 as unfinished business.","actionTimeStamp":"Tue, 25 Mar 2025 15:59:21 -0400"},{"index":6,"header":"--","actionItem":"On motion that the committee rise Agreed to by voice vote.","actionTimeStamp":"Tue, 25 Mar 2025 15:59:08 -0400"},{"index":7,"header":"--","actionItem":"Mr. Walberg moved that the committee rise.","actionTimeStamp":"Tue, 25 Mar 2025 15:58:53 -0400"},{"index":8,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Tlaib amendment No. 6, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Ms. Tlaib demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 25 Mar 2025 15:58:12 -0400"},{"index":9,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 242, the Committee of the Whole proceeded with 10 minutes of debate on the Tlaib amendment No. 6.","actionTimeStamp":"Tue, 25 Mar 2025 15:48:49 -0400"},{"index":10,"header":"--","actionItem":"An amendment, offered by Ms. Tlaib,  numbered 6 printed in House Report 119-38 to amend the definition of \"Investment of Concern\" to include any entity that the Secretary of State determines consistently, knowingly, and directly facilitates and enables state violence and repression, war and occupation, or severe violations of international law and human rights.","actionTimeStamp":"Tue, 25 Mar 2025 15:48:40 -0400"},{"index":11,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Tlaib amendment No. 5, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Ms. Tlaib demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 25 Mar 2025 15:48:13 -0400"},{"index":12,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 242, the Committee of the Whole proceeded with 10 minutes of debate on the Tlaib amendment No. 5.","actionTimeStamp":"Tue, 25 Mar 2025 15:39:55 -0400"},{"index":13,"header":"--","actionItem":"An amendment, offered by Ms. Tlaib,  numbered 5 printed in House Report 119-38 to amend the definition of \"Foreign Country Of Concern\" to include any country that is defending a case before the International Court of Justice relating to an alleged violation of the Geneva Conventions of 1949 or their Additional Protocols or the Convention on the Prevention and Punishment of the Crime of Genocide; and to include any country the government of which includes officials that have outstanding arrest warrants issued by the International Criminal Court.","actionTimeStamp":"Tue, 25 Mar 2025 15:39:49 -0400"},{"index":14,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Self amendment No. 4, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Scott (VA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 25 Mar 2025 15:39:02 -0400"},{"index":15,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 242, the Committee of the Whole proceeded with 10 minutes of debate on the Self amendment No. 4.","actionTimeStamp":"Tue, 25 Mar 2025 15:35:59 -0400"},{"index":16,"header":"--","actionItem":"An amendment, offered by Mr. Self,  numbered 4 printed in House Report 119-38 to amend the threshold value at which gifts must be reported from $50,000 to $1.","actionTimeStamp":"Tue, 25 Mar 2025 15:35:44 -0400"},{"index":17,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Scott (VA) amendment No. 3, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Mr. Scott (VA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 25 Mar 2025 15:35:13 -0400"},{"index":18,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 242, the Committee of the Whole proceeded with 10 minutes of debate on the Scott (VA) amendment No. 3.","actionTimeStamp":"Tue, 25 Mar 2025 15:26:28 -0400"},{"index":19,"header":"--","actionItem":"An amendment, in the nature of a substitute offered by Mr. Scott (VA),  numbered 3 printed in House Report 119-38 to amend Section 117 to streamline foreign gift and contract reporting, aligns reporting with other federal research security compliance requirements, establishes sanctions for noncompliance and requires the Secretary of Education to conduct negotiated rulemaking to receive stakeholder feedback.","actionTimeStamp":"Tue, 25 Mar 2025 15:26:25 -0400"},{"index":20,"header":"--","actionItem":"On agreeing to the Ogles amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 25 Mar 2025 15:25:53 -0400"},{"index":21,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 242, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 2.","actionTimeStamp":"Tue, 25 Mar 2025 15:21:13 -0400"},{"index":22,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 2 printed in House Report 119-38 to amend the definition of 'foreign entity of concern' to include Chinese military companies identified on the list required by section 1260H of the FY 2021 NDAA (colloquially referred to as the \"Section 1260H list\").","actionTimeStamp":"Tue, 25 Mar 2025 15:20:21 -0400"},{"index":23,"header":"--","actionItem":"On agreeing to the Ogles amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 25 Mar 2025 15:20:10 -0400"},{"index":24,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 242, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 1.","actionTimeStamp":"Tue, 25 Mar 2025 15:10:51 -0400"},{"index":25,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 1 printed in House Report 119-38 to include any special administrative region or other territory within one of the covered nations referenced in the bill within the bill's definition of \"foreign country of concern.\"","actionTimeStamp":"Tue, 25 Mar 2025 15:10:20 -0400"},{"index":26,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 1048.","actionTimeStamp":"Tue, 25 Mar 2025 14:30:52 -0400"},{"index":27,"header":"--","actionItem":"The Speaker designated the Honorable Pat Harrigan to act as Chairman of the Committee.","actionTimeStamp":"Tue, 25 Mar 2025 14:30:27 -0400"},{"index":28,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 242 and Rule XVIII.","actionTimeStamp":"Tue, 25 Mar 2025 14:30:26 -0400"},{"index":29,"header":"--","actionItem":"Rule provides for consideration of H.J. Res. 24, H.J. Res. 75 and H.R. 1048. The resolution provides for consideration of H.J. Res. 24 and H.J. Res. 75 under a closed rule, and provides for consideration of H.R. 1048 under a structured rule. Also, the resolution provides for one hour of general debate and one motion to recommit on each measure.","actionTimeStamp":"Tue, 25 Mar 2025 14:29:15 -0400"},{"index":30,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 242. H.R. 1048 — \"To amend the Higher Education Act of 1965 to strengthen disclosure requirements relating to foreign gifts and contracts, to prohibit contracts between institutions of higher education and certain foreign entities and countries of concern, and for other purposes.\"","actionTimeStamp":"Tue, 25 Mar 2025 14:29:10 -0400"},{"index":31,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Tue, 25 Mar 2025 14:28:50 -0400"},{"index":32,"header":"On agreeing to the resolution Agreed to by recorded vote: 214","actionItem":"207 (Roll no. 76).","actionTimeStamp":"Tue, 25 Mar 2025 14:28:49 -0400"},{"index":33,"header":"On ordering the previous question Agreed to by the Yeas and Nays: 215","actionItem":"208 (Roll no. 75).","actionTimeStamp":"Tue, 25 Mar 2025 14:05:18 -0400"},{"index":34,"header":"--","actionItem":"Considered as unfinished business. H. Res. 242 — \"Providing for consideration of the joint resolution (H.J. Res. 24) providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Department of Energy relating to \"Energy Conservation Program: Energy Conservation Standards for Walk-In Coolers and Walk-In Freezers\"; providing for consideration of the joint resolution (H.J. Res. 75) providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Office of Energy Efficiency and Renewable Energy, Department of Energy relating to \"Energy Conservation Program: Energy Conservation Standards for Commercial Refrigerators, Freezers, and Refrigerator-Freezers\"; and providing for consideration of the bill (H.R. 1048) to amend the Higher Education Act of 1965 to strengthen disclosure requirements relating to foreign gifts and contracts, to prohibit contracts between institutions of higher education and certain foreign entities and countries of concern, and for other purposes.\"","actionTimeStamp":"Tue, 25 Mar 2025 13:56:26 -0400"},{"index":35,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Tue, 25 Mar 2025 13:56:24 -0400"},{"index":36,"header":"On motion to suspend the rules and pass the bill Agreed to by the Yeas and Nays: (2/3 required): 350","actionItem":"73 (Roll no. 74).","actionTimeStamp":"Tue, 25 Mar 2025 13:56:23 -0400"},{"index":37,"header":"--","actionItem":"Considered as unfinished business. H.R. 1534 — \"To strengthen and enhance the competitiveness of American industry through the research and development of advanced technologies to improve the efficiency of cement, concrete, and asphalt production, and for other purposes.\"","actionTimeStamp":"Tue, 25 Mar 2025 13:28:26 -0400"},{"index":38,"header":"UNFINISHED BUSINESS","actionItem":"The Chair announced that the unfinished business was the question on motion to suspend the rules and pass H.R. 1534, ordering the previous question on H. Res. 242 and on agreeing to the resolution, if ordered, which had been debated earlier and on which further proceedings had been postponed.","actionTimeStamp":"Tue, 25 Mar 2025 13:28:08 -0400"},{"index":39,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on H. Res. 242, the Chair put the question on ordering the previous question and by voice vote, announced that the ayes had prevailed. Mr. Neguse demanded the yeas and nays and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 25 Mar 2025 13:26:26 -0400"},{"index":40,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 242.","actionTimeStamp":"Tue, 25 Mar 2025 12:25:48 -0400"},{"index":41,"header":"--","actionItem":"Considered as privileged matter. H. Res. 242 — \"Providing for consideration of the joint resolution (H.J. Res. 24) providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Department of Energy relating to \"Energy Conservation Program: Energy Conservation Standards for Walk-In Coolers and Walk-In Freezers\"; providing for consideration of the joint resolution (H.J. Res. 75) providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Office of Energy Efficiency and Renewable Energy, Department of Energy relating to \"Energy Conservation Program: Energy Conservation Standards for Commercial Refrigerators, Freezers, and Refrigerator-Freezers\"; and providing for consideration of the bill (H.R. 1048) to amend the Higher Education Act of 1965 to strengthen disclosure requirements relating to foreign gifts and contracts, to prohibit contracts between institutions of higher education and certain foreign entities and countries of concern, and for other purposes.\"","actionTimeStamp":"Tue, 25 Mar 2025 12:24:40 -0400"},{"index":42,"header":"Coordinating Council on Juvenile Justice and Delinquency Prevention","actionItem":"Pursuant to section 206 of the Juvenile Justice and Delinquency Prevention Act (34 U.S.C. 11116), and the order of the House of January 3, 2025, the Speaker appointed Mr. Julian Whittington, Benton, Louisiana (two-year term).","actionTimeStamp":"Tue, 25 Mar 2025 12:21:51 -0400"},{"index":43,"header":"Library of Congress Trust Fund Board","actionItem":"Pursuant to section 1 of the Library of Congress Trust Fund Board Act (2 U.S.C. 154), and the order of the House of January 3, 2025, the Speaker appointed Mr. Steven L. Swig, San Francisco, California (five-year term).","actionTimeStamp":"Tue, 25 Mar 2025 12:21:01 -0400"},{"index":44,"header":"--","actionItem":"The House received a message from the Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Representatives, the Clerk notified the House that he had received the following message from the Secretary of the Senate on March 25, 2025, at 11:10 a.m.: Appointment: Congressional Award Board.","actionTimeStamp":"Tue, 25 Mar 2025 12:20:25 -0400"},{"index":45,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair would be limited to 15 per side of the aisle.","actionTimeStamp":"Tue, 25 Mar 2025 12:03:30 -0400"},{"index":46,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Ms. Ross to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Tue, 25 Mar 2025 12:02:44 -0400"},{"index":47,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Tue, 25 Mar 2025 12:02:35 -0400"},{"index":48,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Tue, 25 Mar 2025 12:01:26 -0400"},{"index":49,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of March 25.","actionTimeStamp":"Tue, 25 Mar 2025 12:00:00 -0400"},{"index":50,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Tue, 25 Mar 2025 10:52:49 -0400"},{"index":51,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Tue, 25 Mar 2025 10:00:36 -0400"},{"index":52,"header":"--","actionItem":"The Speaker designated the Honorable Mike Bost to act as Speaker pro tempore for today.","actionTimeStamp":"Tue, 25 Mar 2025 10:00:16 -0400"},{"index":53,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Tue, 25 Mar 2025 10:00:00 -0400"}]}