{"retrieved-date":"2026-2-3","actions-date":"Friday, January 30, 2026","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Friday, January 30)","actionItem":"H.R. 7148 (Rep. Cole):\n        A bill making further consolidated appropriations for the fiscal year ending September 30, 2026, and for other purposes .\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Cloture motion on the motion to proceed rendered moot in Senate.\n\n        -- Motion by Senator Thune to reconsider the vote by which cloture on the motion to proceed to H.R.7148 was not invoked (Record Vote No. 13) rendered moot in Senate.\n\n        -- Passed Senate, under the order of 1/30/2026, having achieved 60 votes in the affirmative, with amendments by Yea-Nay Vote. 71 - 29. Record Vote Number: 20 \n\n \n\n S.Amdt. 4234 (Sen. Lee):\n        To strike the earmark for the Community and Training Center by the New Immigrant Community Empowerment .\n\n        --Amendment SA 4234 proposed by Senator Scott FL for Senator Lee.\n\n        --Motion to table amendment SA 4234 agreed to in Senate by Yea-Nay Vote. 58 - 42. Record Vote Number: \n\n\n S.Amdt. 4236 (Sen. Lee):\n        To strike all earmarks.\n\n        --Amendment SA 4236 proposed by Senator Lee.\n\n        --Motion to table amendment SA 4236 agreed to in Senate by Yea-Nay Vote. 67 - 33. Record Vote Number: \n\n\n S.Amdt. 4241 (Sen. Schmitt):\n        To eliminate National Endowment for Democracy funding.\n\n        --Amendment SA 4241 proposed by Senator Schmitt.\n\n        --Amendment SA 4241 not agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 4272 (Sen. Paul):\n        To eliminate funding for refugee and entrant assistance.\n\n        --Amendment SA 4272 proposed by Senator Paul.\n\n        --Amendment SA 4272 not agreed to in Senate by Yea-Nay Vote. 32 - 67. Record Vote Number: \n\n\n S.Amdt. 4273 (Sen. Collins):\n        To provide continuing appropriations for the Department of Homeland Security.\n\n        --Amendment SA 4273 proposed by Senator Collins.\n\n        --Amendment SA 4273 agreed to in Senate by Unanimous Consent.\n\n\n S.Amdt. 4286 (Sen. Lee):\n        To eliminate funding for the United States African Development Foundation.\n\n        --Amendment SA 4286 proposed by Senator Lee.\n\n        --Motion to table agreed to in Senate by Yea-Nay Vote. 58 - 42. Record Vote Number: \n\n\n S.Amdt. 4287 (Sen. Merkley):\n        To prevent the deferral or rescission of appropriations within 90 days of their expiration.\n\n        --Amendment SA 4287 proposed by Senator Merkley.\n\n        --Point of order that the amendment violates section 306 of the CBA raised in Senate with respect to amendment SA 4287.\n\n        --Motion to waive all applicable budgetary discipline with respect to amendment SA 4287, not having achieved 60 votes in the affirmative, rejected in Senate by Yea-Nay Vote. 47 - 52. Record Vote Number: \n\n        --Amendment SA 4287 ruled out of order by the chair.\n\n\n S.Amdt. 4290 (Sen. Sanders):\n        To rescind certain amounts appropriated for U.S. Immigration and Customs Enforcement and certain changes to Medicaid .\n\n        --Amendment SA 4290 proposed by Senator Sanders.\n\n        --Amendment SA 4290, under the order of 1/30/2026, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 49 - 51. Record Vote Number: \n\n\n\n\n S.Res. 595 (Sen. Young):\n        A resolution congratulating the Indiana University Hoosiers football team for winning the 2026 College Football Playoff National Championship and completing an undefeated 16-0 season .\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Friday, January 30)","actionItem":"PN685:\n        2 nominations in the Marine Corps beginning with Col. Joshua E. Izenour and ending with Col. Guillermo Rosales, Jr .\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN702:\n        Gen. John D. Lamontagne, in the Air Force, to be General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN703:\n        Brig. Gen. Christopher A. Eason, in the Air Force, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN709-1:\n        16 nominations in the Army beginning with Brig. Gen. Phillip C. Baker and ending with Brig. Gen. Patrick A. Teague\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN710:\n        Brig. Gen. Rhett R. Cox, in the Army, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN712-3:\n        Lt. Gen. Patrick D. Frank, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN712-5:\n        4 nominations in the Air Force beginning with Lt. Gen. Stephen F. Jost and ending with Maj. Gen. Joel L. Carey\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN713:\n        2 nominations in the Marine Corps beginning with Brig. Gen. Raymond L. Adams and ending with Brig. Gen. John K. Jarrard\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN715-1:\n        4 nominations in the Navy beginning with Vice Adm. Jeffrey T. Jablon and ending with Rear Adm. Douglas C. Verissimo\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN715-2:\n        2 nominations in the Marine Corps beginning with Maj. Gen. Lorna M. Mahlock and ending with Maj. Gen. Sean M. Salene\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN719:\n        Paul V. Johnson, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN720:\n        Raymond F. Jaklitsch, Jr., in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN726-5:\n        David Clay Fowlkes, of Arkansas, to be United States District Judge for the Western District of Arkansas\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN726-6:\n        Nicholas Jon Ganjei, of Texas, to be United States District Judge for the Southern District of Texas\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN726-12:\n        Aaron Christian Peterson, of Alaska, to be United States District Judge for the District of Alaska\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN727:\n        Col. Christine C. Piper, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN728:\n        Col. Jodi J. Smith, in the Army, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN729:\n        Lt. Gen. Francis L. Donovan, in the Marine Corps, to be General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN731:\n        Patrick W. McMorrow, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN732:\n        Sunil L. Amin, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN733:\n        Leslie A. Woll, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN734:\n        238 nominations in the Air Force beginning with Ayad M. Abisaab and ending with Anthony P. Zelasko\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN735:\n        Evangeline C. Obi, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN736:\n        Adrianna Perez, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN737:\n        Timothy T. Chan, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN738:\n        Michael P. Thomas, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN739:\n        Scott M. McGinley, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN740:\n        Anthony C. Kight, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN741:\n        22 nominations in the Army beginning with Krista L . Bartolomucci and ending with Abraham L. Young\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN742:\n        Scott M. Katalenich, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN743:\n        Mark J. Crow, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN744:\n        Mark C. Rummel, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN745:\n        Christopher Fuhriman, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN746:\n        Javier F. Barrera, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN747:\n        2 nominations in the Marine Corps beginning with Andrew J. Clarke and ending with Joel C. Ellis\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN748:\n        2 nominations in the Marine Corps beginning with Darien J. Garland and ending with Andres A. Madera\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN749:\n        2 nominations in the Marine Corps beginning with Jason R. Mclamb and ending with George Vinay\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN750:\n        6 nominations in the Marine Corps beginning with Travis L. Elliott and ending with Nathen J. Werner\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN754:\n        Thomas J. Heinsohn, in the Marine Corps, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN755:\n        4 nominations in the Marine Corps beginning with Brencent T. Berry and ending with Andrew J. Vanhoogmoed\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN756:\n        2 nominations in the Marine Corps beginning with John R. Hall, Jr. and ending with Nicholas G. Welborne\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN757:\n        2 nominations in the Marine Corps beginning with Robert S. Jevning and ending with Gregorio W. Pro\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN758:\n        8 nominations in the Marine Corps beginning with David K. Burger and ending with Joseph F. Soileau\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN760:\n        Steven S. Mitchell, Jr., in the Marine Corps, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN761:\n        Ryan D. Curran, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN762:\n        2 nominations in the Navy beginning with Satya K. Gutta and ending with Luis E. Torres\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN763:\n        Timothy R. Trimble, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN764:\n        Victor C. Schaefer, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN765:\n        Ashley E. Allison, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN766:\n        Jess B. Feldon, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN767:\n        8 nominations in the Navy beginning with Reza J. Mehran and ending with Parsa P. Salehi\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN768:\n        4 nominations in the Navy beginning with Anita R. Bhardwaj and ending with Brandee D. Wimberly\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN770-1:\n        Maj. Gen. Brian W. Gibson, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN770-2:\n        Maj. Gen. B. Mark Pye, in the Air Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN770-4:\n        3 nominations in the Marine Corps beginning with Lt. Gen. James H. Adams III and ending with Lt. Gen. Joseph A. Matos III\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN771-1:\n        31 nominations in the Army beginning with Brig. Gen. Derek L. Adams and ending with Brig. Gen. Matthew S. Woodruff\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN772:\n        Brig. Gen. Diane L. Dunn, in the Army, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN773-1:\n        Maj. Gen. Marcus B. Annibale, in the Marine Corps, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN773-2:\n        Rear Adm. Richard E. Seif, Jr., in the Navy, to be Vice Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN774:\n        Marcus W. C. MacNealy, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN775:\n        Joseph D. Frjelich, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN776:\n        2 nominations in the Army beginning with Scott D. Gale and ending with Allie M. Scott\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN777:\n        Andrew J. Withington, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN778:\n        Casey C. Gower, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN779:\n        2 nominations in the Army beginning with Clyde B. Gore, Jr. and ending with Matthew B. Mcdonald\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN782:\n        2 nominations in the Navy beginning with John B. Newman and ending with Natasha Rai Morris\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN783:\n        Ian W. McMenamin, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN784:\n        2 nominations in the Navy beginning with Lawrence E. Burkart and ending with Brendon W. Kiely\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN785:\n        15 nominations in the Navy beginning with Ali A.W. Abdul Wahid and ending with Imani N. Williams-Vaughn\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  7:15 p.m, the Presiding Officer (Mr. Husted in the chair) declared the Senate adjourned, under its order of today, until  3 p.m. on Monday, February 2, 2026.","actionTimeStamp":"--"}]}