{"retrieved-date":"2024-5-2","actions-date":"Wednesday, May 1, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, May  1)","actionItem":"H.R. 3935 (Rep. Graves):\n        A bill to amend title 49, United States Code, to reauthorize and improve the Federal Aviation Administration and other civil aviation programs, and for other purposes.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Cloture on the motion to proceed to the measure invoked in Senate by Yea-Nay Vote. 89 - 10. Record Vote Number: 157 \n\n\n\n S. 2181 (Sen. Peters):\n        A bill to amend title 38, United States Code, to repeal the sunset on entitlement to memorial headstones and markers for commemoration of veterans and certain individuals and to repeal the sunset on authority to bury remains of certain spouses and children in national cemeteries, and for other purposes.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 3126 (Sen. Braun):\n        A bill to amend title 38, United States Code, to authorize the Secretary of Veterans Affairs to furnish or replace a headstone, marker, or medallion for the grave of an eligible Medal of Honor recipient regardless of the recipient's dates of service in the Armed Forces, and for other purposes.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 668 (Sen. Scott, of FL):\n        A resolution honoring the life of Daniel Robert \"Bob\" Graham, former Senator for the State of Florida.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, May  1)","actionItem":"PN1358:\n        Gary D. Grimes, Sr., of Arkansas, to be United States Marshal for the Western District of Arkansas for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1370:\n        Clinton J. Fuchs, of Maryland, to be United States Marshal for the District of Maryland for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1458:\n        Georgia N. Alexakis, of Illinois, to be United States District Judge for the Northern District of Illinois\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 54 - 44. Record Vote Number: 156","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Ms. Hassan, at  6:58 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}