{"retrieved-date":"2025-5-16","actions-date":"Thursday, May 15, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, May 15)","actionItem":"S. 1582 (Sen. Hagerty):\n        A bill to provide for the regulation of payment stablecoins, and for other purposes.\n\n        -- Second cloture motion on the motion to proceed presented in Senate.\n\n\n S.Res. 231 (Sen. Collins):\n        A resolution recognizing the roles and contributions of the teachers of the United States in building and enhancing the civic, cultural, and economic well-being of the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 232 (Sen. Daines):\n        A resolution designating May 2025 as \"National Brain Tumor Awareness Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 233 (Sen. Moody):\n        A resolution commending and congratulating the University of Florida men's basketball team for winning the 2025 National Collegiate Athletic Association Men's Basketball Championship.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, May 15)","actionItem":"PN24-4:\n        Charles Kushner, of New York, to be Ambassador to the French Republic, and to serve concurrently and without additional compensation as Ambassador to the Principality of Monaco\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN25-11:\n        Sean Donahue, of Florida, to be an Assistant Administrator of the Environmental Protection Agency\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 46. Record Vote Number: 258","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  3:16 p.m, the Presiding Officer (Mr. Moreno in the chair) declared the Senate adjourned, under its order of today, until  3 p.m. on Monday, May 19, 2025.","actionTimeStamp":"--"}]}