{"retrieved-date":"2025-9-10","actions-date":"Wed, 10 Sep 2025 17:19:09 -0400","actions-title":"House Floor Proceedings","actions-count":89,"actions-list":[{"index":1,"header":"On agreeing to the Greene (GA) amendment (A015) Roll Call 254","actionItem":"Recorded vote pending.","actionTimeStamp":"Wed, 10 Sep 2025 17:19:09 -0400"},{"index":2,"header":"--","actionItem":"On agreeing to the Mills amendment; Agreed to by recorded vote: (Roll no. 253).","actionTimeStamp":"Wed, 10 Sep 2025 17:18:43 -0400"},{"index":3,"header":"--","actionItem":"On agreeing to the Wilson (SC) amendment; Agreed to by recorded vote: (Roll no. 252).","actionTimeStamp":"Wed, 10 Sep 2025 17:15:31 -0400"},{"index":4,"header":"--","actionItem":"On agreeing to the Patronis amendment; Agreed to by recorded vote: (Roll no. 251).","actionTimeStamp":"Wed, 10 Sep 2025 17:11:54 -0400"},{"index":5,"header":"--","actionItem":"On agreeing to the Smith (NJ) amendment; Failed by recorded vote: (Roll no. 250).","actionTimeStamp":"Wed, 10 Sep 2025 17:08:10 -0400"},{"index":6,"header":"--","actionItem":"On agreeing to the Mace amendment; Agreed to by recorded vote: (Roll no. 249).","actionTimeStamp":"Wed, 10 Sep 2025 17:04:10 -0400"},{"index":7,"header":"--","actionItem":"On agreeing to the Mace amendment; Agreed to by recorded vote: (Roll no. 248).","actionTimeStamp":"Wed, 10 Sep 2025 17:00:51 -0400"},{"index":8,"header":"--","actionItem":"On agreeing to the Mace amendment; Agreed to by recorded vote: (Roll no. 247).","actionTimeStamp":"Wed, 10 Sep 2025 16:57:51 -0400"},{"index":9,"header":"--","actionItem":"On agreeing to the Mace amendment; Agreed to by recorded vote: (Roll no. 246).","actionTimeStamp":"Wed, 10 Sep 2025 16:54:43 -0400"},{"index":10,"header":"--","actionItem":"On agreeing to the Norman amendment; Agreed to by recorded vote: (Roll no. 245).","actionTimeStamp":"Wed, 10 Sep 2025 16:50:38 -0400"},{"index":11,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Wed, 10 Sep 2025 16:45:37 -0400"},{"index":12,"header":"--","actionItem":"Considered as unfinished business. H.R. 3838 — \"To authorize appropriations for fiscal year 2026 for military activities of the Department of Defense, for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\"","actionTimeStamp":"Wed, 10 Sep 2025 16:45:25 -0400"},{"index":13,"header":"ADJUSTMENT OF THE WHOLE NUMBER OF THE HOUSE","actionItem":"Under Clause 5(d) of Rule XX, the Chair announced to the House that, in light of the administration of the Oath of Office to the Gentleman from Virginia, Mr. Walkinshaw, the whole number of the House is 432.","actionTimeStamp":"Wed, 10 Sep 2025 16:45:10 -0400"},{"index":14,"header":"OATH OF OFFICE","actionItem":"Representative-Elect James R. Walkinshaw, Eleventh District, State of Virginia, presented himself in the well of the House for the purpose of taking the Oath of Office which was administered by the Speaker of the House.","actionTimeStamp":"Wed, 10 Sep 2025 16:40:03 -0400"},{"index":15,"header":"--","actionItem":"The House received a message from the Clerk. The Clerk transmitted to the House a copy of a letter received from Ms. DJ Geiger, Director of Operations, with the Virginia Department of Elections indicating that, according to the unofficial results for the Special General Election held on September 9, 2025, the Honorable James R. Walkinshaw was elected Representative to Congress for the Eleventh Congressional District of Virginia.","actionTimeStamp":"Wed, 10 Sep 2025 16:39:30 -0400"},{"index":16,"header":"MOMENT OF PRAYER","actionItem":"The House observed a moment of prayer for Charlie Kirk and and his family.","actionTimeStamp":"Wed, 10 Sep 2025 16:36:29 -0400"},{"index":17,"header":"--","actionItem":"Committee of the Whole House on the state of the Union rises leaving H.R. 3838 as unfinished business.","actionTimeStamp":"Wed, 10 Sep 2025 16:36:28 -0400"},{"index":18,"header":"--","actionItem":"On motion that the committee rise Agreed to by voice vote.","actionTimeStamp":"Wed, 10 Sep 2025 16:35:56 -0400"},{"index":19,"header":"--","actionItem":"Mr. Rogers (AL) moved that the committee rise.","actionTimeStamp":"Wed, 10 Sep 2025 16:35:37 -0400"},{"index":20,"header":"--","actionItem":"On agreeing to the Meeks amendment; Agreed to by recorded vote: (Roll no. 244).","actionTimeStamp":"Wed, 10 Sep 2025 16:35:31 -0400"},{"index":21,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Wed, 10 Sep 2025 16:04:28 -0400"},{"index":22,"header":"--","actionItem":"Considered as unfinished business. H.R. 3838 — \"To authorize appropriations for fiscal year 2026 for military activities of the Department of Defense, for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\"","actionTimeStamp":"Wed, 10 Sep 2025 16:04:14 -0400"},{"index":23,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of September 10.","actionTimeStamp":"Wed, 10 Sep 2025 16:02:32 -0400"},{"index":24,"header":"--","actionItem":"The Speaker announced that the House do now recess for a period of less than 15 minutes.","actionTimeStamp":"Wed, 10 Sep 2025 15:45:53 -0400"},{"index":25,"header":"--","actionItem":"Committee of the Whole House on the state of the Union rises leaving H.R. 3838 as unfinished business.","actionTimeStamp":"Wed, 10 Sep 2025 15:45:17 -0400"},{"index":26,"header":"--","actionItem":"On motion that the committee rise Agreed to by voice vote.","actionTimeStamp":"Wed, 10 Sep 2025 15:45:05 -0400"},{"index":27,"header":"--","actionItem":"Mr. Rogers (AL) moved that the committee rise.","actionTimeStamp":"Wed, 10 Sep 2025 15:44:52 -0400"},{"index":28,"header":"--","actionItem":"On agreeing to the Rogers (AL) amendments; Agreed to by voice vote.","actionTimeStamp":"Wed, 10 Sep 2025 15:44:30 -0400"},{"index":29,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 682, the Committee of the Whole proceeded with 40 minutes of debate on the Rogers (AL) amendment en bloc No. 5.","actionTimeStamp":"Wed, 10 Sep 2025 15:21:29 -0400"},{"index":30,"header":"--","actionItem":"Amendments en bloc  offered by Mr. Rogers (AL),  comprised of the following amendments printed in Part A of House Report 119-255 as en bloc No. 5: Nos. 26, 31, 32, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 296, 297, and 298.","actionTimeStamp":"Wed, 10 Sep 2025 15:20:36 -0400"},{"index":31,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Rose amendment No. 253, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Rose demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 10 Sep 2025 15:20:11 -0400"},{"index":32,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 682, the Committee of the Whole proceeded with 10 minutes of debate on the Rose amendment No. 253.","actionTimeStamp":"Wed, 10 Sep 2025 15:16:19 -0400"},{"index":33,"header":"--","actionItem":"An amendment, offered by Mr. Rose,  numbered 253 printed in Part A of House Report 119-255 to require the Secretary of Defense to submit a report to the House and Senate Committees on Armed Services on the fraud scheme perpetrated by Janet Yamanaka Mello, a civilian employee of the Department of the Army who was indicted and pleaded guilty to stealing over $100 million in 4-H Military Partnership Grant program funds.","actionTimeStamp":"Wed, 10 Sep 2025 15:15:48 -0400"},{"index":34,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Meeks amendment No. 34, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Mast demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 10 Sep 2025 15:15:08 -0400"},{"index":35,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 682, the Committee of the Whole proceeded with 10 minutes of debate on the Meeks amendment No. 34.","actionTimeStamp":"Wed, 10 Sep 2025 15:05:55 -0400"},{"index":36,"header":"--","actionItem":"An amendment, offered by Mr. Meeks,  numbered 34 printed in Part A of House Report 119-255 to insert the text of H.R. 1488, repealing the 2002 and 1991, Authorization for Use of Military Force (AUMFs).","actionTimeStamp":"Wed, 10 Sep 2025 15:05:32 -0400"},{"index":37,"header":"--","actionItem":"On agreeing to the Rouzer amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 10 Sep 2025 15:05:13 -0400"},{"index":38,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 682, the Committee of the Whole proceeded with 10 minutes of debate on the Rouzer amendment No. 33.","actionTimeStamp":"Wed, 10 Sep 2025 14:58:24 -0400"},{"index":39,"header":"An amendment, offered by Mr. Rouzer,  numbered 33 printed in Part A of House Report 119-255 to incorporate the text of H.R. 474","actionItem":"Lumbee Fairness Act, extends federal recognition to the Lumbee Tribe of North Carolina and makes its members eligible for the services and benefits provided to members of federally recognized tribes. The Department of the Interior and the Department of Health and Human Services must develop, in consultation with the tribe, a determination of needs to provide the services for which members of the tribe are eligible.","actionTimeStamp":"Wed, 10 Sep 2025 14:57:59 -0400"},{"index":40,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Biggs (AZ) amendment No. 29, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Elfreth demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 10 Sep 2025 14:57:23 -0400"},{"index":41,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 682, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs (AZ) amendment No. 29.","actionTimeStamp":"Wed, 10 Sep 2025 14:46:56 -0400"},{"index":42,"header":"--","actionItem":"An amendment, offered by Mr. Biggs (AZ),  numbered 29 printed in Part A of House Report 119-255 to prohibit the designation of military and certain National Guard lands as critical habitats under the Endangered Species Act when deemed necessary by the Department of Defense. Exempts military personnel from Endangered Species Act prohibitions during national defense-related operations, including incidental harm to protected species.","actionTimeStamp":"Wed, 10 Sep 2025 14:46:23 -0400"},{"index":43,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the McCormick amendment No. 25, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Smith (WA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 10 Sep 2025 14:45:49 -0400"},{"index":44,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 682, the Committee of the Whole proceeded with 10 minutes of debate on the McCormick amendment No. 25.","actionTimeStamp":"Wed, 10 Sep 2025 14:33:31 -0400"},{"index":45,"header":"--","actionItem":"An amendment, offered by Mr. McCormick,  numbered 25 printed in Part A of House Report 119-255 to amend Section 1555 of the FY24 NDAA regarding contracting for military recruitment to prohibit the Department of Defense from contracting with entities that perform fact-checking and information-grading services for purposes of censoring their political opponents.","actionTimeStamp":"Wed, 10 Sep 2025 14:33:05 -0400"},{"index":46,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Greene (GA) amendment No. 24, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Ms. Greene (GA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 10 Sep 2025 14:32:21 -0400"},{"index":47,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 682, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 24.","actionTimeStamp":"Wed, 10 Sep 2025 14:21:29 -0400"},{"index":48,"header":"--","actionItem":"An amendment, offered by Ms. Greene (GA),  numbered 24 printed in Part A of House Report 119-255 to strike foreign aid funding for the Taiwan Security Cooperation Initiative.","actionTimeStamp":"Wed, 10 Sep 2025 14:20:25 -0400"},{"index":49,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Greene (GA) amendment No. 23, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Smith (WA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 10 Sep 2025 14:20:05 -0400"},{"index":50,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 682, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 23.","actionTimeStamp":"Wed, 10 Sep 2025 14:08:50 -0400"},{"index":51,"header":"--","actionItem":"An amendment, offered by Ms. Greene (GA),  numbered 23 printed in Part A of House Report 119-255 to strike funding for Overseas Humanitarian, Disaster, and Civic Aid program.","actionTimeStamp":"Wed, 10 Sep 2025 14:08:45 -0400"},{"index":52,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Greene (GA) amendment No. 22, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Smith (WA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 10 Sep 2025 14:08:19 -0400"},{"index":53,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 682, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 22.","actionTimeStamp":"Wed, 10 Sep 2025 13:55:46 -0400"},{"index":54,"header":"--","actionItem":"An amendment, offered by Ms. Greene (GA),  numbered 22 printed in Part A of House Report 119-255 to prohibit assistance to Ukraine.","actionTimeStamp":"Wed, 10 Sep 2025 13:55:12 -0400"},{"index":55,"header":"--","actionItem":"On agreeing to the Scott, Austin amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 10 Sep 2025 13:54:52 -0400"},{"index":56,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 682, the Committee of the Whole proceeded with 10 minutes of debate on the Austin Scott amendment No. 21.","actionTimeStamp":"Wed, 10 Sep 2025 13:46:12 -0400"},{"index":57,"header":"--","actionItem":"An amendment, offered by Mr. Scott, Austin,  numbered 21 printed in Part A of House Report 119-255 to authorize the Baltic Security Initiative to strengthen the armed forces of Estonia, Latvia, and Lithuania to deter Russian aggression, increase interoperability, and support modernization.","actionTimeStamp":"Wed, 10 Sep 2025 13:45:54 -0400"},{"index":58,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Greene (GA) amendment No. 20, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Brownley demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 10 Sep 2025 13:45:29 -0400"},{"index":59,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 682, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 20.","actionTimeStamp":"Wed, 10 Sep 2025 13:34:33 -0400"},{"index":60,"header":"--","actionItem":"An amendment, offered by Ms. Greene (GA),  numbered 20 printed in Part A of House Report 119-255 to ban the research, development, procurement and promotion of cell cultured meat by the DOD.","actionTimeStamp":"Wed, 10 Sep 2025 13:34:08 -0400"},{"index":61,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Mills amendment No. 18, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Takano demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 10 Sep 2025 13:33:33 -0400"},{"index":62,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 682, the Committee of the Whole proceeded with 10 minutes of debate on the Mills amendment No. 18.","actionTimeStamp":"Wed, 10 Sep 2025 13:22:15 -0400"},{"index":63,"header":"--","actionItem":"An amendment, offered by Mr. Mills,  numbered 18 printed in Part A of House Report 119-255 to restrict base commanders' ability to fly unauthorized flags at their discretion.","actionTimeStamp":"Wed, 10 Sep 2025 13:21:48 -0400"},{"index":64,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Mace amendment No. 17, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Jacobs demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 10 Sep 2025 13:20:52 -0400"},{"index":65,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 682, the Committee of the Whole proceeded with 10 minutes of debate on the Mace amendment No. 17.","actionTimeStamp":"Wed, 10 Sep 2025 13:10:32 -0400"},{"index":66,"header":"--","actionItem":"An amendment, offered by Ms. Mace,  numbered 17 printed in Part A of House Report 119-255 to prohibit individuals from accessing or using single-sex spaces on military installations which do not correspond to the biological sex of the individual.","actionTimeStamp":"Wed, 10 Sep 2025 13:09:57 -0400"},{"index":67,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Mace amendment No. 16, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Takano demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 10 Sep 2025 13:09:23 -0400"},{"index":68,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 682, the Committee of the Whole proceeded with 10 minutes of debate on the Mace amendment No. 16.","actionTimeStamp":"Wed, 10 Sep 2025 12:57:53 -0400"},{"index":69,"header":"--","actionItem":"An amendment, offered by Ms. Mace,  numbered 16 printed in Part A of House Report 119-255 to prohibit the Secretary of Defense from soliciting information through a form or survey regarding the gender identity of an individual, providing an option to indicate the sex or gender of an individual is something other than male or female, and requiring the Secretary reject a response other than male or female to a required question on a form or survey regarding sex or gender.","actionTimeStamp":"Wed, 10 Sep 2025 12:57:50 -0400"},{"index":70,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Mace amendment No. 15, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Stansbury demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 10 Sep 2025 12:56:46 -0400"},{"index":71,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 682, the Committee of the Whole proceeded with 10 minutes of debate on the Mace amendment No. 15.","actionTimeStamp":"Wed, 10 Sep 2025 12:45:51 -0400"},{"index":72,"header":"--","actionItem":"An amendment, offered by Ms. Mace,  numbered 15 printed in Part A of House Report 119-255 to prohibit the Superintendent of a Service Academy from allowing a cadet or midshipman who is male from participating in an athletic program or activity that is designated exclusively for females.","actionTimeStamp":"Wed, 10 Sep 2025 12:45:30 -0400"},{"index":73,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Mace amendment No. 14, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Smith (WA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 10 Sep 2025 12:45:02 -0400"},{"index":74,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 682, the Committee of the Whole proceeded with 10 minutes of debate on the Mace amendment No. 14.","actionTimeStamp":"Wed, 10 Sep 2025 12:34:33 -0400"},{"index":75,"header":"--","actionItem":"An amendment, offered by Ms. Mace,  numbered 14 printed in Part A of House Report 119-255 to prohibit DoD from covering or furnishing gender-related medical treatment under TRICARE.","actionTimeStamp":"Wed, 10 Sep 2025 12:34:15 -0400"},{"index":76,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Norman amendment No. 13, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Smith (WA) demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 10 Sep 2025 12:33:48 -0400"},{"index":77,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 682, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 13.","actionTimeStamp":"Wed, 10 Sep 2025 12:21:09 -0400"},{"index":78,"header":"--","actionItem":"An amendment, offered by Mr. Norman,  numbered 13 printed in Part A of House Report 119-255 to prohibit the provision of gender transition procedures, including surgery or medication, through the Exceptional Family Medical Program.","actionTimeStamp":"Wed, 10 Sep 2025 12:21:03 -0400"},{"index":79,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Wed, 10 Sep 2025 12:19:46 -0400"},{"index":80,"header":"--","actionItem":"Considered as unfinished business. H.R. 3838 — \"To authorize appropriations for fiscal year 2026 for military activities of the Department of Defense, for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\"","actionTimeStamp":"Wed, 10 Sep 2025 12:19:32 -0400"},{"index":81,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair would be limited to 15 per side of the aisle.","actionTimeStamp":"Wed, 10 Sep 2025 12:02:29 -0400"},{"index":82,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Ms. Dexter to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 10 Sep 2025 12:02:06 -0400"},{"index":83,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 10 Sep 2025 12:02:04 -0400"},{"index":84,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Wed, 10 Sep 2025 12:00:37 -0400"},{"index":85,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of September 10.","actionTimeStamp":"Wed, 10 Sep 2025 12:00:00 -0400"},{"index":86,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Wed, 10 Sep 2025 11:11:52 -0400"},{"index":87,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Wed, 10 Sep 2025 10:03:40 -0400"},{"index":88,"header":"--","actionItem":"The Speaker designated the Honorable David J. Taylor to act as Speaker pro tempore for today.","actionTimeStamp":"Wed, 10 Sep 2025 10:03:23 -0400"},{"index":89,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 10 Sep 2025 10:00:00 -0400"}]}