{"retrieved-date":"2025-10-1","actions-date":"Tuesday, September 30, 2025","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, September 30)","actionItem":"H.R. 5371 (Rep. Cole):\n        A bill making continuing appropriations and extensions for fiscal year 2026, and for other purposes .\n\n        -- Motion to proceed to consideration of the vote by which H.R. 5371 failed of passage (Record Vote No. 528) agreed to in Senate by Voice Vote.\n\n        -- Motion by Senator Thune to reconsider the vote by which H.R. 5371 failed of passage (Record Vote No. 528) agreed to in Senate by Voice Vote.\n\n        -- Upon reconsideration, under the order of 9/18/25, not having achieved 60 votes in the affirmative, failed of passage in Senate by Yea-Nay Vote. 55 - 45. Record Vote Number: 535 \n\n\n\n S. 2296 (Sen. Wicker):\n        An original bill to authorize appropriations for fiscal year 2026 for military activities of the Department of Defense, for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\n\n        -- Considered by Senate.\n \n\n S.Amdt. 3427 (Sen. Ernst):\n        To require the Comptroller General of the United States to conduct a study on casualty assistance and long-term care programs.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3748 (Sen. Wicker):\n        In the nature of a substitute.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3863 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3864 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3865 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3866 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3867 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3868 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n\n\n\n S. 2882 (Sen. Murray):\n        A bill making continuing appropriations for the fiscal year ending September 30, 2026, and for other purposes .\n\n        -- Motion to proceed to consideration of the vote by which S. 2882 failed of passage (Record Vote No. 527) agreed to in Senate by Voice Vote.\n\n        -- Motion by Senator Schumer to reconsider the vote by which S. 2882 failed of passage (Record Vote No. 527) agreed to in Senate by Voice Vote.\n\n        -- Upon reconsideration, under the order of 9/18/25, not having achieved 60 votes in the affirmative, failed of passage in Senate by Yea-Nay Vote. 47 - 53. Record Vote Number: 534 \n\n\n\n S.Res. 396 (Sen. Bennet):\n        A resolution condemning the tragic act of violence on September 10, 2025, in Evergreen, Colorado, recognizing the victims, survivors, and responders, and expressing condolences and support to their families and their communities.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 427 (Sen. Graham):\n        A resolution designating October 8, 2025, as \"National Hydrogen and Fuel Cell Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 428 (Sen. Cortez Masto):\n        A resolution recognizing Hispanic Heritage Month and celebrating the heritage and culture of Latinos in the United States and the immense contributions of Latinos to the United States .\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 429 (Sen. Hyde-Smith):\n        A resolution designating September 2025 as \"National Infant Mortality Awareness Month\", raising awareness of infant mortality, and increasing efforts to reduce infant mortality .\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  8:25 p.m, the Presiding Officer (Ms. Lummis in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow .","actionTimeStamp":"--"}]}