{"retrieved-date":"2023-1-3","actions-date":"Tue, 03 Jan 2023 12:48:00 -0500","actions-title":"House Floor Proceedings","actions-count":9,"actions-list":[{"index":1,"header":"APPOINTMENT OF TELLERS","actionItem":"The Clerk announced the appointment of the following Members-elect to act as Tellers during the Roll Call for Election of Speaker: Mr. Loudermilk, Ms. Lee of California, Mr. Steil, and Mr. Morelle.","actionTimeStamp":"Tue, 03 Jan 2023 12:48:00 -0500"},{"index":2,"header":"NOMINATIONS FOR OFFICE OF SPEAKER","actionItem":"Pursuant to law and precedent, the Clerk announced that the next order of business was the election of the Speaker of the House of Representatives and that nominations would now be in order. Accordingly, the Honorable Elise M. Stefanik of New York placed the name of the Honorable Kevin McCarthy into nomination for the Office of Speaker, the Honorable Pete Aguilar of California placed the name of the Honorable Hakeem S. Jeffries into nomination for the Office of Speaker, and the Honorable Paul A. Gosar placed the name of the Honorable Andy Biggs into nomination for the Office of Speaker. No other nominations were put forward.","actionTimeStamp":"Tue, 03 Jan 2023 12:33:35 -0500"},{"index":3,"header":"--","actionItem":"The Clerk notified the House that since the last regular election of Representatives to the 118th Congress, a vacancy now exists in the 4th District of the State of Virginia, occasioned by the death of the late Honorable A. Donald McEachin.","actionTimeStamp":"Tue, 03 Jan 2023 12:33:00 -0500"},{"index":4,"header":"ELECTION CREDENTIALS FOR DELEGATES","actionItem":"The Clerk notified the House that election credentials for all Delegates and Resident Commissioners had been received.","actionTimeStamp":"Tue, 03 Jan 2023 12:32:05 -0500"},{"index":5,"header":"--","actionItem":"Call by States Quorum responded: (Roll no. 1).","actionTimeStamp":"Tue, 03 Jan 2023 12:31:18 -0500"},{"index":6,"header":"CERTIFICATION OF ELECTION","actionItem":"The Clerk announced that Certificates of Election covering 435 seats in the One Hundred Eighteenth Congress had been received and the names of those persons whose credentials show that they were regularly elected as Representatives in accordance with the laws of their respective States of the United States would be called. Without objection, the Representatives-elect were directed to record their presence by electronic device in order to determine whether a quorum was present.","actionTimeStamp":"Tue, 03 Jan 2023 12:04:00 -0500"},{"index":7,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Clerk led the House in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Tue, 03 Jan 2023 12:03:00 -0500"},{"index":8,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Tue, 03 Jan 2023 12:01:00 -0500"},{"index":9,"header":"--","actionItem":"House convened, starting a new legislative day, pursuant to the 20th amendment to the Constitution, for the meeting of the One Hundred Eighteenth Congress of the United States.","actionTimeStamp":"Tue, 03 Jan 2023 12:00:00 -0500"}]}