{"retrieved-date":"2023-6-16","actions-date":"Wednesday, June 14, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, June 14)","actionItem":"H.Con.Res. 43 (Rep. Hoyer):\n        A concurrent resolution authorizing the use of the Capitol Grounds for the Greater Washington Soap Box Derby.\n\n        -- Resolution agreed to in Senate without amendment by Unanimous Consent.\n\n\n S.J.Res. 11 (Sen. Fischer):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Environmental Protection Agency relating to \"Control of Air Pollution From New Motor Vehicles: Heavy-Duty Engine and Vehicle Standards\".\n\n        -- Veto message received in Senate. Ordered held at the desk.\n\n\n S.Res. 252 (Sen. Braun):\n        A resolution celebrating the 246th anniversary of the creation of the flag of the United States and expressing support for the Pledge of Allegiance.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 253 (Sen. Heinrich):\n        A resolution designating June 16, 2023, as National Service and Conservation Corps Day.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, June 14)","actionItem":"PN83:\n        Nusrat Jahan Choudhury, of New York, to be United States District Judge for the Eastern District of New York\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 47. Record Vote Number: 163 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate and vote 6/15/2023.\n\n\n PN86:\n        Dale E. Ho, of New York, to be United States District Judge for the Southern District of New York\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 160 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 162 \n\n\n\n PN177:\n        P. Casey Pitts, of California, to be United States District Judge for the Northern District of California\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 46. Record Vote Number: 159 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 46. Record Vote Number: 161 \n\n\n\n PN191:\n        Stephen K. Eberle, of Pennsylvania, to be United States Marshal for the Western District of Pennsylvania for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  6:24 p.m, the Presiding Officer (Mr. Ossoff in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}