{"retrieved-date":"2023-7-26","actions-date":"Thursday, July 20, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, July 20)","actionItem":"H.R. 1096 (Rep. Moulton):\n        A bill to require the Secretary of the Treasury to mint coins in commemoration of the 250th Anniversary of the United States Marine Corps, and to support programs at the Marine Corps Heritage Center.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S. 2226 (Sen. Reed):\n        An original bill to authorize appropriations for fiscal year 2024 for military activities of the Department of Defense, for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\n\n        -- Considered by Senate.\n \n\n S.Amdt. 224 (Sen. Blackburn):\n        To provide funding for women's health to support initiatives for mobile mammography services for women veterans.\n\n        --Amendment SA 224 proposed by Senator Reed for Senator Blackburn to Amendment SA 935.\n\n        --Amendment SA 224 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 273 (Sen. Grassley):\n        To improve a provision relating to a report on progress on a multi-year strategy and plan for the Baltic Security Initiative.\n\n        --Amendment SA 273 proposed by Senator Reed for Senator Grassley to Amendment SA 935.\n\n        --Amendment SA 273 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 315 (Sen. Sinema):\n        To provide for the assumption of full ownership and control of the International Outfall Interceptor in Nogales, Arizona, by the International Boundary and Water Commission.\n\n        --Amendment SA 315 proposed by Senator Reed for Senator Sinema to Amendment SA 935.\n\n        --Amendment SA 315 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 376 (Sen. Lee):\n        To limit the availability of funds for the support of Ukraine.\n\n        --Amendment SA 376 proposed by Senator Lee to Amendment SA 935.\n\n        --Amendment SA 376 under the order of 7/20/2023, not having achieved 60 votes in the affirmative, was not not agreed to in Senate by Yea-Nay Vote. 13 - 71. Record Vote Number: \n\n\n S.Amdt. 510 (Sen. Scott, of FL):\n        To provide for drone security.\n\n        --Amendment SA 510 proposed by Senator Reed for Senator Scott FL to Amendment SA 935.\n\n        --Amendment SA 510 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 685 (Sen. Baldwin):\n        To provide for an enhanced domestic content requirement for navy shipbuilding programs.\n\n        --Amendment SA 685 proposed by Senator Reed for Senator Baldwin to Amendment SA 935.\n\n        --Amendment SA 685 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 823 (Sen. Romney):\n        To end the treatment of the People's Republic of China as a developing nation.\n\n        --Amendment SA 823 proposed by Senator Reed for Senator Romney to Amendment SA 935.\n\n        --Amendment SA 823 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 926 (Sen. Cruz):\n        To prohibit the export or sale of petroleum products from the Strategic Petroleum Reserve to certain entities.\n\n        --Amendment SA 926 proposed by Senator Cruz to Amendment SA 935.\n\n        --Amendment SA 926 under the order of 7/19/2023, having achieved 60 votes in the affirmative, was agreed to in Senate by Yea-Nay Vote. 85 - 14. Record Vote Number: \n\n\n S.Amdt. 935 (Sen. Reed):\n        In the nature of a substitute.\n\n        --Considered by Senate.\n\n\n S.Amdt. 936 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate.\n\n\n S.Amdt. 949 (Sen. Moran):\n        To ensure access to commissary and exchange privileges for remarried spouses of members of the Armed Forces.\n\n        --Amendment SA 949 proposed by Senator Reed for Senator Moran to Amendment SA 935.\n\n        --Amendment SA 949 agreed to in Senate by Voice Vote.\n\n\n\n\n S.Res. 305 (Sen. Schumer):\n        A resolution commemorating the 50th anniversary of hip hop and designating August 11, 2023, as \"Hip Hop Celebration Day\", designating August 2023 as \"Hip Hop Recognition Month\", and designating November 2023 as \"Hip Hop History Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, July 20)","actionItem":"PN118:\n        David M. Uhlmann, of Michigan, to be an Assistant Administrator of the Environmental Protection Agency\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 46. Record Vote Number: 193","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  4:54 p.m., the Senate adjourned, under its order of today, until  6:30 a.m. tomorrow.","actionTimeStamp":"--"}]}