{"retrieved-date":"2024-3-8","actions-date":"Fri, 08 Mar 2024 09:53:54 -0500","actions-title":"House Floor Proceedings","actions-count":20,"actions-list":[{"index":1,"header":"On agreeing to the Houlahan amendment (A006) Roll Call 73","actionItem":"Recorded vote pending.","actionTimeStamp":"Fri, 08 Mar 2024 09:53:54 -0500"},{"index":2,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Waters amendment No. 9, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Ms. Waters demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Fri, 08 Mar 2024 09:52:29 -0500"},{"index":3,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1052, the Committee of the Whole proceeded with 10 minutes of debate on the Waters amendment No. 9.","actionTimeStamp":"Fri, 08 Mar 2024 09:45:26 -0500"},{"index":4,"header":"--","actionItem":"An amendment, offered by Ms. Waters,  numbered 9 printed in Part B of House Report 118-407 to requi re any investment adviser, private fund, or an investment company that is subject to the bill to annually and publicly disclose their investments into women-owned, minority-owned, veteran-owned, rural-domiciled, and other businesses.","actionTimeStamp":"Fri, 08 Mar 2024 09:44:52 -0500"},{"index":5,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Lynch amendment No. 8, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Mr. Lynch demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Fri, 08 Mar 2024 09:44:26 -0500"},{"index":6,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1052, the Committee of the Whole proceeded with 10 minutes of debate on the Lynch amendment No. 8.","actionTimeStamp":"Fri, 08 Mar 2024 09:35:32 -0500"},{"index":7,"header":"--","actionItem":"An amendment, offered by Mr. Lynch,  numbered 8 printed in Part B of House Report 118-407 to provide that the bill may take effect only when the Securities and Exchange Commission, in consultation with State securities regulators, certifies to Congress that nothing in the bill will increase fraud.","actionTimeStamp":"Fri, 08 Mar 2024 09:34:49 -0500"},{"index":8,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Tlaib amendment No. 7, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Ms. Tlaib demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Fri, 08 Mar 2024 09:34:13 -0500"},{"index":9,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1052, the Committee of the Whole proceeded with 10 minutes of debate on the Tlaib amendment No. 7.","actionTimeStamp":"Fri, 08 Mar 2024 09:25:19 -0500"},{"index":10,"header":"--","actionItem":"An amendment, offered by Ms. Tlaib,  numbered 7 printed in Part B of House Report 118-407 to ensure that exemptions or benefits provided by the bill may only apply to companies that do not impose \"junk fees\" on customers.","actionTimeStamp":"Fri, 08 Mar 2024 09:25:03 -0500"},{"index":11,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Houlahan amendment No. 6, the Chair put the question on agreeing to the amendment and by voice vote, announced the noes had prevailed. Ms. Houlahan demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Fri, 08 Mar 2024 09:24:35 -0500"},{"index":12,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1052, the Committee of the Whole proceeded with 10 minutes of debate on the Houlahan amendment No. 6.","actionTimeStamp":"Fri, 08 Mar 2024 09:16:15 -0500"},{"index":13,"header":"--","actionItem":"An amendment, offered by Ms. Houlahan,  numbered 6 printed in Part B of House Report 118-407 to require the Advocate for Small Business Capital Formation to include in its report the effects of the failure of Silicon Valley Bank on community banks and small business lending.","actionTimeStamp":"Fri, 08 Mar 2024 09:15:56 -0500"},{"index":14,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Fri, 08 Mar 2024 09:14:48 -0500"},{"index":15,"header":"--","actionItem":"Considered as unfinished business. H.R. 2799 — \"To make reforms to the capital markets of the United States, and for other purposes.\"","actionTimeStamp":"Fri, 08 Mar 2024 09:14:29 -0500"},{"index":16,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair would be limited to 5 per side of the aisle.","actionTimeStamp":"Fri, 08 Mar 2024 09:03:40 -0500"},{"index":17,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Tonko to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Fri, 08 Mar 2024 09:02:01 -0500"},{"index":18,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Fri, 08 Mar 2024 09:01:57 -0500"},{"index":19,"header":"--","actionItem":"Today's prayer was offered by Reverend Sean Raftis, St. Charles Borromeo Church, Whitefish, Montana","actionTimeStamp":"Fri, 08 Mar 2024 09:00:24 -0500"},{"index":20,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Fri, 08 Mar 2024 09:00:00 -0500"}]}