{"retrieved-date":"2024-9-11","actions-date":"Tuesday, September 10, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, September 10)","actionItem":"H.R. 7032 (Rep. Boyle):\n        A bill to amend the Congressional Budget and Impoundment Control Act of 1974 to provide the Congressional Budget Office with necessary authorities to expedite the sharing of data from executive branch agencies, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.Con.Res. 124 (Rep. Lucas):\n        A concurrent resolution authorizing the use of Emancipation Hall in the Capitol Visitor Center for a ceremony to present the Congressional Gold Medals awarded under the Hidden Figures Congressional Gold Medal Act.\n\n        -- Resolution agreed to in Senate without amendment by Unanimous Consent.\n\n\n S.Res. 794 (Sen. Hyde-Smith):\n        A resolution designating September 25, 2024, as \"National Ataxia Awareness Day\", and raising awareness of ataxia, ataxia research, and the search for a cure.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 806 (Sen. Blackburn):\n        A resolution recognizing May 22, 2024, as the 205th anniversary of the founding of Memphis, Tennessee, and acknowledging the role that Memphis has played in shaping the history, culture, and economy of the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 807 (Sen. Schumer):\n        A resolution to constitute the majority party's membership on certain committees for the One Hundred Eighteenth Congress, or until their successors are chosen.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, September 10)","actionItem":"PN1574:\n        Kevin Gafford Ritz, of Tennessee, to be United States Circuit Judge for the Sixth Circuit\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- By unanimous consent agreement, debate 9/11/2024.\n\n\n PN1576:\n        Jeannette A. Vargas, of New York, to be United States District Judge for the Southern District of New York\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 43. Record Vote Number: 233 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 43. Record Vote Number: 234 \n\n\n\n PN1748:\n        Adam B. Abelson, of Maryland, to be United States District Judge for the District of Maryland\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 43. Record Vote Number: 232","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  5:10 p.m., the Senate adjourned, under its order of today, until 11 a.m. tomorrow.","actionTimeStamp":"--"}]}