{"retrieved-date":"2024-12-6","actions-date":"Wednesday, December 4, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, December  4)","actionItem":"H.R. 1432 (Rep. Wenstrup):\n        A bill to amend the Internal Revenue Code of 1986 to provide for the deductibility of charitable contributions to certain organizations for members of the Armed Forces.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n H.R. 3821 (Rep. Pascrell):\n        A bill to reauthorize the Firefighter Cancer Registry Act of 2018.\n\n        -- Senate Committee on Health, Education, Labor, and Pensions discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n H.R. 5863 (Rep. Steube):\n        A bill to provide tax relief with respect to certain Federal disasters.\n\n        -- Senate Committee on Finance discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n S. 712 (Sen. Cassidy):\n        A bill to identify and address barriers to coverage of remote physiologic devices under State Medicaid programs to improve maternal and child health outcomes for pregnant and postpartum women.\n\n        -- Senate Committee on Finance discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n S. 3242 (Sen. Baldwin):\n        A bill to amend the Securities Exchange Act of 1934 to revise the shareholder threshold for registration under that Act for issuers that receive support through certain Federal universal service support mechanisms, and for other purposes.\n\n        -- Senate Committee on Banking, Housing, and Urban Affairs discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3311 (Sen. Baldwin):\n        In the nature of a substitute.\n\n        --Amendment SA 3311 proposed by Senator Padilla for Senator Baldwin.\n\n        --Amendment SA 3311 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 3738 (Sen. Stabenow):\n        A bill to reauthorize the Great Lakes Restoration Initiative, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Voice Vote.\n \n\n S.Amdt. 3310 (Sen. Stabenow):\n        In the nature of a substitute.\n\n        --Amendment SA 3310 proposed by Senator Padilla for Senator Stabenow.\n\n        --Amendment SA 3310 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 3791 (Sen. Carper):\n        A bill to reauthorize the America's Conservation Enhancement Act, and for other purposes.\n\n        -- Message on House action received in Senate and at desk: House amendment to Senate bill.\n\n\n S. 4477 (Sen. Capito):\n        A bill to reauthorize the Second Chance Act of 2007.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 910 (Sen. Rosen):\n        A resolution designating November 2024 as \"National Hospice and Palliative Care Month\".\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, December  4)","actionItem":"PN2015:\n        Anthony J. Brindisi, of New York, to be United States District Judge for the Northern District of New York\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 48. Record Vote Number: 309 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 310 \n\n\n\n PN2039:\n        Elizabeth C. Coombe, of New York, to be United States District Judge for the Northern District of New York\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 46. Record Vote Number: 311 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 45. Record Vote Number: 312 \n\n\n\n PN2040:\n        Sarah Morgan Davenport, of New Mexico, to be United States District Judge for the District of New Mexico\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 45. Record Vote Number: 313 \n\n\n        -- Considered by Senate.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Padilla, at  8:08 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}