{"retrieved-date":"2026-1-16","actions-date":"Thursday, January 15, 2026","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, January 15)","actionItem":"H.R. 1834 (Rep. McGovern):\n        A bill to advance policy priorities that will break the gridlock.\n\n        -- Senate returned papers to House by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n H.R. 6938 (Rep. Cole):\n        A bill making consolidated appropriations for the fiscal year ending September 30, 2026, and for other purposes.\n\n        -- Considered by Senate.\n\n        -- Cloture on the measure invoked in Senate by Yea-Nay Vote. 85 - 14. Record Vote Number: 10 \n\n\n        -- Motion by Senator Thune to commit to Senate Committee on Appropriations with instructions to report back forthwith with the following amendment (SA 4210) fell when cloture on the motion was invoked in Senate.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 82 - 15. Record Vote Number: 11 \n\n\n        -- Message on Senate action sent to the House.\n \n\n S.Amdt. 4208 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n        --Proposed amendment SA 4208 withdrawn in Senate.\n\n\n S.Amdt. 4209 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n        --SA 4209 fell when SA 4208 withdrawn.\n\n\n S.Amdt. 4210 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n        --SA 4210 (the instructions of the motion to commit) fell when cloture invoked on the measure.\n\n\n S.Amdt. 4211 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n        --SA 4211 fell when SA 4210 (the instructions of the motion to commit) fell.\n\n\n S.Amdt. 4212 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n        --SA 4212 fell when SA 4211 fell.\n\n\n\n\n S. 3627 (Sen. Moody):\n        A bill to require institutions of higher education to disseminate information on the rights of, and accommodations and resources for, pregnant students, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed presented in Senate.\n\n\n S.Res. 519 (Sen. Kelly):\n        A resolution recognizing the achievements and contributions of the AH-64 Apache attack helicopter to the national defense of the United States and its allies and honoring the dedication, service, and sacrifice of the United States Army aviators, maintainers, and support personnel who operate and sustain the Apache.\n\n        -- Senate Committee on Armed Services discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Resolution agreed to in Senate without amendment and an amended preamble by Unanimous Consent.\n \n\n S.Amdt. 4233 (Sen. Kelly):\n        To improve the preamble.\n\n        --Amendment SA 4233 proposed by Senator Barrasso for Senator Kelly.\n\n        --Amendment SA 4233 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 584 (Sen. Warnock):\n        A resolution honoring the life and legacy of Reverend Richard Smallwood, a world-class composer, pianist, and arranger.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 585 (Sen. Bennet):\n        A resolution honoring the life, achievements, and legacy of Ben Nighthorse Campbell.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Recess","actionItem":"Under the authority of the order of today, at  4:59 p.m, the Presiding Officer (Mr. Husted in the chair) declared the Senate recessed, under its order of today, until  8:30 a.m. tomorrow.","actionTimeStamp":"--"}]}