{"retrieved-date":"2023-9-26","actions-date":"Sat, 23 Sep 2023 13:47:47 -0400","actions-title":"House Floor Proceedings","actions-count":12,"actions-list":[{"index":1,"header":"--","actionItem":"The House adjourned pursuant to a previous special order. The next meeting is scheduled for 12:00 p.m. on September 26, 2023.","actionTimeStamp":"Sat, 23 Sep 2023 13:47:47 -0400"},{"index":2,"header":"--","actionItem":"On motion to adjourn Agreed to by voice vote.","actionTimeStamp":"Sat, 23 Sep 2023 13:47:44 -0400"},{"index":3,"header":"--","actionItem":"Mr. Massie moved that the House do now adjourn.","actionTimeStamp":"Sat, 23 Sep 2023 13:47:39 -0400"},{"index":4,"header":"--","actionItem":"Mr. Massie asked unanimous consent That when the House adjourns on Saturday, September 23, 2023, it adjourn to meet at noon on Tuesday, September 26, 2023 for Morning-Hour debate and 2:00 p.m. for legislative business. Agreed to without objection.","actionTimeStamp":"Sat, 23 Sep 2023 13:47:20 -0400"},{"index":5,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of September 23.","actionTimeStamp":"Sat, 23 Sep 2023 13:47:11 -0400"},{"index":6,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is subject to the call of the Chair.","actionTimeStamp":"Sat, 23 Sep 2023 10:33:48 -0400"},{"index":7,"header":"Advisory Board for the House of Representatives Child Care Center","actionItem":"Pursuant to 2 U.S.C. 2062, and the order of the House of January 9, 2023, the Speaker appointed Mr. McHenry, North Carolina, Ms. Natalie Joyce, Arlington VA, Ms. Jennifer Belair, Alexandria, VA, Ms. Anna McCormack, Alexandria, VA, Ms. Deborah Mazol, Alexandria, VA, Ms. Alyene Mlinar, Falls Church, VA, Mr. Jeffrey Butler, Arlington VA, Mr. Cyrus Artz, Fort Washington, MD, Ms. Kate Knudson Wolters, Alexandria, VA, Mr. Colin Grant Davenport, Alexandria, VA, Ms. Stacey Levandosky, Washington, DC, Ms. Erin M. Kolodjeski, Arlington, VA, Ms. Kalise S. Dickerson, Waldorf, MD, Ms. Tejah R.M. Robinson, Laurel, MD, and Ms. Emily Noriega-May, Washington, DC.","actionTimeStamp":"Sat, 23 Sep 2023 10:33:03 -0400"},{"index":8,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair led the House in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Sat, 23 Sep 2023 10:32:27 -0400"},{"index":9,"header":"--","actionItem":"The Speaker announced approval of the Journal. Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Sat, 23 Sep 2023 10:32:01 -0400"},{"index":10,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Sat, 23 Sep 2023 10:30:33 -0400"},{"index":11,"header":"--","actionItem":"The Speaker designated the Honorable Michelle Fischbach to act as Speaker pro tempore for today.","actionTimeStamp":"Sat, 23 Sep 2023 10:30:10 -0400"},{"index":12,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Sat, 23 Sep 2023 10:30:00 -0400"}]}