{"retrieved-date":"2023-3-16","actions-date":"Tuesday, March 14, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Friday, March 10, 2023,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Friday, March 10, 2023, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, March 14)","actionItem":"S. 316 (Sen. Kaine):\n        A bill to repeal the authorizations for use of military force against Iraq.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, March 14)","actionItem":"PN53:\n        Michael Alan Ratney, of Massachusetts, to be Ambassador to the Kingdom of Saudi Arabia\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN85:\n        Jessica G. L. Clarke, of New York, to be United States District Judge for the Southern District of New York\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN122:\n        Brent Neiman, of Illinois, to be a Deputy Under Secretary of the Treasury\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 40. Record Vote Number: 53 \n\n\n        -- By unanimous consent agreement, debate and vote 3/15/2023.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Peters, at  6:34 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}