{"retrieved-date":"2024-2-7","actions-date":"Tuesday, February 6, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, February  6)","actionItem":"S.Res. 544 (Sen. Tester):\n        A resolution designating the week beginning February 5, 2024, as \"National Tribal Colleges and Universities Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, February  6)","actionItem":"PN308:\n        Nicole Shampaine, of California, a Career Member of the Senior Foreign Service, Class of Minister-Counselor, for the rank of Ambassador during her tenure of service as United States Representative to the Organization for the Prohibition of Chemical Weapons\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1113:\n        Kurt Campbell, of the District of Columbia, to be Deputy Secretary of State\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 90 - 5. Record Vote Number: 35 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 92 - 5. Record Vote Number: 36 \n\n\n\n PN1239:\n        Amy M. Baggio, of Oregon, to be United States District Judge for the District of Oregon\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 54 - 43. Record Vote Number: 37 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 54 - 44. Record Vote Number: 38","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Wyden, at  6:49 p.m., the Senate adjourned, under its order of today, until 12 noon tomorrow.","actionTimeStamp":"--"}]}