{"retrieved-date":"2023-4-24","actions-date":"Thursday, April 20, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, April 20)","actionItem":"S. 326 (Sen. Tester):\n        A bill to direct the Secretary of Veterans Affairs to carry out a study and clinical trials on the effects of cannabis on certain health outcomes of veterans with chronic pain and post-traumatic stress disorder, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.\n\n\n S. 870 (Sen. Peters):\n        A bill to amend the Federal Fire Prevention and Control Act of 1974 to authorize appropriations for the United States Fire Administration and firefighter assistance grant programs.\n\n        -- Considered by Senate.\n\n        -- Passed Senate, under the order of 4/18/2023, having achieved 60 votes in the affirmative, without amendment by Yea-Nay Vote. 95 - 2. Record Vote Number: 94 \n\n\n        -- Message on Senate action sent to the House.\n \n\n S.Amdt. 58 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate.\n\n        --Proposed amendment SA 58 withdrawn in Senate.\n\n\n S.Amdt. 83 (Sen. Sullivan):\n        To improve the bill.\n\n        --Amendment SA 83 proposed by Senator Sullivan 92.\n\n        --Amendment SA 83 not agreed to in Senate by Yea-Nay Vote. 42 - 56. Record Vote Number: \n\n\n S.Amdt. 85 (Sen. Van Hollen):\n        To provide grants for fire station construction through the Administrator of the Federal Emergency Management Agency.\n\n        --Amendment SA 85 proposed by Senator Van Hollen.\n\n        --Amendment SA 85, under the order of 4/18/2023, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 46 - 51. Record Vote Number: \n\n\n\n\n S.Res. 167 (Sen. Cardin):\n        A resolution recognizing the 30th anniversary of the United States Holocaust Memorial Museum.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, April 20)","actionItem":"PN195:\n        Joshua David Jacobs, of Washington, to be Under Secretary for Benefits of the Department of Veterans Affairs\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII.\n\n        -- By unanimous consent agreement, debate 4/25/2023.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Carper, at  3:30 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}