{"retrieved-date":"2023-12-6","actions-date":"Wed, 06 Dec 2023 14:50:33 -0500","actions-title":"House Floor Proceedings","actions-count":41,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 906, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 7.","actionTimeStamp":"Wed, 06 Dec 2023 14:50:33 -0500"},{"index":2,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 7 printed in Part B of House Report 118-298 to add international organizations to the definition of foreign sources for the purposes of Section 117, Disclosures of Foreign Gifts.","actionTimeStamp":"Wed, 06 Dec 2023 14:50:19 -0500"},{"index":3,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Ogles amendment No. 6, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Foxx demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 06 Dec 2023 14:49:57 -0500"},{"index":4,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 906, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 6.","actionTimeStamp":"Wed, 06 Dec 2023 14:40:13 -0500"},{"index":5,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 6 printed in Part B of House Report 118-298 to reduce the threshold value at which gifts must be reported from $50,000 to $1.","actionTimeStamp":"Wed, 06 Dec 2023 14:39:55 -0500"},{"index":6,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Molinaro amendment No. 5, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Molinaro demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 06 Dec 2023 14:39:17 -0500"},{"index":7,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 906, the Committee of the Whole proceeded with 10 minutes of debate on the Molinaro amendment No. 5.","actionTimeStamp":"Wed, 06 Dec 2023 14:35:13 -0500"},{"index":8,"header":"--","actionItem":"An amendment, offered by Mr. Molinaro,  numbered 5 printed in Part B of House Report 118-298 to add a requirement that foreign entities disclose any ties to designated foreign terrorist organizations, which includes Hamas.","actionTimeStamp":"Wed, 06 Dec 2023 14:34:52 -0500"},{"index":9,"header":"--","actionItem":"On agreeing to the Fallon amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 06 Dec 2023 14:34:23 -0500"},{"index":10,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 906, the Committee of the Whole proceeded with 10 minutes of debate on the Fallon amendment No. 4.","actionTimeStamp":"Wed, 06 Dec 2023 14:28:13 -0500"},{"index":11,"header":"An amendment, offered by Mr. Fallon,  numbered 4 printed in Part B of House Report 118-298 to increase by one year","actionItem":"from four years to five years","actionTimeStamp":"Wed, 06 Dec 2023 14:27:59 -0500"},{"index":12,"header":"--","actionItem":"On agreeing to the Fallon amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 06 Dec 2023 14:27:44 -0500"},{"index":13,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 906, the Committee of the Whole proceeded with 10 minutes of debate on the Fallon amendment No. 3.","actionTimeStamp":"Wed, 06 Dec 2023 14:24:28 -0500"},{"index":14,"header":"--","actionItem":"An amendment, offered by Mr. Fallon,  numbered 3 printed in Part B of House Report 118-298 to prohibit institutions that commit three violations under this Act from obtaining a waiver or a renewal of a waiver.","actionTimeStamp":"Wed, 06 Dec 2023 14:24:06 -0500"},{"index":15,"header":"--","actionItem":"On agreeing to the Carey amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 06 Dec 2023 14:23:53 -0500"},{"index":16,"header":"--","actionItem":"An amendment, offered by Mr. Carey,  numbered 2 printed in Part B of House Report 118-298 to remove the personally identifiable information of staff or faculty required to disclose gifts and contracts in the bill.","actionTimeStamp":"Wed, 06 Dec 2023 14:21:02 -0500"},{"index":17,"header":"--","actionItem":"On agreeing to the Foxx amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 06 Dec 2023 14:20:42 -0500"},{"index":18,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 906, the Committee of the Whole proceeded with 10 minutes of debate on the Foxx amendment No. 1.","actionTimeStamp":"Wed, 06 Dec 2023 14:17:53 -0500"},{"index":19,"header":"--","actionItem":"An amendment, offered by Ms. Foxx,  numbered 1 printed in Part B of House Report 118-298 to make technical corrections to fix citations and adjust punctuation and clarifies language on gifts, enforcement, and the Government Accountability Office Study.","actionTimeStamp":"Wed, 06 Dec 2023 14:17:19 -0500"},{"index":20,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 5933.","actionTimeStamp":"Wed, 06 Dec 2023 13:47:32 -0500"},{"index":21,"header":"--","actionItem":"The Speaker designated the Honorable James C. Moylan to act as Chairman of the Committee.","actionTimeStamp":"Wed, 06 Dec 2023 13:46:13 -0500"},{"index":22,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 906 and Rule XVIII.","actionTimeStamp":"Wed, 06 Dec 2023 13:46:12 -0500"},{"index":23,"header":"--","actionItem":"Rule provides for consideration of H.R. 4468, H.R. 5933 and H.J. Res. 88. The resolution provides for consideration of H.R. 4468 and H.R. 5933 under a structured rule and H.J. Res. 88 under a closed rule. Rule provides for one hour of general debate and one motion to recommit on each measure.","actionTimeStamp":"Wed, 06 Dec 2023 13:44:10 -0500"},{"index":24,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 906. H.R. 5933 — \"To amend the Higher Education Act of 1965 to require additional information in disclosures of foreign gifts and contracts from foreign sources, restrict contracts with certain foreign entities and foreign countries of concern, require certain staff and faculty to report foreign gifts and contracts, and require disclosure of certain foreign investments within endowments.\"","actionTimeStamp":"Wed, 06 Dec 2023 13:44:05 -0500"},{"index":25,"header":"POSTPONED PROCEEDINGS","actionItem":"Pursuant to clause 1(c) of rule XIX, the Chair announced further proceedings on H.R. 4468 would be postponed.","actionTimeStamp":"Wed, 06 Dec 2023 13:43:52 -0500"},{"index":26,"header":"--","actionItem":"On agreeing to the Johnson (OH) amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 06 Dec 2023 13:43:25 -0500"},{"index":27,"header":"--","actionItem":"The previous question was ordered on the amendment and the bill pursuant to the rule.","actionTimeStamp":"Wed, 06 Dec 2023 13:43:00 -0500"},{"index":28,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 906, the House proceeded with 10 minutes of debate on the Johnson (OH) amendment No. 1.","actionTimeStamp":"Wed, 06 Dec 2023 13:35:44 -0500"},{"index":29,"header":"--","actionItem":"An amendment, offered by Mr. Johnson (OH),  numbered 1 printed in Part A of House Report 118-298 to clarify the time-frame in which the bill's requirements apply.","actionTimeStamp":"Wed, 06 Dec 2023 13:35:21 -0500"},{"index":30,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H.R. 4468.","actionTimeStamp":"Wed, 06 Dec 2023 12:23:53 -0500"},{"index":31,"header":"--","actionItem":"Rule provides for consideration of H.R. 4468, H.R. 5933 and H.J. Res. 88. The resolution provides for consideration of H.R. 4468 and H.R. 5933 under a structured rule and H.J. Res. 88 under a closed rule. Rule provides for one hour of general debate and one motion to recommit on each measure.","actionTimeStamp":"Wed, 06 Dec 2023 12:22:52 -0500"},{"index":32,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 906. H.R. 4468 — \"To prohibit the Administrator of the Environmental Protection Agency from finalizing, implementing, or enforcing a proposed rule with respect to emissions from vehicles, and for other purposes.\"","actionTimeStamp":"Wed, 06 Dec 2023 12:22:47 -0500"},{"index":33,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair would be limited to 15 per side of the aisle.","actionTimeStamp":"Wed, 06 Dec 2023 12:02:13 -0500"},{"index":34,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Murphy to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 06 Dec 2023 12:01:52 -0500"},{"index":35,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 06 Dec 2023 12:01:49 -0500"},{"index":36,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Wed, 06 Dec 2023 12:00:09 -0500"},{"index":37,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of December 6.","actionTimeStamp":"Wed, 06 Dec 2023 12:00:00 -0500"},{"index":38,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Wed, 06 Dec 2023 10:59:25 -0500"},{"index":39,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Wed, 06 Dec 2023 10:00:56 -0500"},{"index":40,"header":"--","actionItem":"The Speaker designated the Honorable Scott Franklin to act as Speaker pro tempore for today.","actionTimeStamp":"Wed, 06 Dec 2023 10:00:31 -0500"},{"index":41,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 06 Dec 2023 10:00:00 -0500"}]}