{"retrieved-date":"2025-9-30","actions-date":"Friday, September 19, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Friday, September 19)","actionItem":"H.R. 5371 (Rep. Cole):\n        A bill making continuing appropriations and extensions for fiscal year 2026, and for other purposes.\n\n        -- Received in the Senate. Read the first time. Placed on Senate Legislative Calendar under Read the First Time.\n\n        -- Under the order of 9/18/25, not having achieved 60 votes in the affirmative, failed of passage in Senate by Yea-Nay Vote. 44 - 48. Record Vote Number: 528 \n\n\n        -- Motion by Senator Thune to reconsider the vote by which H.R. 5371 failed of passage (Record Vote No. 528) entered in Senate.\n\n        -- Under the order of 9/19/25, the third reading was vitiated and the bill was read the second time.\n\n        -- Ordered placed on Senate Legislative Calendar under General Orders. Calendar No. 168.\n\n\n S. 269 (Sen. Kennedy):\n        A bill to improve coordination between Federal and State agencies and the Do Not Pay working system.\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3912 (Sen. Kennedy):\n        In the nature of a substitute.\n\n        --Amendment SA 3912 proposed by Senator Thune for Senator Kennedy.\n\n        --Amendment SA 3912 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 2296 (Sen. Wicker):\n        An original bill to authorize appropriations for fiscal year 2026 for military activities of the Department of Defense, for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\n\n        -- Considered by Senate.\n \n\n S.Amdt. 3427 (Sen. Ernst):\n        To require the Comptroller General of the United States to conduct a study on casualty assistance and long-term care programs.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3748 (Sen. Wicker):\n        In the nature of a substitute.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3863 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3864 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3865 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3866 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3867 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3868 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n\n\n\n S. 2806 (Sen. Johnson):\n        A bill to provide for automatic continuing appropriations.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.\n\n\n S. 2882 (Sen. Murray):\n        A bill making continuing appropriations for the fiscal year ending September 30, 2026, and for other purposes.\n\n        -- Under the order of 9/18/2025, not having achieved 60 votes in the affirmative, failed of passage in Senate by Yea-Nay Vote. 47 - 45. Record Vote Number: 527 \n\n\n        -- Motion by Senator Schumer to reconsider the vote by which S. 2882 failed of passage (Record Vote No. 527) entered in Senate.\n\n        -- Under the order of 9/19/25, the third reading was vitiated and the bill was read the second time.\n\n        -- Ordered placed on Senate Legislative Calendar under General Orders. Calendar No. 167.\n\n\n S.Res. 225 (Sen. Boozman):\n        A resolution designating the week of September 14 through September 20, 2025, as \"National Truck Driver Appreciation Week\".\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 414 (Sen. Lankford):\n        A resolution designating September 2025 as \"National Child Awareness Month\" to promote awareness of charities that benefit children as well as youth-serving organizations throughout the United States and recognizing the efforts made by those charities and organizations on behalf of children and youth as critical contributions to the future of the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 415 (Sen. Hyde-Smith):\n        A resolution designating the week of September 21 through September 27, 2025, as \"Gold Star Families Remembrance Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 416 (Sen. Scott, of SC):\n        A resolution expressing support for the designation of September 2025 as \"Sickle Cell Disease Awareness Month\" in order to educate communities across the United States about sickle cell disease and the need for research, early detection methods, effective treatments, and preventative care programs with respect to complications from sickle cell disease and conditions related to sickle cell disease.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 417 (Sen. Schatz):\n        A resolution supporting the designation of the week of September 14 through September 20, 2025, as \"Telehealth Awareness Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Friday, September 19)","actionItem":"PN120:\n        59 nominations in the Air Force beginning with Ian S. Anderson and ending with Somvang Xayarath\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN343:\n        Michael G. Waltz, of Florida, to be the Representative of the United States of America to the United Nations, with the Rank of Ambassador, and the Representative of the United States of America in the Security Council of the United Nations\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 47 - 45. Record Vote Number: 529 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 47 - 43. Record Vote Number: 530 \n\n\n\n PN354:\n        Gen. Christopher J. Mahoney, in the Marine Corps, to be General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN382:\n        14 nominations in the Air Force beginning with Jared L. Bishop and ending with Anthony V. Santino\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN392:\n        Benjamin A. Bonner, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN403-1:\n        2 nominations in the Air Force beginning with Col. Sara A. Stigler and ending with Col. Robert B. Taylor\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN405-1:\n        22 nominations in the Air Force beginning with Col. Joshua D. Armstrong and ending with Col. Sheldon B. Wilson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN426:\n        98 nominations in the Space Force beginning with Michael D. Albert and ending with Rick H. Yuan\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN427:\n        115 nominations in the Space Force beginning with Rosalinda M. Alfaro and ending with Willie A. Youngblood\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN428:\n        59 nominations in the Space Force beginning with Brian G. Allen and ending with David C. Zesinger\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN429:\n        60 nominations in the Space Force beginning with Daniel N. Banakos and ending with Julius A. Williams\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN430:\n        53 nominations in the Space Force beginning with John M. Aguirre and ending with Derek B. Worth\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN435:\n        3 nominations in the Army beginning with Michael R . Barton and ending with Kirk V. Thorsteinson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN436:\n        Bryan J. Laroche, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN437:\n        Phuong T. Pham, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN439:\n        Col. Lynn M. Lee, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN440-1:\n        11 nominations in the Air Force beginning with Brig. Gen. Daniel M. Fesler and ending with Brig. Gen. Stephanie S. Samenus\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN441-3:\n        3 nominations in the Air Force beginning with Brig. Gen. James D. Cleet and ending with Brig. Gen. Gregory A. Krane\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN442:\n        Brig. Gen. Christopher M. Blomquist, in the Air Force, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN443:\n        Brig. Gen. Monie R. Ulis, in the Army, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN449:\n        18 nominations in the Air Force beginning with Amy C. Brown and ending with Sarah M. Wheeler\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN450:\n        18 nominations in the Air Force beginning with Marc G. Carns and ending with David L. Walker\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN452:\n        18 nominations in the Air Force beginning with Donella D. Beaulieu and ending with Sarah M. Whitson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN454:\n        317 nominations in the Air Force beginning with Alexandra E. Ables and ending with Alec J. Ziemann\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN455:\n        54 nominations in the Air Force beginning with Sean T. Adams and ending with Carlos X. Zambrano\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN456:\n        147 nominations in the Air Force beginning with Ansel V. Aiken and ending with Taylor E. Zurlinden\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN457:\n        198 nominations in the Army beginning with Steven J. Ackerson and ending with 0003789078\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN458:\n        152 nominations in the Army beginning with Charles M. Abeyawardena and ending with 0003951181\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN459:\n        114 nominations in the Army beginning with James Acevedo and ending with Shadrika Y. Witherspoon\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN460:\n        14 nominations in the Army beginning with James D. Browne, Jr. and ending with John C. Tolin\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN467:\n        Brig. Gen. Humberto Pabon, Jr., in the Air Force, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN469:\n        Col. Roderick T. Grunwald, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN470-1:\n        5 nominations in the Army beginning with Lt. Gen. Jonathan P. Braga and ending with Maj. Gen. James M. Smith\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN470-2:\n        3 nominations in the Air Force beginning with Maj. Gen. Kenyon K. Bell and ending with Maj. Gen. Brandon D. Parker\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN470-3:\n        2 nominations in the Marine Corps beginning with Maj. Gen. Joseph R. Clearfield and ending with Maj. Gen. William H. Swan\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN471:\n        Brig. Gen. John M. Dreska, in the Army, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN472:\n        Lt. Gen. Bradford J. Gering, in the Marine Corps, to be General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN475:\n        Vice Adm. George M. Wikoff, in the Navy, to be Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN476-1:\n        Rear Adm. Heidi K. Berg, in the Navy, to be Vice Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN477:\n        3 nominations in the Air Force beginning with Christopher S. Morgan and ending with Dayle P. Percle\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN478:\n        2 nominations in the Army beginning with Peter G. Juetten and ending with Robert E. Murdough\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN479-1:\n        2 nominations in the Navy beginning with Sara R. De Groot and ending with Brian Korn\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN479-2:\n        Keaton H. Harrell, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN480:\n        Richard A. Benson, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN481:\n        2 nominations in the Army beginning with William R . Cary and ending with Kyle S. Jaschen\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN482:\n        4 nominations in the Army beginning with Eric E. Abrahamsen and ending with Jeffrey W. Wiesner, Jr.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN483:\n        40 nominations in the Army beginning with Jonathan W. Anderson and ending with 0002254443\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN484:\n        155 nominations in the Marine Corps beginning with Matthew S. Allen and ending with Adam Yang\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN485:\n        45 nominations in the Navy beginning with Joel Almanzanunez and ending with David A. Wakeman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN486:\n        10 nominations in the Navy beginning with Brandon L. Barker and ending with Graham D. Ziemba\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN487:\n        26 nominations in the Navy beginning with Eric J. Blomberg and ending with Thomas A. Williams\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN488:\n        203 nominations in the Navy beginning with Vivek M . Abraham and ending with Artemisa A. Zuazo\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN489:\n        63 nominations in the Navy beginning with Riaz M. Ali and ending with Won H. Yu\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN490:\n        159 nominations in the Navy beginning with Leonard E. Abadam and ending with Kellylynn Zuni\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN491:\n        7 nominations in the Navy beginning with Hannah J. Addom-Tetteh and ending with William E. Omalley\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN492:\n        48 nominations in the Navy beginning with Brandy D . Bennett and ending with Cheol Yi\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN493:\n        54 nominations in the Navy beginning with Caleb D. Aaberg and ending with Dmitriy Yakubov\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN494:\n        3 nominations in the Navy beginning with William J . Dean and ending with Brenton W. Heisserer\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN495:\n        57 nominations in the Navy beginning with Jessica L. Abbey and ending with William Z. Xu\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN496:\n        134 nominations in the Navy beginning with Christina M. Acosta and ending with Anya L. Zapf\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN497:\n        67 nominations in the Navy beginning with Abraham D. Agus and ending with David Zhu\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN500:\n        Harrison E. Payne, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN501:\n        98 nominations in the Army beginning with Natascha R. Anderson and ending with Nathan P. Zwintscher\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN502:\n        Adam C. Eccleston, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN503:\n        Carsell Walker, Jr., in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN504:\n        Stephen A. Noorlag, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN505:\n        Brian M. Gallavan, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN506:\n        Sharif I. Faruque, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN507:\n        28 nominations in the Navy beginning with Adam E. Bayer and ending with Zachary B. Zumwalt\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN508:\n        33 nominations in the Navy beginning with Damian R . Allen and ending with Michael S. Yeary\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN509:\n        121 nominations in the Navy beginning with Teddy G . Ajero, Jr. and ending with Kenneth E. Zitnik\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN510:\n        35 nominations in the Navy beginning with Amy T. Alfaro and ending with Jeremy P. Wade\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN511:\n        53 nominations in the Navy beginning with Alexander Alba and ending with Sobondo J. Wilson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN512:\n        23 nominations in the Navy beginning with Zachary P. Branch and ending with Sharlena Y. Williams\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN513:\n        65 nominations in the Navy beginning with Kara L. Ballas and ending with Justin K. Wooley\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN514:\n        45 nominations in the Navy beginning with Adam M. Alleman and ending with Rosanne M. Witt\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN515:\n        Scott A. Metcalf, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN516:\n        2 nominations in the Navy beginning with Johan Baik and ending with Brett K. Cartwright\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  2:34 p.m., the Senate adjourned, under its order of today, until  8:30 a.m. on Monday, September 22, 2025.","actionTimeStamp":"--"}]}