{"retrieved-date":"2024-5-22","actions-date":"Wed, 22 May 2024 13:54:52 -0400","actions-title":"House Floor Proceedings","actions-count":15,"actions-list":[{"index":1,"header":"On ordering the previous question Roll Call 221","actionItem":"Yea and Nay vote pending.","actionTimeStamp":"Wed, 22 May 2024 13:54:52 -0400"},{"index":2,"header":"DEBATE","actionItem":"The House continued with further debate on H. Res. 1243.","actionTimeStamp":"Wed, 22 May 2024 13:47:45 -0400"},{"index":3,"header":"WORDS TAKEN DOWN","actionItem":"During the course of debate, exception was taken to certain words used and a demand was made to have the words taken down. After review, the Chair ruled that the words were in violation of the spirit of debate. Without objection the words were stricken from the record.","actionTimeStamp":"Wed, 22 May 2024 13:46:58 -0400"},{"index":4,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 1243.","actionTimeStamp":"Wed, 22 May 2024 12:20:56 -0400"},{"index":5,"header":"--","actionItem":"Considered as privileged matter. H. Res. 1243 — \"Providing for consideration of the bill (H.R. 4763) to provide for a system of regulation of digital assets by the Commodity Futures Trading Commission and the Securities and Exchange Commission, and for other purposes; providing for consideration of the bill (H.R. 5403) to amend the Federal Reserve Act to prohibit the Federal reserve banks from offering certain products or services directly to an individual, to prohibit the use of central bank digital currency for monetary policy, and for other purposes; and providing for consideration of the bill (H.R. 192) to prohibit individuals who are not citizens of the United States from voting in elections in the District of Columbia.\"","actionTimeStamp":"Wed, 22 May 2024 12:15:25 -0400"},{"index":6,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches.","actionTimeStamp":"Wed, 22 May 2024 12:04:24 -0400"},{"index":7,"header":"--","actionItem":"The House received a message from the Senate. The Senate passed S.J. Res. 58.","actionTimeStamp":"Wed, 22 May 2024 12:03:40 -0400"},{"index":8,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Takano to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 22 May 2024 12:02:51 -0400"},{"index":9,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 22 May 2024 12:02:40 -0400"},{"index":10,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Wed, 22 May 2024 12:01:02 -0400"},{"index":11,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of May 22.","actionTimeStamp":"Wed, 22 May 2024 12:00:00 -0400"},{"index":12,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Wed, 22 May 2024 11:27:27 -0400"},{"index":13,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Wed, 22 May 2024 10:00:38 -0400"},{"index":14,"header":"--","actionItem":"The Speaker designated the Honorable Chuck Edwards to act as Speaker pro tempore for today.","actionTimeStamp":"Wed, 22 May 2024 10:00:20 -0400"},{"index":15,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 22 May 2024 10:00:00 -0400"}]}