{"retrieved-date":"2024-5-6","actions-date":"Thursday, May 2, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, May  2)","actionItem":"H.R. 593 (Rep. Carter):\n        A bill to rename the Department of Veterans Affairs community-based outpatient clinic in Hinesville, Georgia, as the \"John Gibson, Dan James, William Sapp, and Frankie Smiley VA Clinic\".\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 3935 (Rep. Graves):\n        A bill to amend title 49, United States Code, to reauthorize and improve the Federal Aviation Administration and other civil aviation programs, and for other purposes.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 81 - 10. Record Vote Number: 158 \n\n\n        -- Measure laid before Senate by motion.\n\n\n H.Con.Res. 89 (Rep. Kustoff):\n        A concurrent resolution authorizing the use of Emancipation Hall in the Capitol Visitor Center for a ceremony as part of the commemoration of the days of remembrance of victims of the Holocaust.\n\n        -- Resolution agreed to in Senate without amendment by Unanimous Consent.\n\n\n S. 3249 (Sen. Moran):\n        A bill to designate the outpatient clinic of the Department of Veterans Affairs in Wyandotte County, Kansas City, Kansas, as the \"Captain Elwin Shopteese VA Clinic\".\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 3285 (Sen. Daines):\n        A bill to rename the community-based outpatient clinic of the Department of Veterans Affairs in Butte, Montana, as the \"Charlie Dowd VA Clinic\".\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 652 (Sen. Klobuchar):\n        A resolution designating April 2024 as \"Second Chance Month\".\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 671 (Sen. Shaheen):\n        A resolution expressing support for the designation of the week of April 28, 2024, through May 4, 2024, as \"National Small Business Week\" to celebrate the contributions of small businesses and entrepreneurs in every community in the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 672 (Sen. Grassley):\n        A resolution recognizing and supporting the goals and ideals of National Sexual Assault Awareness and Prevention Month.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 673 (Sen. Boozman):\n        A resolution honoring the life of David Hampton Pryor, former United States Senator for the State of Arkansas.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 674 (Sen. Daines):\n        A resolution designating May 5, 2024, as the \"National Day of Awareness for Missing and Murdered Native Women and Girls\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 675 (Sen. Cardin):\n        A resolution promoting minority health awareness and supporting the goals and ideals of National Minority Health Month in April 2024, which include bringing attention to the health disparities faced by minority populations of the United States such as American Indians , Alaska Natives, Asian Americans, African Americans, Hispanics, and Native Hawaiians and other Pacific Islanders.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Con.Res. 34 (Sen. Klobuchar):\n        A concurrent resolution establishing the Joint Congressional Committee on Inaugural Ceremonies for the inauguration of the President-elect and Vice President-elect of the United States on January 20 , 2025.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.\n\n\n S.Con.Res. 35 (Sen. Klobuchar):\n        A concurrent resolution authorizing the use of the rotunda and Emancipation Hall of the Capitol by the Joint Congressional Committee on Inaugural Ceremonies in connection with the proceedings and ceremonies conducted for the inauguration of the President-elect and the Vice President-elect of the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, May  2)","actionItem":"PN31:\n        Stephanie Syptak-Ramnath, of Texas, to be Ambassador to the Republic of Peru\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN134:\n        Cynthia Kierscht, of Minnesota, to be Ambassador to the Republic of Djibouti\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN285-2:\n        Laura E. Williams, in the Foreign Service\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN306:\n        Robert David Gioia, of New York, to be a Commissioner on the part of the United States on the International Joint Commission, United States and Canada\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN370-2:\n        Rear Adm. (lh) Jeffrey J. Czerewko, in the Navy, to be Rear Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN445:\n        John Joseph Sullivan, of Maryland, to be a Member of the Board of Directors of the United States Institute of Peace for a term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN497:\n        7 nominations in the Foreign Service beginning with William Czajkowski and ending with Everett Wakai\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN833:\n        Laura Stone, of Utah, to be Ambassador to the Republic of the Marshall Islands\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN875:\n        Joann M. Lockard, of Virginia, to be Ambassador to Burkina Faso\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN902:\n        Cardell Kenneth Richardson, Sr., of Virginia, to be Inspector General, Department of State\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1074:\n        Capt. Joanna K. Hiigel, in the Coast Guard, to be Rear Admiral (Lower Half)\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1098:\n        Kamala Shirin Lakhdhir, of Connecticut, to be Ambassador to the Republic of Indonesia\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1116-1:\n        6 nominations in the Coast Guard beginning with Sean P. Regan and ending with Jo-Ann F. Burdian\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1117:\n        2 nominations in the Coast Guard beginning with Franklin Schaefer and ending with Tiffany Danko\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1128:\n        3 nominations in the Foreign Service beginning with John C. Brewer and ending with William Johann Schmonsees\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1148:\n        335 nominations in the Coast Guard beginning with Dante Adams and ending with George O. Ziworitin\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1200:\n        Angela C. Angelini, in the Space Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1288:\n        2 nominations in the Coast Guard beginning with Victoria C. Futch and ending with Nicholas C. Custer\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1289:\n        Adam R. Williamson, in the Coast Guard, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1298:\n        Capt. Kevin J. Brown, in the Navy, to be Rear Admiral (lower half)\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1300:\n        Capt. Jorge R. Cuadros, in the Navy, to be Rear Admiral (lower half)\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1301:\n        Rear Adm. Thomas G. Allan, Jr., in the Coast Guard , to be Vice Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1302:\n        Rear Adm. Nathan A. Moore, in the Coast Guard, to be Vice Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1333:\n        Jennifer M. Adams, of Virginia, to be Ambassador to the Republic of Cabo Verde\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1335:\n        Arthur W. Brown, of Pennsylvania, to be Ambassador to the Republic of Ecuador\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1338:\n        Richard Mills, Jr., of Georgia, to be Ambassador to the Federal Republic of Nigeria\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1339:\n        Lisa Peterson, of Virginia, to be Ambassador to the Republic of Burundi\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1340:\n        Richard H. Riley IV, of California, to be Ambassador to the Federal Republic of Somalia\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1341:\n        Elizabeth Rood, of Pennsylvania, to be Ambassador to Turkmenistan\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1345:\n        Mark Toner, of Pennsylvania, to be Ambassador to the Republic of Liberia\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1346:\n        Pamela M. Tremont, of Virginia, to be Ambassador to the Republic of Zimbabwe\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1394:\n        3 nominations in the Coast Guard beginning with Keedah N. Ray and ending with Gregory W. Peck\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1395:\n        Daniel J. Reilly, in the Coast Guard, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1396:\n        137 nominations in the Foreign Service beginning with Jean E. Akers and ending with Stephen Ziegenfuss\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1397:\n        3 nominations in the Foreign Service beginning with Donald A. Blome and ending with Donald Lu\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1398:\n        59 nominations in the Foreign Service beginning with Eliza F. Al-Laham and ending with Richard Tsutomu Yoneoka\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1415:\n        Tiffany G. Danko, in the Coast Guard, to be Rear Admiral (Lower Half)\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1442:\n        Rear Adm. (lh) Jeffrey J. Kilian, in the Navy, to be Rear Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1457:\n        Rebecca E. Ore, in the Coast Guard, to be Rear Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1497:\n        Vice Adm. Kevin E. Lunday, in the Coast Guard, to be Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1505:\n        Lt. Gen. James F. Glynn, in the Marine Corps, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1506:\n        Rear Adm. (lh) Joseph B. Hornbuckle, in the Navy, to be Rear Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1507:\n        Linden M. Dahlkemper, in the Coast Guard, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1508:\n        April B. Stahl, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1509:\n        2 nominations in the Air Force beginning with Richard G. Barfield and ending with Frantz Pierre-Louis\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1510:\n        Jill E. Hopkins, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1511:\n        Justin J. Dupree, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1512:\n        Matthew J. Barnes, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1513:\n        Raymond T. Gillen, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1514:\n        Daniel L. Petterson, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1515:\n        Justin L. Sanders, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1516:\n        7 nominations in the Army beginning with Timothy W. Blatter and ending with Elizabeth A. Roxworthy\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1517:\n        Serena T. Mukai, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1518:\n        11 nominations in the Army beginning with Harold B. Bender and ending with Yorlondo S. Wortham\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1519:\n        6 nominations in the Army beginning with Russell D. Boyd and ending with Michael J. Willer\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1520:\n        3 nominations in the Army beginning with Robert M. Farmer and ending with Stephen B. Yarber\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1521:\n        Timothy L. Mitchell, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1522:\n        Douglas R. Burian, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1523:\n        Romeo P. Cubas, in the Marine Corps, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1525:\n        Leslie L. Hubbell, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1526:\n        George L. Bright, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1527:\n        33 nominations in the Navy beginning with Scott M. Birkemeier and ending with John L. Vincent\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1528:\n        2 nominations in the Navy beginning with Bryan P. Clayton and ending with George M. Johnson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1530:\n        53 nominations in the Navy beginning with Daniel M. Araki and ending with Jenna M. Westerberg\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1531:\n        32 nominations in the Navy beginning with Andres J. Aviles and ending with Adam I. Zaker\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1532:\n        Tammy Bolin, in the Coast Guard, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1533:\n        Derek D. Wilson, in the Coast Guard, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1534-1:\n        77 nominations in the Coast Guard beginning with Jennifer J. Andrew and ending with Christopher J. Young\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1542:\n        2 nominations in the Army beginning with Brig. Gen. Brian T. Cashman and ending with Brig. Gen. Susie S. Kuilan\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1544:\n        Tucker R. Hamilton, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1545:\n        Jason D. Walker, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1546:\n        2 nominations in the Air Force beginning with Andrew H. Black and ending with Ryan M. Kehoe\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1547:\n        2 nominations in the Air Force beginning with Jeffrey A. Banks and ending with Jonathan D. Heavey\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1548:\n        Vanessa A. Gasswint, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1549:\n        Brett J. Cooper, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1550:\n        Jacob J. Dalrymple, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1551:\n        Mark E. Delory, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1552:\n        Reymond J. Ramos, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1553:\n        Reza H. Heshmati, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1554:\n        William C. Perry, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1555:\n        Todd P. Balog, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1556:\n        Edgar A. Gonzalez, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1557:\n        Breyer M. Houston, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1559:\n        Maj. Gen. Stephen F. Jost, in the Air Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1560:\n        Robert U. Wright, Jr., in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1561:\n        Kristin N. Conti, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1562:\n        Rance A. Lee, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1563:\n        Kourtney C. Slaughter, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1564:\n        Kevin J. Barry, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1565:\n        2 nominations in the Space Force beginning with Jabb B. Bumanglag and ending with Christian J. Young\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1566:\n        Branden E. Buffalo, in the Space Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1579:\n        Maj. Gen. Case A. Cunningham, in the Air Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1582:\n        Col. John A. Cluck, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1583-1:\n        27 nominations in the Air Force beginning with Col. Jack R. Arthaud and ending with Col. Douglas P. Wickert\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1584:\n        Col. Brian E. Vaughn, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1585:\n        Maj. Gen. Joseph P. McGee, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1586:\n        Maj. Gen. Michael J. Borgschulte, in the Marine Corps, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1587:\n        Maj. Gen. Roberta L. Shea, in the Marine Corps, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1588:\n        Maj. Gen. Paul J. Rock, Jr., in the Marine Corps, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1589:\n        2 nominations in the Space Force beginning with Brig. Gen. Dennis O. Bythewood and ending with Brig. Gen. James E. Smith\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1591:\n        3 nominations in the Air Force beginning with Edward F. Hwang and ending with Jake M. Miller\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1592:\n        15 nominations in the Air Force beginning with Barry J. Burton and ending with Douglas N. Wren\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1593:\n        45 nominations in the Air Force beginning with Jennifer Davenport Almonte and ending with Kimberly D. Young\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1596:\n        4 nominations in the Air Force beginning with Jessica J. Grimm and ending with Emily E. Rucker\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1597:\n        Mark D. Buzzelli, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1600:\n        Andrew R. Morgan, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1602:\n        49 nominations in the Army beginning with Aaron V. Allen and ending with Kristy M. Wolter\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1603-1:\n        212 nominations in the Army beginning with Carl N. Adams and ending with Edward O. Ziembinski\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1604:\n        8 nominations in the Air Force beginning with Jessica Ducusin Arcilla and ending with Norcise L. Williams\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1605:\n        10 nominations in the Air Force beginning with Cassandra Noel Ayott and ending with Ruth A. Turner\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1606:\n        4 nominations in the Air Force beginning with Lisa A. Brown and ending with Timothy J. Strigenz\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1607:\n        9 nominations in the Air Force beginning with Christopher L. Allen and ending with Marvin H. Sineath, Jr.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1608:\n        Jennifer M. Depew, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1609:\n        3 nominations in the Air Force beginning with Michael J. Chung and ending with Diep H. Le\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1610:\n        4 nominations in the Air Force beginning with David M. Daus and ending with Matthew C. Zimmerman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1611:\n        12 nominations in the Air Force beginning with Ryan J. Albrecht and ending with Katherine C. Seto\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1612:\n        Willie J. Brown, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1613:\n        34 nominations in the Air Force beginning with Ulric A. Adams, Jr. and ending with Christopher A. Williams\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1614:\n        6 nominations in the Air Force beginning with Nathan A. Case and ending with Omar A. Perea\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1615:\n        66 nominations in the Air Force beginning with Nicolas Solomon Alcocer and ending with Robert Conwell Zeese\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1616:\n        Scott W. Hurrelbrink, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1630:\n        Brig. Gen. Robert T. Wooldridge II, in the Army, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1631:\n        Brig. Gen. Timothy L. Rieger, in the Army, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1632:\n        Col. Grant S. Fawcett, in the Army, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1633:\n        Col. Michael D. Rose, in the Army, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1634:\n        Rear Adm. (lh) Dion D. English, in the Navy, to be Vice Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1635:\n        Vice Adm. Michael E. Boyle, in the Navy, to be Vice Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1636:\n        Michelle G. Stucky, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1637:\n        Eve C. Cremers, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1638:\n        4 nominations in the Army beginning with Daniel J. Allen and ending with Darren L. Koberlein\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1639:\n        6 nominations in the Army beginning with Paul M. Dyer and ending with Joel N. Stamp\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1640:\n        Davis L. Spurlock, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1641:\n        Morgan M. Griffin, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1642:\n        Bryan K. Walker, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1643:\n        Julissa J. Myers, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1648:\n        Craig R. Bottoni, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schatz, at  4:00 p.m., the Senate adjourned, under its order of today, until  9 a.m. tomorrow.","actionTimeStamp":"--"}]}