{"retrieved-date":"2025-5-5","actions-date":"Mon, 05 May 2025 14:11:07 -0400","actions-title":"House Floor Proceedings","actions-count":15,"actions-list":[{"index":1,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is subject to the call of the Chair.","actionTimeStamp":"Mon, 05 May 2025 14:11:07 -0400"},{"index":2,"header":"Election Assistance Commission Board of Advisors","actionItem":"Pursuant to section 214(a) of the Help America Vote Act of 2002 (52 U.S.C. 20944), and the order of the House of January 3, 2025, the Speaker appointed Mr. Donald F. McGahn II, Potomac Maryland.","actionTimeStamp":"Mon, 05 May 2025 14:11:02 -0400"},{"index":3,"header":"U.S. Election Assistance Commission Board of Advisors","actionItem":"Pursuant to Section 214(a) of the Help America Vote Act of 2002 (52 U.S.C. 20944), the Democratic Leader reappointed Mr. Brian Michael Lemek, Potomac, Maryland.","actionTimeStamp":"Mon, 05 May 2025 14:10:39 -0400"},{"index":4,"header":"FISA Reform Commission","actionItem":"Pursuant to section 18(c)(2)(A)(i)(VIII) and (IX) of the Reforming Intelligence and Securing America Act (Public Law 118-49), the Democratic Leader appointed the following member of the House to the serve as a Commissioner to the FISA Reform Commission: Mr. Himes. The Democratic Leader also appointed the following individuals to serve as Commissioners to the FISA Reform Commission: Ms. Sharon Bradford Franklin of Bethesda, Maryland, and Mr. Glenn Steven Gerstell of Washington, District of Columbia.","actionTimeStamp":"Mon, 05 May 2025 14:10:11 -0400"},{"index":5,"header":"Public Interest Declassification Board","actionItem":"Pursuant to section 703(c) of the Public Interest Declassification Act of 2000 (50 U.S.C. 361 note), the Democratic Leader appointed the Honorable Valdez Butler Demings, Orlando, Florida.","actionTimeStamp":"Mon, 05 May 2025 14:09:42 -0400"},{"index":6,"header":"--","actionItem":"The House received a message from the Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Representatives, the Clerk notified the House that he had received the following message from the Secretary of the Senate on May 1, 2025, at 3:40 p.m.: That the Senate passed S. 307, S. 616, S.J. Res. 31, H.J. Res. 42, and H.J. Res. 75; and that the Senate agreed to H. Con. Res. 9.","actionTimeStamp":"Mon, 05 May 2025 14:08:43 -0400"},{"index":7,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches.","actionTimeStamp":"Mon, 05 May 2025 14:04:20 -0400"},{"index":8,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Wilson of SC to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Mon, 05 May 2025 14:03:52 -0400"},{"index":9,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Mon, 05 May 2025 14:03:48 -0400"},{"index":10,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Mon, 05 May 2025 14:02:53 -0400"},{"index":11,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of May 5.","actionTimeStamp":"Mon, 05 May 2025 14:02:52 -0400"},{"index":12,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 2:00 P.M. today.","actionTimeStamp":"Mon, 05 May 2025 12:05:55 -0400"},{"index":13,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 2:00 p.m. for the start of legislative business.","actionTimeStamp":"Mon, 05 May 2025 12:00:38 -0400"},{"index":14,"header":"--","actionItem":"The Speaker designated the Honorable Mike Bost to act as Speaker pro tempore for today.","actionTimeStamp":"Mon, 05 May 2025 12:00:10 -0400"},{"index":15,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Mon, 05 May 2025 12:00:00 -0400"}]}