{"retrieved-date":"2024-4-30","actions-date":"Tue, 30 Apr 2024 11:03:50 -0400","actions-title":"House Floor Proceedings","actions-count":10,"actions-list":[{"index":1,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is subject to the call of the Chair.","actionTimeStamp":"Tue, 30 Apr 2024 11:03:50 -0400"},{"index":2,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on H. Res. 1173, the Chair put the question on ordering the previous question on H. Res. 1173, and by voice vote announced that the ayes prevailed. Ms. Leger Fernandez demanded the yeas and nays and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 30 Apr 2024 11:03:47 -0400"},{"index":3,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 1173.","actionTimeStamp":"Tue, 30 Apr 2024 10:13:37 -0400"},{"index":4,"header":"--","actionItem":"Considered as privileged matter. H. Res. 1173 — \"Providing for consideration of the bill (H.R. 615) to prohibit the Secretary of the Interior and the Secretary of Agriculture from prohibiting the use of lead ammunition or tackle on certain Federal land or water under the jurisdiction of the Secretary of the Interior and the Secretary of Agriculture, and for other purposes; providing for consideration of the bill (H.R. 2925) to amend the Omnibus Budget Reconciliation Act of 1993 to provide for security of tenure for use of mining claims for ancillary activities, and for other purposes; providing for consideration of the bill (H.R. 3195) to rescind Public Land Order 7917, to reinstate mineral leases and permits in the Superior National Forest, to ensure timely review of Mine Plans of Operations, and for other purposes; providing for consideration of the bill (H.R. 764) to require the Secretary of the Interior to reissue regulations removing the gray wolf from the list of endangered and threatened wildlife under the Endangered Species Act of 1973; providing for consideration of the bill (H.R. 3397) to require the Director of the Bureau of Land Management to withdraw a rule of the Bureau of Land Management relating to conservation and landscape health; providing for consideration of the bill (H.R. 6285) to ratify and approve all authorizations, permits, verifications, extensions, biological opinions, incidental take statements, and any other approvals or orders issued pursuant to Federal law necessary for the establishment and administration of the Coastal Plain oil and gas leasing program, and for other purposes; and providing for consideration of the bill (H.R. 6090) to provide for the consideration of a definition of antisemitism set forth by the International Holocaust Remembrance Alliance for the enforcement of Federal antidiscrimination laws concerning education programs or activities, and for other purposes.\"","actionTimeStamp":"Tue, 30 Apr 2024 10:07:27 -0400"},{"index":5,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches which by direction of the Chair, would be limited to 15 per side of the aisle.","actionTimeStamp":"Tue, 30 Apr 2024 10:03:01 -0400"},{"index":6,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mrs. Fischbach to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Tue, 30 Apr 2024 10:02:39 -0400"},{"index":7,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Tue, 30 Apr 2024 10:02:37 -0400"},{"index":8,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Tue, 30 Apr 2024 10:00:55 -0400"},{"index":9,"header":"--","actionItem":"The Speaker designated the Honorable Mary E. Miller to act as Speaker pro tempore for today.","actionTimeStamp":"Tue, 30 Apr 2024 10:00:25 -0400"},{"index":10,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Tue, 30 Apr 2024 10:00:00 -0400"}]}