{"retrieved-date":"2025-3-5","actions-date":"Tuesday, March 4, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, March  4)","actionItem":"S. 331 (Sen. Cassidy):\n        A bill to amend the Controlled Substances Act with respect to the scheduling of fentanyl-related substances, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.\n\n\n S.J.Res. 3 (Sen. Cruz):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Internal Revenue Service relating to \"Gross Proceeds Reporting by Brokers That Regularly Provide Services Effectuating Digital Asset Sales\".\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 70 - 28. Record Vote Number: 101 \n\n\n        -- Measure laid before Senate by motion.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 70 - 27. Record Vote Number: 102 \n\n\n\n S.J.Res. 28 (Sen. Ricketts):\n        A joint resolution disapproving the rule submitted by the Bureau of Consumer Financial Protection relating to \"Defining Larger Participants of a Market for General-Use Digital Consumer Payment Applications\".\n\n        -- Senate Committee on Banking, Housing, and Urban Affairs discharged, by petition, pursuant to 5 U.S.C. 802(c).\n\n        -- Placed on Senate Legislative Calendar under General Orders. Calendar No. 20 \n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 50 - 47. Record Vote Number: 103 \n\n\n        -- Measure laid before Senate by motion.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, March  4)","actionItem":"PN11-4:\n        Lori Chavez-DeRemer, of Oregon, to be Secretary of Labor\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN12-14:\n        Troy Edgar, of California, to be Deputy Secretary of Homeland Security\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at 11:04 p.m, the Presiding Officer (Mr. Moreno in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow .","actionTimeStamp":"--"}]}