{"retrieved-date":"2023-9-7","actions-date":"Wednesday, September 6, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, September  6)","actionItem":"S.Res. 329 (Sen. Schumer):\n        A resolution to authorize testimony and representation in United States v. Horn.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 330 (Sen. Cornyn):\n        A resolution expressing support for the goals and ideals of National Child Abuse Prevention Month.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 331 (Sen. Wicker):\n        A resolution designating August 2023 as \"National Catfish Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, September  6)","actionItem":"PN644:\n        Lisa DeNell Cook, of Michigan, to be a Member of the Board of Governors of the Federal Reserve System for a term of fourteen years from February 1, 2024\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 47. Record Vote Number: 217 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 47. Record Vote Number: 218 \n\n\n\n PN645:\n        Philip Nathan Jefferson, of North Carolina, to be Vice Chairman of the Board of Governors of the Federal Reserve System for a term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 88 - 10. Record Vote Number: 214 \n\n\n\n PN646:\n        Adriana Debora Kugler, of Maryland, to be a Member of the Board of Governors of the Federal Reserve System for the unexpired term of fourteen years from February 1, 2012\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 45. Record Vote Number: 219 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate and vote 9/7/2023.\n\n\n PN743:\n        Gwynne A. Wilcox, of New York, to be a Member of the National Labor Relations Board for the term of five years expiring August 27, 2028\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 215 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 48. Record Vote Number: 216","actionTimeStamp":"--"},{"index":6,"header":"Recess","actionItem":"Under the authority of the order of today, at  7:25 p.m, the Presiding Officer (Ms. Smith in the chair) declared the Senate recessed, under its order of today, until 10 a.m. tomorrow .","actionTimeStamp":"--"}]}