{"retrieved-date":"2023-11-2","actions-date":"Thu, 02 Nov 2023 12:39:26 -0400","actions-title":"House Floor Proceedings","actions-count":44,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 838, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 28.","actionTimeStamp":"Thu, 02 Nov 2023 12:39:26 -0400"},{"index":2,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 28 printed in Part A of House Report 118-261 to transfer $5,000,000 from the Environmnental Protection Agency to hazardous fuels reduction activities within the Bureau of Land Management.","actionTimeStamp":"Thu, 02 Nov 2023 12:38:41 -0400"},{"index":3,"header":"--","actionItem":"On agreeing to the Clyde amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 02 Nov 2023 12:38:19 -0400"},{"index":4,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 838, the Committee of the Whole proceeded with 10 minutes of debate on the Clyde amendment No. 21.","actionTimeStamp":"Thu, 02 Nov 2023 12:34:12 -0400"},{"index":5,"header":"--","actionItem":"An amendment, offered by Mr. Clyde,  numbered 21 printed in Part A of House Report 118-261 to transfer the $15,000 reception/representation allowance for the Secretary of the Interior to the spending reduction account.","actionTimeStamp":"Thu, 02 Nov 2023 12:33:48 -0400"},{"index":6,"header":"--","actionItem":"On agreeing to the Perry amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 02 Nov 2023 12:33:33 -0400"},{"index":7,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 838, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 19.","actionTimeStamp":"Thu, 02 Nov 2023 12:23:36 -0400"},{"index":8,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 19 printed in Part A of House Report 118-261 to reduce funding for the Bureau of Ocean Energy Management by $28 million for the purpose of eliminating funding for the Office of Renewable Energy Programs.","actionTimeStamp":"Thu, 02 Nov 2023 12:23:10 -0400"},{"index":9,"header":"--","actionItem":"On agreeing to the DeSaulnier amendment; Failed by voice vote.","actionTimeStamp":"Thu, 02 Nov 2023 12:22:59 -0400"},{"index":10,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 838, the Committee of the Whole proceeded with 10 minutes of debate on the DeSaulnier amendment No. 16.","actionTimeStamp":"Thu, 02 Nov 2023 12:16:33 -0400"},{"index":11,"header":"--","actionItem":"An amendment, offered by Mr. DeSaulnier,  numbered 16 printed in Part A of House Report 118-261 to strike section 447, which prohibits funds from being used to consider the social cost of carbon.","actionTimeStamp":"Thu, 02 Nov 2023 12:16:13 -0400"},{"index":12,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Collins amendment No. 15, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Pingree demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 02 Nov 2023 12:15:34 -0400"},{"index":13,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 838, the Committee of the Whole proceeded with 10 minutes of debate on the Collins amendment No. 15.","actionTimeStamp":"Thu, 02 Nov 2023 12:07:35 -0400"},{"index":14,"header":"--","actionItem":"An amendment, offered by Mr. Collins,  numbered 15 printed in Part A of House Report 118-261 to transfer the Council on Environmental Quality's funding to the National Parks Service for construction activities.","actionTimeStamp":"Thu, 02 Nov 2023 12:06:54 -0400"},{"index":15,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Hageman amendment No. 2, the Chair put the question on agreeing to the amendment and by voice vote announced that the noes had prevailed. Ms. Hageman demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 02 Nov 2023 12:06:18 -0400"},{"index":16,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 838, the Committee of the Whole proceeded with 10 minutes of debate on the Hageman amendment No. 2.","actionTimeStamp":"Thu, 02 Nov 2023 11:56:57 -0400"},{"index":17,"header":"--","actionItem":"An amendment, offered by Ms. Hageman,  numbered 2 printed in Part A of House Report 118-261 to reduce Bureau of Land Management funding by 50%.","actionTimeStamp":"Thu, 02 Nov 2023 11:56:36 -0400"},{"index":18,"header":"--","actionItem":"On agreeing to the Griffith amendment; Failed by voice vote.","actionTimeStamp":"Thu, 02 Nov 2023 11:56:19 -0400"},{"index":19,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 838, the Committee of the Whole proceeded with 10 minutes of debate on the Griffith amendment No. 1.","actionTimeStamp":"Thu, 02 Nov 2023 11:48:32 -0400"},{"index":20,"header":"--","actionItem":"An amendment, offered by Mr. Griffith,  numbered 1 printed in Part A of House Report 118-261 to decrease the Bureau of Land Management's Wild Horse and Burro program funds by $74.232 million to Fiscal Year 2019 levels.","actionTimeStamp":"Thu, 02 Nov 2023 11:48:07 -0400"},{"index":21,"header":"--","actionItem":"On agreeing to the Simpson amendments; Agreed to by voice vote.","actionTimeStamp":"Thu, 02 Nov 2023 11:47:48 -0400"},{"index":22,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 838, the Committee of the Whole proceeded with 20 minutes of debate on the Simpson en bloc amendment.","actionTimeStamp":"Thu, 02 Nov 2023 11:46:00 -0400"},{"index":23,"header":"--","actionItem":"Amendments en bloc  offered by Mr. Simpson,  comprised of the following amendments printed in Part A of House Report 118-261 as en bloc: Nos. 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 17, 18, 20, 22, 23, 24, 25, 26, 27, 29, 30, 31, 32, 34, 36, 37, 40, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 69, and 105.","actionTimeStamp":"Thu, 02 Nov 2023 11:45:15 -0400"},{"index":24,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 4821.","actionTimeStamp":"Thu, 02 Nov 2023 11:03:31 -0400"},{"index":25,"header":"--","actionItem":"The Speaker designated the Honorable August Pfluger to act as Chairman of the Committee.","actionTimeStamp":"Thu, 02 Nov 2023 11:02:47 -0400"},{"index":26,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 838 and Rule XVIII.","actionTimeStamp":"Thu, 02 Nov 2023 11:02:46 -0400"},{"index":27,"header":"--","actionItem":"Rule provides for consideration of H.R. 4821, H.R. 4820 and H.R. 6126. The resolution provides for consideration of H.R. 4821 and H.R. 4820 under a structured rule with one hour of general debate for each bill. The resolution provides for consideration of H.R. 6126, under a closed rule, with one hour of general debate. Each measure has one motion to recommit.","actionTimeStamp":"Thu, 02 Nov 2023 11:01:02 -0400"},{"index":28,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 838. H.R. 4821 — \"Making appropriations for the Department of the Interior, environment, and related agencies for the fiscal year ending September 30, 2024, and for other purposes.\"","actionTimeStamp":"Thu, 02 Nov 2023 11:00:57 -0400"},{"index":29,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Thu, 02 Nov 2023 11:00:55 -0400"},{"index":30,"header":"On agreeing to the resolution Agreed to by recorded vote: 213","actionItem":"203 (Roll no. 566).","actionTimeStamp":"Thu, 02 Nov 2023 11:00:53 -0400"},{"index":31,"header":"On ordering the previous question Agreed to by the Yeas and Nays: 213","actionItem":"200 (Roll no. 565).","actionTimeStamp":"Thu, 02 Nov 2023 10:52:31 -0400"},{"index":32,"header":"--","actionItem":"Considered as unfinished business. H. Res. 838 — \"Providing for consideration of the bill (H.R. 4821) making appropriations for the Department of the Interior, environment, and related agencies for the fiscal year ending September 30, 2024, and for other purposes; providing for consideration of the bill (H.R. 4820) making appropriations for the Departments of Transportation, and Housing and Urban Development, and related agencies for the fiscal year ending September 30, 2024, and for other purposes; and providing for consideration of the bill (H.R. 6126) making emergency supplemental appropriations to respond to the attacks in Israel for the fiscal year ending September 30, 2024, and for other purposes.\"","actionTimeStamp":"Thu, 02 Nov 2023 10:16:30 -0400"},{"index":33,"header":"UNFINISHED BUSINESS","actionItem":"The Chair announced that the unfinished business was the question on ordering the previous question on H. Res. 838 and on agreeing to the resolution, if ordered, which had been debated earlier and on which further proceedings had been postponed.","actionTimeStamp":"Thu, 02 Nov 2023 10:16:12 -0400"},{"index":34,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of November 2.","actionTimeStamp":"Thu, 02 Nov 2023 10:16:11 -0400"},{"index":35,"header":"--","actionItem":"The Speaker announced that the House do now recess for a period of less than 15 minutes.","actionTimeStamp":"Thu, 02 Nov 2023 10:07:54 -0400"},{"index":36,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on H. Res. 838, the Chair put the question on ordering the previous question and by voice vote announced that the ayes had prevailed. Mr. McGovern demanded the yeas and nays and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 02 Nov 2023 10:07:53 -0400"},{"index":37,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 838.","actionTimeStamp":"Thu, 02 Nov 2023 09:24:48 -0400"},{"index":38,"header":"--","actionItem":"Considered as privileged matter. H. Res. 838 — \"Providing for consideration of the bill (H.R. 4821) making appropriations for the Department of the Interior, environment, and related agencies for the fiscal year ending September 30, 2024, and for other purposes; providing for consideration of the bill (H.R. 4820) making appropriations for the Departments of Transportation, and Housing and Urban Development, and related agencies for the fiscal year ending September 30, 2024, and for other purposes; and providing for consideration of the bill (H.R. 6126) making emergency supplemental appropriations to respond to the attacks in Israel for the fiscal year ending September 30, 2024, and for other purposes.\"","actionTimeStamp":"Thu, 02 Nov 2023 09:18:03 -0400"},{"index":39,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair would be limited to 5 per side of the aisle.","actionTimeStamp":"Thu, 02 Nov 2023 09:04:05 -0400"},{"index":40,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Johnson of SD to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 02 Nov 2023 09:03:47 -0400"},{"index":41,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Thu, 02 Nov 2023 09:03:43 -0400"},{"index":42,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Thu, 02 Nov 2023 09:02:17 -0400"},{"index":43,"header":"--","actionItem":"The Speaker designated the Honorable Russ Fulcher to act as Speaker pro tempore for today.","actionTimeStamp":"Thu, 02 Nov 2023 09:01:55 -0400"},{"index":44,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 02 Nov 2023 09:00:00 -0400"}]}