{"retrieved-date":"2025-1-28","actions-date":"Tue, 28 Jan 2025 11:06:10 -0500","actions-title":"House Floor Proceedings","actions-count":17,"actions-list":[{"index":1,"header":"Board of Visitors to the United States Naval Academy","actionItem":"Pursuant to 10 U.S.C. 8468(a), the Democratic Leader appointed the following member of the House to the Board of Visitors to the United States Naval Academy: Ms. Elfreth.","actionTimeStamp":"Tue, 28 Jan 2025 11:06:10 -0500"},{"index":2,"header":"Board of Visitors to the United States Military Academy","actionItem":"Pursuant to 10 U.S.C. 4355(a), the Democratic Leader appointed the following member of the House to the Board of Visitors to the United States Military Academy: Mr. Ryan.","actionTimeStamp":"Tue, 28 Jan 2025 11:05:56 -0500"},{"index":3,"header":"Board of Visitors to the United States Air Force Academy","actionItem":"Pursuant to 10 U.S.C. 9455(a), the Democratic Leader appointed the following member of the House to the Board of Visitors to the United States Air Force Academy: Mr. Davis of North Carolina.","actionTimeStamp":"Tue, 28 Jan 2025 11:05:33 -0500"},{"index":4,"header":"Commission on Reform and Modernization of the Department of State","actionItem":"Pursuant to section 9803(d)(1)(C) and (E) of the James M. Inhofe National Defense Authorization Act for Fiscal Year 2023 (Public Law 117-263), the Democratic Leader appointed the following member of the House to the Commission on Reform and Modernization of the Department of State: Mr. Quigley.","actionTimeStamp":"Tue, 28 Jan 2025 11:05:02 -0500"},{"index":5,"header":"Tom Lantos Human Rights Commission","actionItem":"Pursuant to Section 4(c) of House Resolution 5, 119th Congress, the Democratic Leader appointed the following member of the House to the Tom Lantos Human Rights Commission: Mr. McGovern.","actionTimeStamp":"Tue, 28 Jan 2025 11:04:40 -0500"},{"index":6,"header":"House Democracy Partnership","actionItem":"Pursuant to Section 4(b) of House Resolution 5, 119th Congress, the Democratic Leader appointed the following members of the House to the House Democracy Partnership: Ms. Titus, Ms. Moore of Wisconsin, Mr. Lieu, Mrs. Torres of California, Ms. Kelly of Illinois, Ms. Sewell, Ms. DeGette, Ms. Omar and Mrs. Ramirez.","actionTimeStamp":"Tue, 28 Jan 2025 11:04:03 -0500"},{"index":7,"header":"United States Semiquincentennial Commission","actionItem":"Pursuant to Section 4 of the United States Semiquincentennial Commission Act of 2016 (Public Law 114-196), the Democratic Leader appointed the following members of the House to serve as Commissioners to the United States Semiquincentennial Commission: Mrs. Watson Coleman and Mr. Evans of Pennsylvania.","actionTimeStamp":"Tue, 28 Jan 2025 11:03:44 -0500"},{"index":8,"header":"Japan-United States Friendship Commission","actionItem":"Pursuant to 22 U.S.C. 2903, and the order of the House of January 3, 2025, the Speaker appointed the following member of the House to the Japan-United States Friendship Commission: Mr. Takano.","actionTimeStamp":"Tue, 28 Jan 2025 11:03:02 -0500"},{"index":9,"header":"Migratory Bird Conservation Commission","actionItem":"Pursuant to section 2 of the Migratory Bird Conservation Act (16 U.S.C. 715a), and the order of the House of January 3, 2025, the Speaker appointed the following member of the House to the Migratory Bird Conservation Commission: Mr. Thompson of California.","actionTimeStamp":"Tue, 28 Jan 2025 11:02:40 -0500"},{"index":10,"header":"Congressional-Executive Commission on the People's Republic of China","actionItem":"Pursuant to 22 U.S.C. 6913, and the order of the House of January 3, 2025, the Speaker appointed the following member of the House to the Congressional-Executive Commission on the People's Republic of China: Mr. McGovern.","actionTimeStamp":"Tue, 28 Jan 2025 11:02:23 -0500"},{"index":11,"header":"Board of Visitors to the United States Coast Guard Academy","actionItem":"Pursuant to 14 U.S.C. 1903(b), and the order of the House of January 3, 2025, the Speaker appointed the following member of the House to the Board of Visitors to the United States Coast Guard Academy: Mr. Courtney.","actionTimeStamp":"Tue, 28 Jan 2025 11:01:59 -0500"},{"index":12,"header":"United States Group of the NATO Parliamentary Assembly","actionItem":"Pursuant to 22 U.S.C. 1928a, and the order of the House of January 3, 2025, the Speaker appointed the following member of the House to the United States Group of the NATO Parliamentary Assembly: Mr. Bergman.","actionTimeStamp":"Tue, 28 Jan 2025 11:01:45 -0500"},{"index":13,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair led the House in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Tue, 28 Jan 2025 11:01:26 -0500"},{"index":14,"header":"SPEAKER'S APPROVAL OF THE JOURNAL","actionItem":"Pursuant to clause 13 of Rule I, the Journal of the last day's proceedings was approved.","actionTimeStamp":"Tue, 28 Jan 2025 11:01:14 -0500"},{"index":15,"header":"--","actionItem":"Today's prayer was offered by Rev. John Kellogg, Christ Church, Washington Parish, Washington D.C.","actionTimeStamp":"Tue, 28 Jan 2025 11:00:35 -0500"},{"index":16,"header":"--","actionItem":"The Speaker designated the Honorable Elise M. Stefanik to act as Speaker pro tempore for today.","actionTimeStamp":"Tue, 28 Jan 2025 11:00:06 -0500"},{"index":17,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Tue, 28 Jan 2025 11:00:00 -0500"}]}