{"retrieved-date":"2025-6-24","actions-date":"Wednesday, June 18, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, June 18)","actionItem":"H.R. 42 (Rep. Begich):\n        A bill to amend the Alaska Native Claims Settlement Act to exclude certain payments to aged, blind, or disabled Alaska Natives or descendants of Alaska Natives from being used to determine eligibility for certain programs, and for other purposes.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n H.R. 43 (Rep. Begich):\n        A bill to amend the Alaska Native Claims Settlement Act to provide that Village Corporations shall not be required to convey land in trust to the State of Alaska for the establishment of Municipal Corporations, and for other purposes.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n H.R. 618 (Rep. Horsford):\n        A bill to amend the Apex Project, Nevada Land Transfer and Authorization Act of 1989 to include the City of North Las Vegas and the Apex Industrial Park Owners Association, and for other purposes.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n H.R. 2215 (Rep. Moulton):\n        A bill to redesignate the Salem Maritime National Historic Site as the \"Salem Maritime National Historical Park\", and for other purposes.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n S. 154 (Sen. Hickenlooper):\n        A bill to amend the Energy and Water Development and Related Agencies Appropriations Act, 2015, to reauthorize the Colorado River System conservation pilot program.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n S. 282 (Sen. King):\n        A bill to provide greater regional access to the Katahdin Woods and Waters National Monument in the State of Maine, and for other purposes.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n S. 356 (Sen. Crapo):\n        A bill to extend the Secure Rural Schools and Community Self-Determination Act of 2000.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n S. 1112 (Sen. Cornyn):\n        A bill to adjust the boundary of Big Bend National Park in the State of Texas, and for other purposes.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n S.Res. 259 (Sen. Grassley):\n        A resolution recognizing June 2, 2025, as the 39th anniversary of C-SPAN chronicling democracy in the Senate.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 275 (Sen. Scott, of FL):\n        A resolution honoring the memory of the victims of the heinous attack at the Pulse nightclub on June 12, 2016.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 293 (Sen. Klobuchar):\n        A resolution commending the Minnesota Frost for winning the 2025 Professional Women's Hockey League Championship.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 294 (Sen. Capito):\n        A resolution designating the week of May 18 through May 24, 2025, as \"National Public Works Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Con.Res. 15 (Sen. Cassidy):\n        A concurrent resolution expressing support for America's law enforcement professionals.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, June 18)","actionItem":"PN12-40:\n        Rodney Scott, of Oklahoma, to be Commissioner of U.S. Customs and Border Protection, Department of Homeland Security\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 46. Record Vote Number: 319 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 46. Record Vote Number: 321 \n\n\n\n PN24-7:\n        Olivia Trusty, of Maryland, to be a Member of the Federal Communications Commission for a term of five years from July 1, 2025\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 45. Record Vote Number: 320","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  3:17 p.m, the Presiding Officer (Mr. Banks in the chair) declared the Senate adjourned, under its order of today, until  3:15 p.m. on Friday, June 20, 2025.","actionTimeStamp":"--"}]}