{"retrieved-date":"2023-10-2","actions-date":"Mon, 02 Oct 2023 14:09:55 -0400","actions-title":"House Floor Proceedings","actions-count":12,"actions-list":[{"index":1,"header":"The Speaker laid before the House a message from the President transmitting a notification of the designation of funding as an emergency requirement in accordance with section 114(c) of Division A of the Continuing Appropriations Act, 2024 and Other Extensions Act.","actionItem":"referred to the Committee on Appropriations and ordered to be printed (H. Doc. 118-67).","actionTimeStamp":"Mon, 02 Oct 2023 14:09:55 -0400"},{"index":2,"header":"--","actionItem":"The House received a message from the Acting Clerk. Pursuant to the permissmion granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Representatives, the Acting Clerk transmitted to the House a sealed envelope received from the White House on September 30, 2023 at 10:54 p.m. said to contain a message from the President regarding the designation of funding as an emergency requirement in H.R. 5860, the Continuing Appropriations Act, 2024, and Other Extensions Act.","actionTimeStamp":"Mon, 02 Oct 2023 14:09:45 -0400"},{"index":3,"header":"--","actionItem":"The House received a message from the Acting Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Representatives, the Acting Clerk received the following message from the Secretary of the Senate on September 30, 2023, at 9:10 p.m.: That the Senate passed H.R. 5860.","actionTimeStamp":"Mon, 02 Oct 2023 14:09:08 -0400"},{"index":4,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches.","actionTimeStamp":"Mon, 02 Oct 2023 14:03:00 -0400"},{"index":5,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Wilson of SC to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Mon, 02 Oct 2023 14:02:37 -0400"},{"index":6,"header":"SPEAKERS APPROVAL OF THE JOURNAL","actionItem":"The Chair announced that he had examined the Journal of the last day's proceedings and had approved it. Mr. Wilson (SC) demanded that the question be put on agreeing to the Speaker's approval of the Journal and by voice vote, the Chair announced that the ayes had prevailed. Mr. Wilson (SC) objected to the voice vote based upon the absence of a quorum and the Chair postponed further proceedings on the question of agreeing to the Speaker's approval of the Journal until a time to be announced.","actionTimeStamp":"Mon, 02 Oct 2023 14:02:02 -0400"},{"index":7,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Mon, 02 Oct 2023 14:00:33 -0400"},{"index":8,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of October 2.","actionTimeStamp":"Mon, 02 Oct 2023 14:00:00 -0400"},{"index":9,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 2:00 P.M. today.","actionTimeStamp":"Mon, 02 Oct 2023 12:37:50 -0400"},{"index":10,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 2 p.m. for the start of legislative business.","actionTimeStamp":"Mon, 02 Oct 2023 12:00:38 -0400"},{"index":11,"header":"--","actionItem":"The Speaker designated the Honorable Mike Bost to act as Speaker pro tempore for today.","actionTimeStamp":"Mon, 02 Oct 2023 12:00:14 -0400"},{"index":12,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Mon, 02 Oct 2023 12:00:00 -0400"}]}