{"retrieved-date":"2023-1-10","actions-date":"Mon, 09 Jan 2023 21:40:56 -0500","actions-title":"House Floor Proceedings","actions-count":50,"actions-list":[{"index":1,"header":"--","actionItem":"The House adjourned. The next meeting is scheduled for 10:00 a.m. on January 10, 2023.","actionTimeStamp":"Mon, 09 Jan 2023 21:40:56 -0500"},{"index":2,"header":"--","actionItem":"On motion to adjourn Agreed to by voice vote.","actionTimeStamp":"Mon, 09 Jan 2023 21:40:55 -0500"},{"index":3,"header":"--","actionItem":"Mr. Bean (FL) moved that the House do now adjourn.","actionTimeStamp":"Mon, 09 Jan 2023 21:40:47 -0500"},{"index":4,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with further one minute speeches.","actionTimeStamp":"Mon, 09 Jan 2023 21:30:17 -0500"},{"index":5,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Mon, 09 Jan 2023 21:27:13 -0500"},{"index":6,"header":"On passage Passed by the Yeas and Nays: 221","actionItem":"210 (Roll no. 25).","actionTimeStamp":"Mon, 09 Jan 2023 21:27:11 -0500"},{"index":7,"header":"On motion to recommit Failed by the Yeas and Nays: 208","actionItem":"221 (Roll no. 24).","actionTimeStamp":"Mon, 09 Jan 2023 21:20:07 -0500"},{"index":8,"header":"--","actionItem":"Considered as unfinished business. H.R. 23 — \"To rescind certain balances made available to the Internal Revenue Service.\"","actionTimeStamp":"Mon, 09 Jan 2023 21:01:07 -0500"},{"index":9,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of January 9.","actionTimeStamp":"Mon, 09 Jan 2023 21:00:55 -0500"},{"index":10,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is subject to the call of the Chair.","actionTimeStamp":"Mon, 09 Jan 2023 20:42:45 -0500"},{"index":11,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Kildee motion to recommit, the Chair put the question on the motion and by voice vote, announced that the nays had prevailed. Mr. Neal demanded the yeas and nays and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Mon, 09 Jan 2023 20:42:10 -0500"},{"index":12,"header":"--","actionItem":"The previous question was ordered pursuant to the rule.","actionTimeStamp":"Mon, 09 Jan 2023 20:41:42 -0500"},{"index":13,"header":"--","actionItem":"Mr. Kildee moved to recommit to the Committee on Ways and Means.","actionTimeStamp":"Mon, 09 Jan 2023 20:41:00 -0500"},{"index":14,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H.R. 23.","actionTimeStamp":"Mon, 09 Jan 2023 19:19:49 -0500"},{"index":15,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 5. H.R. 23 — \"To rescind certain balances made available to the Internal Revenue Service.\"","actionTimeStamp":"Mon, 09 Jan 2023 19:19:06 -0500"},{"index":16,"header":"The Chair announced the Speaker's policies with respect to particular aspects of the legislative process and inserted in the Congressional Record announcements concerning: first, privileges of the floor; second, introduction of bills and resolutions; third, unanimous-consent requests for the consideration of legislation; fourth, recognition for 1-minute speeches; fifth, recognition for special-order speeches; sixth, decorum in debate; seventh, conduct of votes by electronic device; eighth, use of handouts on the House floor; ninth, use of electronic equipment on the House floor; and tenth, use of the Chamber. The Chair further announced that these announcements will reiterate the origins of the stated policies and that the Chair intends to continue in the 118th Congress the policies reflected in those statements and that the policy announced in the 102nd Congress with respect to jurisdictional concepts related to clause 5(a) of rule 21","actionItem":"tax and tariff measures","actionTimeStamp":"Mon, 09 Jan 2023 19:17:30 -0500"},{"index":17,"header":"--","actionItem":"The House received a message from the Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Representatives, the Clerk notified the House that she had received the following message from the Secretary of the Senate on January 3, 2023 at 5:39 p.m.: That the Senate agreed to Informing the House of Representatives that a quorum of the Senate is assembled, S. Res. 2; and that the Senate agreed to Notifying the House of Representatives of the election of a President pro tempore, S. Res. 5.","actionTimeStamp":"Mon, 09 Jan 2023 19:17:00 -0500"},{"index":18,"header":"--","actionItem":"The House received a message from the Clerk. Under Clause 2(g) of Rule II of the Rules of the U.S. House of Representatives, the Clerk notified the House that she designated Ms. Lisa P. Grant, Deputy Clerk, Mr. Kevin F. McCumber, Deputy Clerk, Ms. Tonya Sloans, Legal Counsel, and Ms. Cheryl H. Muller, Director of Personnel to sign any and all papers and do all other acts for her under the name of the Clerk of the House which they would be authorized to do by virtue of this designation, except such as are provided by statute, in case of her temporary absence or disability. This designation shall remain in effect for the 118th Congress or until modified by the Clerk.","actionTimeStamp":"Mon, 09 Jan 2023 19:15:49 -0500"},{"index":19,"header":"SPEAKER PRO TEMPORE","actionItem":"The Speaker appointed the Honorable Patrick McHenry, the Honorable Adrian Smith (NE), the Honorable Robert Wittman, the Honorable Andy Harris, the Honorable Richard Hudson, the Honorable John Joyce (PA), and the Honorable Guy Reschenthaler to act as Speaker pro tempore to sign enrolled bills and joint resolutions through the remainder of the One Hundred Eighteenth Congress.","actionTimeStamp":"Mon, 09 Jan 2023 19:15:20 -0500"},{"index":20,"header":"--","actionItem":"The House received a communication from The Honorable Kevin McCarthy. The Speaker designated Representative Steve Scalise of Louisiana to exercise any authority regarding assembly, reassembly, convening, or reconvening of the House pursuant to H. Con. Res. 1, clause 12 of rule I, and any concurrent resolutions of the current Congress as may contemplate his designation of Members to exercise similar authority. In the event of the death or inability of that designee, the alternate Members of the House listed in the letter bearing this date that he had placed with the Clerk are designated, in turn, for the same purposes.","actionTimeStamp":"Mon, 09 Jan 2023 19:14:55 -0500"},{"index":21,"header":"--","actionItem":"The Chair announced that the Speaker has delivered to the Clerk a letter dated January 7, 2023, listing Members in the order in which each shall act as Speaker pro tempore under clause 8(b)(3) of rule I.","actionTimeStamp":"Mon, 09 Jan 2023 19:14:37 -0500"},{"index":22,"header":"House Office Building Commission","actionItem":"Pursuant to 2 U.S.C. 2001, and the order of the House of January 9, 2023, the Speaker appointed the following members of the House to the House Office Building Commission: Mr. Scalise and Mr. Jeffries.","actionTimeStamp":"Mon, 09 Jan 2023 19:14:13 -0500"},{"index":23,"header":"EXTENSION OF REMARKS","actionItem":"Mr. Scalise asked unanimous consent that during the One Hundred Eighteenth Congress, all Members may be permitted to extend their remarks and to include extraneous material within the permitted limit in that section of the record entitled Extension of Remarks. Agreed to without objection.","actionTimeStamp":"Mon, 09 Jan 2023 19:11:47 -0500"},{"index":24,"header":"APPOINTMENT AUTHORITY","actionItem":"Mr. Scalise asked unanimous consent that during the One Hundred Eighteenth Congress, the Speaker, Majority Leader, and Minority Leader be authorized to accept resignations and to make appointments authorized by law or by the House. Agreed to without objection.","actionTimeStamp":"Mon, 09 Jan 2023 19:11:37 -0500"},{"index":25,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Mon, 09 Jan 2023 19:11:24 -0500"},{"index":26,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Mon, 09 Jan 2023 19:11:18 -0500"},{"index":27,"header":"--","actionItem":"Considered as privileged matter. H. Con. Res. 1 — \"Regarding consent to assemble outside the seat of government.\"","actionTimeStamp":"Mon, 09 Jan 2023 19:10:38 -0500"},{"index":28,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Mon, 09 Jan 2023 19:10:35 -0500"},{"index":29,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Mon, 09 Jan 2023 19:10:31 -0500"},{"index":30,"header":"--","actionItem":"Considered as privileged matter. H. Res. 6 — \"Fixing the daily hour of meeting of the First Session of the One Hundred Eighteenth Congress.\"","actionTimeStamp":"Mon, 09 Jan 2023 19:10:02 -0500"},{"index":31,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Mon, 09 Jan 2023 19:08:51 -0500"},{"index":32,"header":"On agreeing to the resolution Agreed to by the Yeas and Nays: 220","actionItem":"213 (Roll no. 23).","actionTimeStamp":"Mon, 09 Jan 2023 19:08:48 -0500"},{"index":33,"header":"On motion to commit Failed by the Yeas and Nays: 210","actionItem":"220 (Roll no. 22).","actionTimeStamp":"Mon, 09 Jan 2023 18:59:18 -0500"},{"index":34,"header":"--","actionItem":"The previous question on the motion to commit was ordered without objection.","actionTimeStamp":"Mon, 09 Jan 2023 18:53:11 -0500"},{"index":35,"header":"--","actionItem":"Ms. DeLauro moved to commit the resolution to a select committee composed of the Majority Leader and Minority Leader with instructions to report the same back to the House forthwith with an amendment.","actionTimeStamp":"Mon, 09 Jan 2023 18:52:32 -0500"},{"index":36,"header":"On ordering the previous question Agreed to by the Yeas and Nays: 211","actionItem":"205 (Roll no. 21).","actionTimeStamp":"Mon, 09 Jan 2023 18:52:25 -0500"},{"index":37,"header":"--","actionItem":"Considered as unfinished business. H. Res. 5 — \"Adopting the Rules of the House of Representatives for the One Hundred Eighteenth Congress, and for other purposes.\"","actionTimeStamp":"Mon, 09 Jan 2023 18:30:39 -0500"},{"index":38,"header":"UNFINISHED BUSINESS","actionItem":"The Chair announced that the unfinished business was the question on ordering the previous question to H. Res. 5, which had been debated earlier and on which further proceedings had been postponed.","actionTimeStamp":"Mon, 09 Jan 2023 18:30:24 -0500"},{"index":39,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of January 9.","actionTimeStamp":"Mon, 09 Jan 2023 18:30:23 -0500"},{"index":40,"header":"--","actionItem":"The House agreed to recess by unanimous consent. The next meeting is scheduled for  6:30 P.M. today.","actionTimeStamp":"Mon, 09 Jan 2023 18:20:48 -0500"},{"index":41,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on H. Res. 5, the Chair put the question on ordering the previous question on the resolution and by voice vote, announced that the ayes had prevailed. Mr. McGovern demanded the yeas and nays and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Mon, 09 Jan 2023 18:20:12 -0500"},{"index":42,"header":"DEBATE","actionItem":"The House resumed debate on H. Res. 5.","actionTimeStamp":"Mon, 09 Jan 2023 18:10:10 -0500"},{"index":43,"header":"ORDER OF PROCEDURE","actionItem":"Mr. Cole asked unanimous consent that the Chair may reduce to 5 minutes the minimum time for electronic voting on any question relating to H. Res. 5 that follows a 15 minute vote. Agreed to without objection.","actionTimeStamp":"Mon, 09 Jan 2023 18:06:16 -0500"},{"index":44,"header":"ORDER OF PROCEDURE","actionItem":"Mr. Cole asked unanimous consent that the Speaker be authorized to postpone the vote on ordering the previous queston on H. Res. 5 to a designated time later today. Agreed to without objection.","actionTimeStamp":"Mon, 09 Jan 2023 18:05:25 -0500"},{"index":45,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 5.","actionTimeStamp":"Mon, 09 Jan 2023 17:07:00 -0500"},{"index":46,"header":"--","actionItem":"Considered as privileged matter. H. Res. 5 — \"Adopting the Rules of the House of Representatives for the One Hundred Eighteenth Congress, and for other purposes.\"","actionTimeStamp":"Mon, 09 Jan 2023 17:06:27 -0500"},{"index":47,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Wilson of SC to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Mon, 09 Jan 2023 17:01:58 -0500"},{"index":48,"header":"--","actionItem":"The Speaker announced approval of the Journal.","actionTimeStamp":"Mon, 09 Jan 2023 17:01:38 -0500"},{"index":49,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Mon, 09 Jan 2023 17:00:17 -0500"},{"index":50,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Mon, 09 Jan 2023 17:00:00 -0500"}]}