{"retrieved-date":"2026-1-7","actions-date":"Tuesday, January 6, 2026","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, January  6)","actionItem":"H.R. 224 (Rep. De La Cruz):\n        A bill to amend section 102(a)(20) of the Housing and Community Development Act of 1974 to require the exclusion of service-connected disability compensation when determining whether a person is a person of low and moderate income, a person of low income, or a person of moderate income, and for other purposes.\n\n        -- Senate Committee on Banking, Housing, and Urban Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 575 (Sen. Lankford):\n        A resolution congratulating the Oklahoma State University men's cross country team for winning the 2025 National Collegiate Athletic Association Men's Division I Cross Country National Championship.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, January  6)","actionItem":"PN373:\n        Sara Bailey, of Texas, to be Director of National Drug Control Policy\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 48. Record Vote Number: 3 \n\n\n\n PN499-11:\n        Joshua Simmons, of Virginia, to be General Counsel of the Central Intelligence Agency\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 47. Record Vote Number: 2 \n\n\n\n PN609:\n        Lt. Gen. Christopher C. LaNeve, in the Army, to be General\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  7:32 p.m, the Presiding Officer (Mr. Curtis in the chair) declared the Senate adjourned, under its order of today, until 11:15 a.m. tomorrow.","actionTimeStamp":"--"}]}