{"retrieved-date":"2025-3-27","actions-date":"Wednesday, March 26, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, March 26)","actionItem":"H.J.Res. 25 (Rep. Carey):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Internal Revenue Service relating to \"Gross Proceeds Reporting by Brokers That Regularly Provide Services Effectuating Digital Asset Sales\".\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 70 - 28. Record Vote Number: 150 \n\n\n        -- Measure laid before Senate by motion.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 70 - 28. Record Vote Number: 151 \n\n\n\n S.J.Res. 18 (Sen. Scott, of SC):\n        A joint resolution disapproving the rule submitted by the Bureau of Consumer Financial Protection relating to \"Overdraft Lending: Very Large Financial Institutions\".\n\n        -- Senate Committee on Banking, Housing, and Urban Affairs discharged, by petition, pursuant to 5 U.S.C. 802(c).\n\n        -- Placed on Senate Legislative Calendar under General Orders. Calendar No. 34 \n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 52 - 47. Record Vote Number: 152 \n\n\n        -- Measure laid before Senate by motion.\n\n\n S.Res. 120 (Sen. Duckworth):\n        A resolution recognizing Girl Scouts of the United States of America on its 113th birthday and celebrating its founder, Juliette Gordon Low, and the legacy of providing girls with a secure and inclusive space where they can explore their world, build meaningful relationships, and have access to experiences that prepare them for a life of leadership.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 140 (Sen. Merkley):\n        A resolution designating the first week of April 2025 as \"National Asbestos Awareness Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 141 (Sen. Booker):\n        A resolution recognizing the 204th anniversary of the independence of Greece and celebrating democracy in Greece and the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 142 (Sen. Murkowski):\n        A resolution recognizing the heritage, culture, and contributions of American Indian, Alaska Native, and Native Hawaiian women in the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, March 26)","actionItem":"PN12-3:\n        James Bishop, of North Carolina, to be Deputy Director of the Office of Management and Budget\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 45. Record Vote Number: 145 \n\n\n\n PN12-15:\n        Michael Faulkender, of Maryland, to be Deputy Secretary of the Treasury\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 46. Record Vote Number: 148 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 43. Record Vote Number: 149 \n\n\n\n PN12-37:\n        Aaron Reitz, of Texas, to be an Assistant Attorney General vice Hampton Y. Dellinger\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 45. Record Vote Number: 146 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 46. Record Vote Number: 147","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  9:12 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}