{"retrieved-date":"2023-4-20","actions-date":"Thu, 20 Apr 2023 09:15:47 -0400","actions-title":"House Floor Proceedings","actions-count":10,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 298, the Committee of the Whole proceeded with 10 minutes of debate on the Mace amendment No. 1.","actionTimeStamp":"Thu, 20 Apr 2023 09:15:47 -0400"},{"index":2,"header":"--","actionItem":"An amendment, offered by Ms. Mace,  numbered 1 printed in House Report 118-37 to require the Comptroller General carry out a study to determine the meaning of the phrase 'any other benefit' as used in subsection (d)(3) by looking at the adverse psychological, developmental, participatory, and sociological results to girls of allowing males to compete, be members of a sports team, or participants in athletic programs, that are designed for girls, including hostile environment creation, sexual assault, and sexual harassment.","actionTimeStamp":"Thu, 20 Apr 2023 09:14:46 -0400"},{"index":3,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Thu, 20 Apr 2023 09:12:55 -0400"},{"index":4,"header":"--","actionItem":"Considered as unfinished business. H.R. 734 — \"To amend the Education Amendments of 1972 to provide that for purposes of determining compliance with title IX of such Act in athletics, sex shall be recognized based solely on a person's reproductive biology and genetics at birth.\"","actionTimeStamp":"Thu, 20 Apr 2023 09:12:39 -0400"},{"index":5,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair, would be limited to 5 per side of the aisle.","actionTimeStamp":"Thu, 20 Apr 2023 09:02:37 -0400"},{"index":6,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Ogles to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 20 Apr 2023 09:02:19 -0400"},{"index":7,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Thu, 20 Apr 2023 09:02:14 -0400"},{"index":8,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Thu, 20 Apr 2023 09:00:36 -0400"},{"index":9,"header":"--","actionItem":"The Speaker designated the Honorable Mike Flood to act as Speaker pro tempore for today.","actionTimeStamp":"Thu, 20 Apr 2023 09:00:09 -0400"},{"index":10,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 20 Apr 2023 09:00:00 -0400"}]}