{"retrieved-date":"2025-10-13","actions-date":"Thursday, October 9, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, October  9)","actionItem":"H.R. 5371 (Rep. Cole):\n        A bill making continuing appropriations and extensions for fiscal year 2026, and for other purposes .\n\n        -- Third cloture motion on the motion to proceed to the measure not invoked in Senate by Yea-Nay Vote. 54 - 45. Record Vote Number: 558 \n\n\n        -- Motion by Senator Thune to reconsider, under the order of 10/9/2025, not having voted on the prevailing side, the vote by which the third cloture motion on the motion to proceed to H.R. 5371 was not invoked (Record Vote No. 558) entered in Senate.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Fourth cloture motion on the motion to proceed to the measure presented in Senate.\n\n\n H.J.Res. 106 (Rep. Begich):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Bureau of Land Management relating to \"Central Yukon Record of Decision and Approved Resource Management Plan\" .\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 50 - 47. Record Vote Number: 559 \n\n\n        -- Measure laid before Senate by motion.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 50 - 46. Record Vote Number: 560 \n\n\n\n S. 1440 (Sen. Duckworth):\n        A bill to amend title II of the Public Health Service Act to include as an additional right or privilege of commissioned officers of the Public Health Service (and their beneficiaries) certain leave provided under title 10, United States Code to commissioned officers of the Army (or their beneficiaries).\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 1728 (Sen. Cassidy):\n        A bill to amend the Employee Retirement Income Security Act of 1974 to expand the membership of the Advisory Council on Employee Welfare and Pension Benefit Plans to include representatives of employee ownership organizations.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 2283 (Sen. Lankford):\n        A bill to designate the facility of the United States Postal Service located at 201 West Oklahoma Avenue in Guthrie, Oklahoma, as the \"Oscar J. Upham Post Office\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 2296 (Sen. Wicker):\n        An original bill to authorize appropriations for fiscal year 2026 for military activities of the Department of Defense, for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\n\n        -- Considered by Senate.\n\n        -- Motion by Senator Thune to recommit to Senate Committee on Armed Services with instructions to report back forthwith with the following amendment (SA 3866) withdrawn in Senate.\n\n        -- Passed Senate under the order of 10/9/2025, having achieved 60 votes in the affirmative, with an amendment by Yea-Nay Vote. 77 - 20. Record Vote Number: 570 \n\n \n\n S.Amdt. 2928 (Sen. Hassan):\n        To make certain spouses eligible for services under the disabled veterans' outreach program.\n\n        --Amendment SA 2928 proposed by Senator Wicker for Senator Hassan to Amendment SA 3748.\n\n        --Amendment SA 2928 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 2952 (Sen. Warnock):\n        To require the Secretary of Defense to implement recommendations of the Comptroller General of the United States relating to critical military housing supply and affordability.\n\n        --Amendment SA 2952 proposed by Senator Wicker for Senator Warnock to Amendment SA 3748.\n\n        --Amendment SA 2952 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 2971 (Sen. Ossoff):\n        To direct the Office for Victims of Crime of the Department of Justice to continue implementing the anti-trafficking recommendations of the Government Accountability Office and to report to Congress regarding such implementation.\n\n        --Amendment SA 2971 proposed by Senator Wicker for Senator Ossoff to Amendment SA 3748.\n\n        --Amendment SA 2971 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 2979 (Sen. Hirono):\n        To exempt children of certain Filipino World War II veterans from the numerical limitations on immigrant visas .\n\n        --Amendment SA 2979 proposed by Senator Wicker for Senator Hirono to Amendment SA 3748.\n\n        --Amendment SA 2979 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3015 (Sen. Hirono):\n        To require the Secretary of Defense to conduct a feasibility study on the removal of oil from sunken World War II vessels in waters near the Federated States of Micronesia and the Republic of Palau .\n\n        --Amendment SA 3015 proposed by Senator Wicker for Senator Hirono to Amendment SA 3748.\n\n        --Amendment SA 3015 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3039 (Sen. Kaine):\n        To authorize the Administrator of the National Aeronautics and Space Administration to reimburse the Town of Chincoteague, Virginia, for costs directly associated with the removal and replacement of certain drinking water wells.\n\n        --Amendment SA 3039 proposed by Senator Wicker for Senator Kaine to Amendment SA 3748.\n\n        --Amendment SA 3039 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3109 (Sen. Schumer):\n        To prohibit the use of funds to procure or modify foreign aircraft for presidential airlift.\n\n        --Amendment SA 3109 proposed by Senator Schumer to Amendment SA 3748.\n\n        --Amendment SA 3109, under the order of 10/9/2025, not having achieved 60 votes in the affirmative, not agreed to in Senate by Yea-Nay Vote. 46 - 50. Record Vote Number: \n\n\n S.Amdt. 3136 (Sen. Gallego):\n        To require a report on the feasibility of implementing artificial intelligence into anti-money laundering investigations relating to activity by foreign terrorist organizations, drug cartels, and other transnational criminal organizations .\n\n        --Amendment SA 3136 proposed by Senator Wicker for Senator Gallego to Amendment SA 3748.\n\n        --Amendment SA 3136 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3156 (Sen. Duckworth):\n        To include as an additional right or privilege of commissioned officers of the Public Health Service (and their beneficiaries) certain leave provided under title 10, United States Code, to commissioned officers of the Army (or their beneficiaries) .\n\n        --Amendment SA 3156 proposed by Senator Wicker for Senator Duckworth to Amendment SA 3748.\n\n        --Amendment SA 3156 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3210 (Sen. Duckworth):\n        To limit the provision of support by the Armed Forces to civilian law enforcement activities.\n\n        --Amendment SA 3210 proposed by Senator Duckworth to Amendment SA 3748.\n\n        --Amendment SA 3210, under the order of 10/9/2025, not having achieved 60 votes in the affirmative, not agreed to in Senate by Yea-Nay Vote. 46 - 52. Record Vote Number: \n\n\n S.Amdt. 3213 (Sen. Marshall):\n        To prohibit the flying, draping, or other display of any flag other than the flag of the United States at covered public buildings.\n\n        --Amendment SA 3213 proposed by Senator Marshall to Amendment SA 3748.\n\n        --Amendment SA 3213 not agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3272 (Sen. Grassley):\n        To support law enforcement agencies and crime victims.\n\n        --Amendment SA 3272 proposed by Senator Wicker for Senator Grassley to Amendment SA 3748.\n\n        --Amendment SA 3272 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3274 (Sen. Cruz):\n        To extend the prohibition on certain reductions to B-1 bomber aircraft squadrons.\n\n        --Amendment SA 3274 proposed by Senator Cornyn for Senator Cruz to Amendment SA 3748.\n\n        --Amendment SA 3274 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3288 (Sen. Lee):\n        To address the treatment of funds received by National Guard Bureau as reimbursement from States.\n\n        --Amendment SA 3288 proposed by Senator Lee to Amendment SA 3748.\n\n        --Amendment SA 3288 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3337 (Sen. Kaine):\n        To repeal the authorizations for use of military force against Iraq.\n\n        --Amendment SA 3337 proposed by Senator Young for Senator Kaine to Amendment SA 3748.\n\n        --Amendment SA 3337 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3340 (Sen. Scott, of SC):\n        To require the Committee on Foreign Investment in the United States to annually review, update, and report on the facilities and property of the United States Government determined to be national security sensitive for purposes of review of real estate transactions under section 721 of the Defense Production Act of 1950.\n\n        --Amendment SA 3340 proposed by Senator Wicker for Senator Scott SC to Amendment SA 3748.\n\n        --Amendment SA 3340 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3351 (Sen. Shaheen):\n        To authorize grants to implement school-community partnerships for preventing substance use and misuse among youth .\n\n        --Amendment SA 3351 proposed by Senator Wicker for Senator Shaheen to Amendment SA 3748.\n\n        --Amendment SA 3351 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3355 (Sen. Grassley):\n        To expand the authority of the Marshal of the Supreme Court and the Supreme Court Police to protect retired and former Chief Justices and Associate Justices of the Supreme Court of the United States.\n\n        --Amendment SA 3355 proposed by Senator Wicker for Senator Grassley to Amendment SA 3748.\n\n        --Amendment SA 3355 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3376 (Sen. McCormick):\n        To require a strategy for United States security assistance to Mexico.\n\n        --Amendment SA 3376 proposed by Senator Wicker for Senator McCormick to Amendment SA 3748.\n\n        --Amendment SA 3376 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3405 (Sen. Cornyn):\n        To require a plan to modernize the nuclear security enterprise.\n\n        --Amendment SA 3405 proposed by Senator Wicker for Senator Cornyn to Amendment SA 3748.\n\n        --Amendment SA 3405 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3427 (Sen. Ernst):\n        To require the Comptroller General of the United States to conduct a study on casualty assistance and long-term care programs.\n\n        --Considered by Senate.\n\n        --Amendment SA 3427 agreed to in Senate by Unanimous Consent.\n\n\n S.Amdt. 3435 (Sen. Capito):\n        To reauthorize the Second Chance Act of 2007 .\n\n        --Amendment SA 3435 proposed by Senator Wicker for Senator Capito to Amendment SA 3748.\n\n        --Amendment SA 3435 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3439 (Sen. Lankford):\n        To prohibit certain reductions to the inventory of E-3 airborne warning and control system aircraft.\n\n        --Amendment SA 3439 proposed by Senator Wicker for Senator Lankford to Amendment SA 3748.\n\n        --Amendment SA 3439 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3489 (Sen. Blackburn):\n        To direct the Secretary of Commerce, acting through the Assistant Secretary of Commerce for Communications and Information, to conduct a study of the national security risks posed by consumer routers, modems, and devices that combine a modem and router, and for other purposes.\n\n        --Amendment SA 3489 proposed by Senator Wicker for Senator Blackburn to Amendment SA 3748.\n\n        --Amendment SA 3489 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3530 (Sen. Booker):\n        To provide for fairness in the issuance of tactical equipment to Diplomatic Security Service personnel .\n\n        --Amendment SA 3530 proposed by Senator Wicker for Senator Booker to Amendment SA 3748.\n\n        --Amendment SA 3530 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3535 (Sen. Scott, of FL):\n        To require Presidential appointment and Senate confirmation of the Inspector General of the Board of Governors of the Federal Reserve System and the Bureau of Consumer Financial Protection .\n\n        --Amendment SA 3535 proposed by Senator Scott FL to Amendment SA 3748.\n\n        --Amendment SA 3535, under the order of 10/9/2025, not having achieved 60 votes in the affirmative, not agreed to in Senate by Yea-Nay Vote. 53 - 43. Record Vote Number: \n\n\n S.Amdt. 3557 (Sen. Slotkin):\n        To require the Inspector General of the Department of Defense to conduct an audit of foreign exposure from Department of Defense cloud computing contracts and to require the Secretary of Defense to update guidance to reduce, mitigate, or eliminate risk .\n\n        --Amendment SA 3557 proposed by Senator Wicker for Senator Slotkin to Amendment SA 3748.\n\n        --Amendment SA 3557 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3570 (Sen. Peters):\n        To establish the Commercial Space Activity Advisory Committee.\n\n        --Amendment SA 3570 proposed by Senator Wicker for Senator Peters to Amendment SA 3748.\n\n        --Amendment SA 3570 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3601 (Sen. Hickenlooper):\n        To clarify limitations applicable to the authority to transfer functions of the Air National Guard to the Space Force .\n\n        --Amendment SA 3601 proposed by Senator Wicker for Senator Hickenlooper to Amendment SA 3748.\n\n        --Amendment SA 3601 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3697 (Sen. Curtis):\n        To require a review of the methodologies used to determine the amounts of locality-based comparability payments and to require the President's Pay Agent to conduct a pilot program establishing alternative models for determining the amounts of those payments .\n\n        --Amendment SA 3697 proposed by Senator Curtis to Amendment SA 3748.\n\n        --Amendment SA 3697, under the order of 10/9/2025, not having achieved 60 votes in the affirmative, not agreed to in Senate by Yea-Nay Vote. 51 - 46. Record Vote Number: \n\n\n S.Amdt. 3702 (Sen. Kennedy):\n        To improve coordination between Federal and State agencies and the Do Not Pay working system.\n\n        --Amendment SA 3702 proposed by Senator Wicker for Senator Kennedy to Amendment SA 3748.\n\n        --Amendment SA 3702 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3703 (Sen. Kennedy):\n        To address disclosures by directors, officers, and principal stockholders of foreign private issuers.\n\n        --Amendment SA 3703 proposed by Senator Wicker for Senator Kennedy to Amendment SA 3748.\n\n        --Amendment SA 3703 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3712 (Sen. Coons):\n        To allow the Secretary of the Interior to enter into memoranda of understanding for the purpose of scientific and technical cooperation in the mapping of critical minerals and rare earth elements .\n\n        --Amendment SA 3712 proposed by Senator Wicker for Senator Coons to Amendment SA 3748.\n\n        --Amendment SA 3712 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3724 (Sen. Cortez Masto):\n        To require that additional factors be included in the design of counseling pathways under the Transition Assistance Program of the Department of Defense.\n\n        --Amendment SA 3724 proposed by Senator Wicker for Senator Cortez Masto to Amendment SA 3748.\n\n        --Amendment SA 3724 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3728 (Sen. Coons):\n        To require the executive branch to develop a whole-of-government strategy to disrupt growing cooperation among the People's Republic of China, the Russian Federation, the Islamic Republic of Iran, and the Democratic People's Republic of Korea, which are the foremost adversaries of the United States, and mitigate the risks posed to the United States.\n\n        --Amendment SA 3728 proposed by Senator Wicker for Senator Coons to Amendment SA 3748.\n\n        --Amendment SA 3728 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3732 (Sen. Daines):\n        To improve the bill.\n\n        --Amendment SA 3732 proposed by Senator Wicker for Senator Daines to Amendment SA 3748.\n\n        --Amendment SA 3732 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3742 (Sen. Cruz):\n        No Statement of Purpose on File .\n\n        --Amendment SA 3742 proposed by Senator Wicker for Senator Cruz to Amendment SA 3748.\n\n        --Amendment SA 3742 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3748 (Sen. Wicker):\n        In the nature of a substitute.\n\n        --Considered by Senate.\n\n        --Amendment SA 3748, as modified, as amended, agreed to in Senate by Unanimous Consent.\n\n\n S.Amdt. 3751 (Sen. Klobuchar):\n        To improve the safety and security of Members of Congress, immediate family members of Members of Congress, and congressional staff.\n\n        --Amendment SA 3751 proposed by Senator Wicker for Senator Klobuchar to Amendment SA 3748.\n\n        --Amendment SA 3751 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3753 (Sen. Peters):\n        To improve coordination of Federal efforts to identify and mitigate health and national security risks through a monitoring system to map essential medicine supply chains using data analytics.\n\n        --Amendment SA 3753 proposed by Senator Wicker for Senator Peters to Amendment SA 3748.\n\n        --Amendment SA 3753 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3759 (Sen. Cotton):\n        To modify the authority to protect certain facilities and assets of the United States from incursions .\n\n        --Amendment SA 3759 proposed by Senator Gillibrand for Senator Cotton to Amendment SA 3748.\n\n        --Amendment SA 3759 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3761 (Sen. Paul):\n        To prohibit earnings on balances maintained at a Federal Reserve bank by or on behalf of a depository institution .\n\n        --Amendment SA 3761 proposed by Senator Paul to Amendment SA 3748.\n\n        --Amendment SA 3761, under the order of 10/9/2025, not having achieved 60 votes in the affirmative, not agreed to in Senate by Yea-Nay Vote. 14 - 83. Record Vote Number: \n\n\n S.Amdt. 3788 (Sen. Ricketts):\n        To make improvements to the AUKUS partnership .\n\n        --Amendment SA 3788 proposed by Senator Wicker for Senator Ricketts to Amendment SA 3748.\n\n        --Amendment SA 3788 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3799 (Sen. Hawley):\n        To establish requirements and prohibitions relating to the provision of health care services at Fort Leonard Wood, Missouri.\n\n        --Amendment SA 3799 proposed by Senator Wicker for Senator Hawley to Amendment SA 3748.\n\n        --Amendment SA 3799 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3810 (Sen. Rounds):\n        To require the Committee on Foreign Investment in the United States to review and prohibit certain transactions relating to agriculture.\n\n        --Amendment SA 3810 proposed by Senator Wicker for Senator Rounds to Amendment SA 3748.\n\n        --Amendment SA 3810 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3811 (Sen. Tillis):\n        To strengthen relations between the United States and the countries in the Western Balkans, and for other purposes .\n\n        --Amendment SA 3811 proposed by Senator Wicker for Senator Tillis to Amendment SA 3748.\n\n        --Amendment SA 3811 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3813 (Sen. Moran):\n        To require the provision of certain services to veterans in the Freely Associated States.\n\n        --Amendment SA 3813 proposed by Senator Wicker for Senator Moran to Amendment SA 3748.\n\n        --Amendment SA 3813 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3814 (Sen. Moran):\n        To improve the availability of care for veterans from facilities and providers of the Department of Defense .\n\n        --Amendment SA 3814 proposed by Senator Moran to Amendment SA 3748.\n\n        --Amendment SA 3814 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3818 (Sen. Klobuchar):\n        To enhance United States support for identifying and recovering Ukrainian children who were abducted by the Russian Federation, and to hold accountable those who are responsible for such abductions.\n\n        --Amendment SA 3818 proposed by Senator Wicker for Senator Klobuchar to Amendment SA 3748.\n\n        --Amendment SA 3818 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3819 (Sen. Shaheen):\n        To provide for certain authorities of the Department of State, and for other purposes.\n\n        --Amendment SA 3819 proposed by Senator Wicker for Senator Shaheen to Amendment SA 3748.\n\n        --Amendment SA 3819 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3823 (Sen. Grassley):\n        To modify the requirements for transfers of United States defense articles and defense services among the Baltic states .\n\n        --Amendment SA 3823 proposed by Senator Wicker for Senator Grassley to Amendment SA 3748.\n\n        --Amendment SA 3823 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3825 (Sen. Durbin):\n        To authorize the establishment of a Baltic Security Initiative for the purpose of strengthening the defensive capabilities of the Baltic countries.\n\n        --Amendment SA 3825 proposed by Senator Wicker for Senator Durbin to Amendment SA 3748.\n\n        --Amendment SA 3825 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3826 (Sen. Shaheen):\n        To modify and reauthorize the Better Utilization of Investments Leading to Development Act of 2018.\n\n        --Amendment SA 3826 proposed by Senator Wicker for Senator Shaheen to Amendment SA 3748.\n\n        --Amendment SA 3826 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3834 (Sen. Padilla):\n        To amend the Federal Credit Union Act to provide for certain ways in which credit unions may be Agent members of the National Credit Union Administration Central Liquidity Facility .\n\n        --Amendment SA 3834 proposed by Senator Wicker for Senator Padilla to Amendment SA 3748.\n\n        --Amendment SA 3834 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3841 (Sen. Hagerty):\n        To prohibit contracting with certain biotechnology providers.\n\n        --Amendment SA 3841 proposed by Senator Hagerty to Amendment SA 3748.\n\n        --Amendment SA 3841 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3842 (Sen. Fischer):\n        To establish a military-civilian medical surge program.\n\n        --Amendment SA 3842 proposed by Senator Wicker for Senator Fischer to Amendment SA 3748.\n\n        --Amendment SA 3842 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3853 (Sen. Sanders):\n        To reduce the bloated Pentagon budget by 10 percent and instead expand veteran dental care at the Department of Veterans Affairs.\n\n        --Amendment SA 3853 proposed by Senator Sanders to Amendment SA 3748.\n\n        --Amendment SA 3853, under the order of 10/9/2025, not having achieved 60 votes in the affirmative, not agreed to in Senate by Yea-Nay Vote. 10 - 88. Record Vote Number: \n\n\n S.Amdt. 3863 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n        --Proposed amendment SA 3863 withdrawn in Senate.\n\n\n S.Amdt. 3864 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n        --Proposed amendment SA 3864 to language proposed to be stricken by SA 3748 withdrawn in Senate.\n\n\n S.Amdt. 3865 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n        --SA 3865 fell when SA 3864 to language proposed to be stricken by SA 3748 withdrawn.\n\n\n S.Amdt. 3866 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n        --Proposed amendment SA 3866 (the instructions of the motion to recommit) withdrawn in Senate.\n\n\n S.Amdt. 3867 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n        --SA 3867 fell when SA 3866 (the instructions of the motion to recommit) withdrawn.\n\n\n S.Amdt. 3868 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate.\n\n        --SA 3868 fell when SA 3867 fell.\n\n\n S.Amdt. 3872 (Sen. Van Hollen):\n        To amend title 32, United States Code, to clarify certain limitations on full-time National Guard duty performed in a State, Territory, or the District of Columbia.\n\n        --Amendment SA 3872 proposed by Senator Van Hollen to Amendment SA 3748.\n\n        --Amendment SA 3872, under the order of 10/9/2025, not having achieved 60 votes in the affirmative, not agreed to in Senate by Yea-Nay Vote. 47 - 50. Record Vote Number: \n\n\n S.Amdt. 3880 (Sen. Collins):\n        To require a report on the United States boot industrial base and Berry Amendment compliance.\n\n        --Amendment SA 3880 proposed by Senator Wicker for Senator Collins to Amendment SA 3748.\n\n        --Amendment SA 3880 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3888 (Sen. Sullivan):\n        To combat illegal, unreported, and unregulated fishing at its sources globally.\n\n        --Amendment SA 3888 proposed by Senator Wicker for Senator Sullivan to Amendment SA 3748.\n\n        --Amendment SA 3888 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3890 (Sen. Cruz):\n        To establish the SkyFoundry Program .\n\n        --Amendment SA 3890 proposed by Senator Wicker for Senator Cruz to Amendment SA 3748.\n\n        --Amendment SA 3890 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3899 (Sen. Graham):\n        To require the President or his designee to certify whether the Government of Syria is meeting certain conditions following repeal of the Caesar Syria Civilian Protection Act of 2019 .\n\n        --Amendment SA 3899 proposed by Senator Wicker for Senator Graham to Amendment SA 3748.\n\n        --Amendment SA 3899 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3901 (Sen. Scott, of SC):\n        To increase the supply of affordable housing in America.\n\n        --Amendment SA 3901 proposed by Senator Wicker for Senator Scott SC to Amendment SA 3748.\n\n        --Amendment SA 3901 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3926 (Sen. Cornyn):\n        To protect the national security of the United States by imposing sanctions with respect to certain persons of the People's Republic of China and prohibiting and requiring notifications with respect to certain investments by United States persons in the People's Republic of China.\n\n        --Amendment SA 3926 proposed by Senator Cornyn to Amendment SA 3748.\n\n        --Amendment SA 3926 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 3927 (Sen. Merkley):\n        To limit the use of Federal law enforcement officers for crowd control, and for other purposes.\n\n        --Amendment SA 3927 proposed by Senator Merkley to Amendment SA 3748.\n\n        --Amendment SA 3927, under the order of 10/9/2025, not having achieved 60 votes in the affirmative, not agreed to in Senate by Yea-Nay Vote. 47 - 50. Record Vote Number: \n\n\n S.Amdt. 3928 (Sen. Gallego):\n        To require the Secretary of Defense to establish a pilot program for deploying microreactors.\n\n        --Amendment SA 3928 proposed by Senator Wicker for Senator Gallego to Amendment SA 3748.\n\n        --Amendment SA 3928 agreed to in Senate by Voice Vote.\n\n\n\n\n S. 2403 (Sen. Marshall):\n        A bill to amend the Employee Retirement Income Security Act of 1974 to provide a clear definition of adequate consideration for certain closely held stock, and for other purposes .\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 2882 (Sen. Murray):\n        A bill making continuing appropriations for the fiscal year ending September 30, 2026, and for other purposes .\n\n        -- Third cloture motion on the motion to proceed to the measure not invoked in Senate by Yea-Nay Vote. 47 - 50. Record Vote Number: 557 \n\n\n        -- Motion by Senator Schumer to reconsider, under the order of 10/9/2025, not having voted on the prevailing side, the vote by which the third cloture motion on the motion to proceed to S. 2882 was not invoked (Record Vote No. 557) entered in Senate.\n\n\n S.Res. 337 (Sen. Peters):\n        A resolution recognizing the 250th anniversary of the postal service of the United States.\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 446 (Sen. Wicker):\n        A resolution recognizing the 250th birthday of the United States Navy.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 447 (Sen. Hyde-Smith):\n        A resolution designating September 25, 2025, as \"National Ataxia Awareness Day\", and raising awareness of ataxia, ataxia research, and the search for a cure.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 448 (Sen. Shaheen):\n        A resolution designating October 1, 2025, as \"Energy Efficiency Day\" in celebration of the economic and environmental benefits that have been driven by private sector innovation and Federal energy efficiency policies.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, October  9)","actionItem":"PN466-4:\n        Jennifer Lee Mascott, of Delaware, to be United States Circuit Judge for the Third Circuit\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 47. Record Vote Number: 561","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Hoeven, at  9:37 p.m., the Senate adjourned, under its order of today, until 11:30 a.m. tomorrow.","actionTimeStamp":"--"}]}