{"retrieved-date":"2024-5-29","actions-date":"Thursday, May 23, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, May 23)","actionItem":"H.R. 2365 (Rep. Bilirakis):\n        To direct the Secretary of Health and Human Services to carry out a national project to prevent, diagnose, treat, and cure Parkinson's, to be known as the National Parkinson's Project, and for other purposes.\n\n        -- Senate Committee on Health, Education, Labor, and Pensions discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n S. 138 (Sen. Merkley):\n        A bill to amend the Tibetan Policy Act of 2002 to modify certain provisions of that Act.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 4361 (Sen. Murphy):\n        A bill making emergency supplemental appropriations for border security and combatting fentanyl for the fiscal year ending September 30, 2024, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture on the motion to proceed to the measure not invoked in Senate by Yea-Nay Vote. 43 - 50. Record Vote Number: 182 \n\n\n\n S.Res. 706 (Sen. Grassley):\n        A resolution recognizing National Foster Care Month as an opportunity to raise awareness about the challenges of children in the foster care system, and encouraging Congress to implement policies to improve the lives of children in the foster care system.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 707 (Sen. Scott, of FL):\n        A resolution recognizing the significance of Jewish American Heritage Month as a time to celebrate the contributions of Jewish Americans to the society and culture of the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 708 (Sen. Heinrich):\n        A resolution commemorating the 100th anniversary of the designation of the Gila Wilderness.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 712 (Sen. Kelly):\n        A resolution designating May 2024 as \"Older Americans Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, May 23)","actionItem":"PN1171:\n        Anthony K. Onitsuka, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1212:\n        Melissa Griffin Dalton, of Virginia, to be Under Secretary of the Air Force\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 56 - 39. Record Vote Number: 181 \n\n\n\n PN1272:\n        Ronald J. Grimley, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1281:\n        38 nominations in the Marine Corps beginning with Shawn E. Anderson and ending with Joseph J. Zwiller\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1282:\n        Stephanie K. Hayes, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1285:\n        Benjamin C. Waite, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1286:\n        Benjamin D. Fitzharris, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1307:\n        3 nominations in the Marine Corps beginning with Robert W. Brooks III and ending with Ramon R. Ramirez, Jr.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1310:\n        Glen R. Pond, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1321:\n        Matthew T. Migliori, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1328:\n        Claudia L. Battle, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1343:\n        Stephanie Sanders Sullivan, of Maryland, to be Representative of the United States of America to the African Union, with the rank and status of Ambassador\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN1350:\n        Tanya Monique Jones Bosier, of the District of Columbia, to be an Associate Judge of the Superior Court of the District of Columbia for the term of fifteen years\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN1354:\n        Judith E. Pipe, of the District of Columbia, to be an Associate Judge of the Superior Court of the District of Columbia for the term of fifteen years\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN1391:\n        Daniel A. Hancock, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1392:\n        James L. Clark III, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1416:\n        Debra L. Sims, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1417:\n        Peter S. Joo, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1444:\n        Capt. Lia M. Reynolds, in the Navy, to be Rear Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1489:\n        William Selde, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1529:\n        Edward L. Gungon, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1569:\n        Christopher T. Hanson, of Michigan, to be a Member of the Nuclear Regulatory Commission for the term of five years expiring June 30, 2029\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- By unanimous consent agreement, debate 6/3/2024.\n\n\n PN1598:\n        Dionne L. McMillan, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1599:\n        Todd A. Hasenstein, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1617:\n        Ty R. Christian, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1655:\n        Maj. Gen. Jason T. Hinds, in the Air Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1656:\n        Col. Lisa A. Nemeth, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1657:\n        Col. Peter M. Boone, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1658:\n        Col. Michael S. Shanley, in the Army, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1659:\n        4 nominations in the Army beginning with Col. Kathleen A. Clary and ending with Col. Brian D. Wisniewski\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1661:\n        398 nominations in the Air Force beginning with Geoffrey E. Adams and ending with Erica Marie Zentner\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1662:\n        144 nominations in the Air Force beginning with Nicholas Alberto Aguilera and ending with Yongjun Yoon\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1663:\n        311 nominations in the Air Force beginning with Jessica M. Abbott and ending with Troy Bettinger Yu\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1664:\n        1071 nominations in the Air Force beginning with Mariah C. Aceves and ending with Andrew Paul Zimmerman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1665:\n        405 nominations in the Army beginning with Gregory J. Abide and ending with 0003682611\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1666:\n        502 nominations in the Army beginning with Jacob P. Absalon and ending with 0002344681\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1668:\n        Michael W. Struthers, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1670:\n        Gary R. Weltman, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1671:\n        43 nominations in the Army beginning with Daniel A. Abaldo and ending with 0002650956\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1672:\n        323 nominations in the Army beginning with Ji Y. Adams and ending with 0002978777\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1697:\n        Maj. Gen. Jered P. Helwig, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1698:\n        Maj. Gen. Gregory K. Anderson, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1699:\n        3 nominations in the Army beginning with Col. Terri J. Erisman and ending with Col. Steven M. Ranieri\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1700:\n        Lt. Gen. Stephen D. Sklenka, in the Marine Corps, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1701:\n        Maj. Gen. Calvert L. Worth, Jr., in the Marine Corps, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1702:\n        Rear Adm. Michael J. Vernazza, in the Navy, to be Vice Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1703:\n        Vice Adm. John F. Wade, in the Navy, to be Vice Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1704:\n        Paula M. Chavis, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1705:\n        2 nominations in the Air Force beginning with Frank J. Panebianco and ending with Andrew W. Washer\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1706:\n        James L. Schneider III, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1707:\n        Zhibin Jiang, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1708:\n        Bennet D. Krawchuk, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1709:\n        Dariusz P. Barna, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1710:\n        4 nominations in the Air Force beginning with Sally L. Cramer and ending with Jonathan A. Monsalve\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1712:\n        Caroline M. Kolb, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1719:\n        19 nominations in the Army beginning with Brady R. Clark and ending with Angelina K. Matherly\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1721:\n        18 nominations in the Army beginning with Emily R. Bingham and ending with 0002855239\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1722:\n        111 nominations in the Army beginning with Ahmad B. Alexander and ending with 0004136628\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1723:\n        27 nominations in the Army beginning with Vanessa E. Bonner and ending with 0002485564\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1724:\n        87 nominations in the Army beginning with Elizabeth A. Aguirre and ending with 0002517801\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Booker, at  4:01 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}