{"retrieved-date":"2025-4-8","actions-date":"Friday, April 4, 2025","actions-title":"Recent Floor Activity","actions-count":7,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday,the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Friday, April  4)","actionItem":"H.Con.Res. 14 (Rep. Arrington):\n        A concurrent resolution establishing the congressional budget for the United States Government for fiscal year 2025 and setting forth the appropriate budgetary levels for fiscal years 2026 through 2034.\n\n        -- Considered by Senate.\n\n        -- Resolution agreed to in Senate with an amendment by Yea-Nay Vote. 51 - 48. Record Vote Number: 191 \n\n \n\n S.Amdt. 1310 (Sen. Warner):\n        To establish a deficit-neutral reserve fund relating to strengthening protections for members of the Armed Forces by prohibiting the use of any commercial messaging application to transmit information revealing the timing, sequencing, or weapons to be used during impending United States military operations in foreign countries that may endanger the lives of members of the Armed Forces.\n\n        --Amendment SA 1310 proposed by Senator Warner to Amendment SA 1717.\n\n        --Amendment SA 1310 not agreed to in Senate by Yea-Nay Vote. 46 - 53. Record Vote Number: \n\n\n S.Amdt. 1466 (Sen. Alsobrooks):\n        To establish a deficit-neutral reserve fund relating to prohibiting attacks on Federal employees by protecting legally binding collective bargaining agreements and the right to organize.\n\n        --Amendment SA 1466 proposed by Senator Alsobrooks to Amendment SA 1717.\n\n        --Amendment SA 1466 not agreed to in Senate by Yea-Nay Vote. 48 - 51. Record Vote Number: \n\n\n S.Amdt. 1645 (Sen. Reed):\n        To establish a deficit-neutral reserve fund relating to preventing reduction in enrollment or benefits for individuals enrolled in Medicaid, including seniors, children, families, individuals with disabilities, veterans, and military families.\n\n        --Amendment SA 1645 proposed by Senator Reed to Amendment SA 1717.\n\n        --Amendment SA 1645 not agreed to in Senate by Yea-Nay Vote. 48 - 51. Record Vote Number: \n\n\n S.Amdt. 1646 (Sen. Bennet):\n        To prevent any disruption in security assistance to Ukraine.\n\n        --Amendment SA 1646 proposed by Senator Bennet to Amendment SA 1717.\n\n        --Amendment SA 1646 not agreed to in Senate by Yea-Nay Vote. 48 - 51. Record Vote Number: \n\n\n S.Amdt. 1647 (Sen. Warren):\n        To establish a deficit-neutral reserve fund relating to legislation that does not increase tax breaks for wealthy corporations.\n\n        --Amendment SA 1647 proposed by Senator Warren to Amendment SA 1717.\n\n        --Amendment SA 1647 not agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1717 (Sen. Graham):\n        In the nature of a substitute.\n\n        --Considered by Senate.\n\n        --Amendment SA 1717, as amended, agreed to in Senate by Unanimous Consent.\n\n\n S.Amdt. 1726 (Sen. Lujan):\n        To strike the provision relating to instructions to the Committee on Agriculture.\n\n        --Amendment SA 1726 proposed by Senator Lujan to Amendment SA 1717.\n\n        --Amendment SA 1726 not agreed to in Senate by Yea-Nay Vote. 47 - 51. Record Vote Number: \n\n\n S.Amdt. 1737 (Sen. Kelly):\n        To establish a deficit-neutral reserve fund relating to legislation that does not increase tax breaks for the wealthy.\n\n        --Amendment SA 1737 proposed by Senator Kelly to Amendment SA 1717.\n\n        --Amendment SA 1737 not agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1758 (Sen. Merkley):\n        To create a point of order against legislation that would create more debt over a 30-year period than has accumulated overthe past 249 years.\n\n        --Amendment SA 1758 proposed by Senator Merkley to Amendment SA 1717.\n\n        --Amendment SA 1758 not agreed to in Senate by Yea-Nay Vote. 46 - 53. Record Vote Number: \n\n\n S.Amdt. 1760 (Sen. Paul):\n        To modify the debt limit instruction for the Houseof Representatives and the Senate.\n\n        --Amendment SA 1760 proposed by Senator Paul to Amendment SA 1717.\n\n        --Amendment SA 1760 not agreed to in Senate by Yea-Nay Vote. 5 - 94. Record Vote Number: \n\n\n S.Amdt. 1773 (Sen. King):\n        To establish a deficit-neutral reserve fund relating to legislation that does not increase tax breaks for the wealthy.\n\n        --Amendment SA 1773 proposed by Senator King to Amendment SA 1717.\n\n        --Amendment SA 1773 not agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1774 (Sen. Padilla):\n        Reiterating the importance of the Federal Emergency Management Agency and its continued role in providing nonpartisanand long-term disaster relief to disaster survivors.\n\n        --Amendment SA 1774 proposed by Senator Padilla to Amendment SA 1717.\n\n        --Amendment SA 1774 not agreed to in Senate by Yea-Nay Vote. 48 - 51. Record Vote Number: \n\n\n S.Amdt. 1884 (Sen. Schumer):\n        To establish a deficit-neutral reserve fund relating to preventing Trump's tariffs from increasing the cost of groceries and everyday goods for families.\n\n        --Amendment SA 1884 proposed by Senator Schumer to Amendment SA 1717.\n\n        --Amendment SA 1884 not agreed to in Senate by Yea-Nay Vote. 46 - 53. Record Vote Number: \n\n\n S.Amdt. 1977 (Sen. Murphy):\n        To establish a deficit-neutral reserve fund relating to legislation that does not increase tax breaks for the wealthy.\n\n        --Amendment SA 1977 proposed by Senator Murphy to Amendment SA 1717.\n\n        --Amendment SA 1977 not agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 2035 (Sen. Sullivan):\n        To establish a deficit-neutral reserve fund relating to protecting Medicare and Medicaid.\n\n        --Amendment SA 2035 proposed by Senator Sullivan to Amendment SA 1717.\n\n        --Amendment SA 2035 agreed to in Senate by Yea-Nay Vote. 51 - 48. Record Vote Number: \n\n\n S.Amdt. 2107 (Sen. Hickenlooper):\n        To establish a deficit-neutral reserve fund relating to preventing the use of proceeds from public land sales to reducethe Federal deficit.\n\n        --Amendment SA 2107 proposed by Senator Hickenlooper to Amendment SA 1717.\n\n        --Amendment SA 2107 not agreed to in Senate by Yea-Nay Vote. 48 - 51. Record Vote Number: \n\n\n S.Amdt. 2186 (Sen. Ossoff):\n        To establish a deficit-neutral reserve fund relating to reversing cuts to the Social Security Administration, which mayinclude cuts ordered by the Department of Government Efficiency or any other cuts to seniors' services.\n\n        --Amendment SA 2186 proposed by Senator Ossoff to Amendment SA 1717.\n\n        --Amendment SA 2186 not agreed to in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number:","actionTimeStamp":"--"},{"index":5,"header":"Legislative Business (Saturday, April  5)","actionItem":"H.Con.Res. 14 (Rep. Arrington):\n        A concurrent resolution establishing the congressional budget for the United States Government for fiscal year 2025 and setting forth the appropriate budgetary levels for fiscal years 2026 through 2034.\n\n        -- Considered by Senate.\n\n        -- Resolution agreed to in Senate with an amendment by Yea-Nay Vote. 51 - 48. Record Vote Number: 191 \n\n \n\n S.Amdt. 1441 (Sen. Booker):\n        To establish a deficit-neutral reserve fund relating to stopping the Department of Agriculture from not honoring contracts made with farmers and farm-serving organizations.\n\n        --Amendment SA 1441 proposed by Senator Booker to Amendment SA 1717.\n\n        --Amendment SA 1441 not agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1529 (Sen. Markey):\n        To preserve access to Social Security's phone service.\n\n        --Amendment SA 1529 proposed by Senator Markey to Amendment SA 1717.\n\n        --Amendment SA 1529 not agreed to in Senate by Yea-Nay Vote. 48 - 51. Record Vote Number: \n\n\n S.Amdt. 1602 (Sen. Shaheen):\n        To establish a deficit-neutral reserve fund relating to extending vital enhanced advance premium tax credits.\n\n        --Amendment SA 1602 proposed by Senator Shaheen to Amendment SA 1717.\n\n        --Amendment SA 1602 not agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1644 (Sen. Kim):\n        To establish a deficit-neutral reserve fund to prevent increased barriers to American caregivers, including individuals caring for seniors, children, home care workers, and individuals engaged inthe care economy.\n\n        --Amendment SA 1644 proposed by Senator Kim to Amendment SA 1717.\n\n        --Amendment SA 1644 not agreed to in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: \n\n\n S.Amdt. 1661 (Sen. Welch):\n        To create a point of order against legislation that defunds essential services for children, families, and seniors, including programs that feed hungry seniors like Meals on Wheels, Head Start and other child care assistance that allows parents to work and pay their bills, and programs that keep children safe from abuse and neglect, to give massive tax cuts to billionaires.\n\n        --Amendment SA 1661 proposed by Senator Welch to Amendment SA 1717.\n\n        --Amendment SA 1661 not agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1690 (Sen. Cortez Masto):\n        To create a point of order against legislation that would increase drug costs for seniors and people with disabilities on Medicare.\n\n        --Amendment SA 1690 proposed by Senator Cortez Masto to Amendment SA 1717.\n\n        --Point of order that the amendment violates section 305(b)(2) of the CBA raised in Senate with respect to amendment SA 1690.\n\n        --Motion to waive all applicable budgetary discipline with respect to amendment SA 1690 rejected in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: \n\n        --Amendment SA 1690 ruled out of order by the chair.\n\n\n S.Amdt. 1693 (Sen. Baldwin):\n        To establish a deficit-neutral reserve fund relating to preventing a reduction in Medicaid funding that could lead to rural hospital closures, cost increases for individuals with other kinds ofinsurance, or higher rates of uncompensated care.\n\n        --Amendment SA 1693 proposed by Senator Baldwin to Amendment SA 1717.\n\n        --Amendment SA 1693 not agreed to in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: \n\n\n S.Amdt. 1717 (Sen. Graham):\n        In the nature of a substitute.\n\n        --Considered by Senate.\n\n        --Amendment SA 1717, as amended, agreed to in Senate by Unanimous Consent.\n\n\n S.Amdt. 1989 (Sen. Wyden):\n        To strike section 2001(b)(4) relating to reconciliation instructions to the Committee on Energy and Commerce of the House of Representatives to cut $880,000,000,000 from Medicaid.\n\n        --Amendment SA 1989 proposed by Senator Wyden to Amendment SA 1717.\n\n        --Amendment SA 1989 not agreed to in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: \n\n\n S.Amdt. 2107 (Sen. Hickenlooper):\n        To establish a deficit-neutral reserve fund relating to preventing the use of proceeds from public land sales to reducethe Federal deficit.\n\n        --Amendment SA 2107 proposed by Senator Hickenlooper to Amendment SA 1717.\n\n        --Amendment SA 2107 not agreed to in Senate by Yea-Nay Vote. 48 - 51. Record Vote Number: \n\n\n S.Amdt. 2126 (Sen. Sanders):\n        To make sure the Senate can increase the Federal minimum wage to $17 an hour by a simple majority vote.\n\n        --Amendment SA 2126 proposed by Senator Sanders to Amendment SA 1717.\n\n        --Amendment SA 2126 not agreed to in Senate by Yea-Nay Vote. 47 - 52. Record Vote Number: \n\n\n S.Amdt. 2152 (Sen. Rosen):\n        To provide tax relief for the middle class.\n\n        --Amendment SA 2152 proposed by Senator Rosen to Amendment SA 1717.\n\n        --Amendment SA 2152 not agreed to in Senate by Yea-Nay Vote. 47 - 52. Record Vote Number: \n\n\n S.Amdt. 2177 (Sen. Warnock):\n        To establish a deficit-neutral reserve fund relating to access to health care, which may include legislation preventingreductions in funding for Medicaid that could lead to benefit cuts, coverage loss, or slashed provide payments.\n\n        --Amendment SA 2177 proposed by Senator Warnock to Amendment SA 1717.\n\n        --Amendment SA 2177 not agreed to in Senate by Yea-Nay Vote. 48 - 51. Record Vote Number: \n\n\n S.Amdt. 2180 (Sen. Hirono):\n        To prevent DOGE from closing Social Security offices, preserving access to benefits for seniors and people with disabilities.\n\n        --Amendment SA 2180 proposed by Senator Hirono to Amendment SA 1717.\n\n        --Amendment SA 2180 not agreed to in Senate by Yea-Nay Vote. 48 - 51. Record Vote Number: \n\n\n\n\n S.Res. 155 (Sen. Curtis):\n        A resolution honoring the life and legacy of the Honorable Mia Bourdeau Love, former Representative for the State of Utah.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 156 (Sen. Murkowski):\n        A resolution commemorating the 50th anniversary ofthe Indian Self-Determination and Education Assistance Act.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 157 (Sen. Hyde-Smith):\n        A resolution designating April 2025 as \"National Native Plant Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":6,"header":"Executive Business (Saturday, April  5)","actionItem":"PN1:\n        Christopher A. Ridlon, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2:\n        Mark D. Goodwin, in the Army, to be colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN3:\n        Carlos J. Ramirez Jimenez, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN4:\n        Jeffrey W. Buckner, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN5:\n        Shawn P. Polonkey, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN6:\n        Joseph R. Petkus, in the Marine Corps, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN7:\n        Bijan C. Derakhshan, in the Marine Corps, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN8:\n        Jonathan W. Landers, in the Marine Corps, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN9:\n        Brendon B. Watts, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN12-9:\n        Elbridge Colby, of the District of Columbia, to beUnder Secretary of Defense for Policy\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, vote 4/7/2025.\n\n\n PN18:\n        Paul Atkins, of Virginia, to be a Member of the Securities and Exchange Commission for a term expiring June 5, 2031\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN25-6:\n        Kevin Cabrera, of Florida, to be Ambassador to theRepublic of Panama\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN25-14:\n        George Glass, of Oregon, to be Ambassador to Japan\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN25-18:\n        Peter Hoekstra, of Michigan, to be Ambassador to Canada\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN25-20:\n        Mike Huckabee, of Arkansas, to be Ambassador to the State of Israel\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN25-22:\n        Ronald Johnson, of Florida, to be Ambassador to the United Mexican States\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN32:\n        Christopher L. Junkins, in the Marine Corps, to beLieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN33:\n        2 nominations in the Marine Corps beginning with Andrew M. Adkins and ending with Ian P. Paquette\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN35:\n        James A. Berry, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN36:\n        Sergio Abreu, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN37:\n        Steven L. Ferwerda, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN39:\n        Christopher V. Posadas, in the Marine Corps, to beMajor\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN40:\n        2 nominations in the Marine Corps beginning with John H. Hildebrandt and ending with Tyler W. Montague\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN42:\n        Kevin M. Petty, in the Marine Corps, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN43:\n        Carlos L. Figueroa, in the Marine Corps, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN44:\n        Steven A. Tamm, in the Marine Corps, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN45:\n        2 nominations in the Marine Corps beginning with Thomas F. Stone and ending with Michael C. Vanarsdel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN47:\n        Austin J. Nelson, in the Marine Corps, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN48:\n        2 nominations in the Marine Corps beginning with Joshua S. Bridges and ending with Jameson R. Hastings\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN49:\n        2 nominations in the Marine Corps beginning with Jason A. Moore and ending with Patrick S. Webb\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN51:\n        4 nominations in the Marine Corps beginning with Jonathan R. Caruthers and ending with Gregory C. Scott, Jr.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN56:\n        Lt. Gen. Christopher C. LaNeve, in the Army, to beLieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":7,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  2:54 a.m., the Senate adjourned, under its order of today, until  3 p.m. on Monday, April 7, 2025.","actionTimeStamp":"--"}]}