{"retrieved-date":"2024-9-24","actions-date":"Tue, 24 Sep 2024 17:44:39 -0400","actions-title":"House Floor Proceedings","actions-count":98,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"The House proceeded with forty minutes of debate on H.R. 5302.","actionTimeStamp":"Tue, 24 Sep 2024 17:44:39 -0400"},{"index":2,"header":"--","actionItem":"Considered under suspension of the rules.","actionTimeStamp":"Tue, 24 Sep 2024 17:44:37 -0400"},{"index":3,"header":"--","actionItem":"Mr. Green (TN) moved to suspend the rules and pass the bill. H.R. 5302 — \"To designate the Air and Marine Operations Marine Unit of the U.S. Customs and Border Protection located at 101 Km 18.5 in Cabo Rojo, Puerto Rico, as the \"Michel O. Maceda Marine Unit\".\"","actionTimeStamp":"Tue, 24 Sep 2024 17:44:07 -0400"},{"index":4,"header":"--","actionItem":"The Speaker announced that votes on suspensions, if ordered, will be postponed until a time to be announced.","actionTimeStamp":"Tue, 24 Sep 2024 17:43:44 -0400"},{"index":5,"header":"MOMENT OF SILENCE","actionItem":"The House observed a moment of silence in honor of the victims of the tragedy in Birmingham, Alabama.","actionTimeStamp":"Tue, 24 Sep 2024 17:42:23 -0400"},{"index":6,"header":"--","actionItem":"The Clerk was authorized to correct section numbers, punctuation, and cross references, and to make other necessary technical and conforming corrections in the engrossment of H.R. 8790.","actionTimeStamp":"Tue, 24 Sep 2024 17:41:05 -0400"},{"index":7,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Tue, 24 Sep 2024 17:41:04 -0400"},{"index":8,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Tue, 24 Sep 2024 17:41:00 -0400"},{"index":9,"header":"--","actionItem":"Considered as privileged matter. H. Res. 1492 — \"The title of this measure is not available.\"","actionTimeStamp":"Tue, 24 Sep 2024 17:40:25 -0400"},{"index":10,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Tue, 24 Sep 2024 17:40:10 -0400"},{"index":11,"header":"--","actionItem":"On passage Passed by the Yeas and Nays: (Roll no. 448).","actionTimeStamp":"Tue, 24 Sep 2024 17:40:09 -0400"},{"index":12,"header":"--","actionItem":"The House adopted the amendments en gros as agreed to by the Committee of the Whole House on the state of the Union.","actionTimeStamp":"Tue, 24 Sep 2024 16:59:45 -0400"},{"index":13,"header":"--","actionItem":"The previous question was ordered pursuant to the rule.","actionTimeStamp":"Tue, 24 Sep 2024 16:59:27 -0400"},{"index":14,"header":"--","actionItem":"The House rose from the Committee of the Whole House on the state of the Union to report H.R. 8790.","actionTimeStamp":"Tue, 24 Sep 2024 16:58:46 -0400"},{"index":15,"header":"--","actionItem":"On agreeing to the LaLota amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 24 Sep 2024 16:58:35 -0400"},{"index":16,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1486, the Committee of the Whole proceeded with 10 minutes of debate on the LaLota amendment No. 16.","actionTimeStamp":"Tue, 24 Sep 2024 16:52:16 -0400"},{"index":17,"header":"--","actionItem":"An amendment, offered by Mr. LaLota,  numbered 16 printed in Part D of House Report 118-705 to direct the Secretary of Agriculture to carry out a study on the impacts pine beetles have in the Northeastern region of the United States.","actionTimeStamp":"Tue, 24 Sep 2024 16:52:05 -0400"},{"index":18,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 24 Sep 2024 16:51:49 -0400"},{"index":19,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1486, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 15.","actionTimeStamp":"Tue, 24 Sep 2024 16:43:38 -0400"},{"index":20,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 15 printed in Part D of House Report 118-705 to require regional foresters to submit a plan for the sale of Christmas trees and firewood on federal lands.","actionTimeStamp":"Tue, 24 Sep 2024 16:43:26 -0400"},{"index":21,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 24 Sep 2024 16:42:55 -0400"},{"index":22,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1486, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 14.","actionTimeStamp":"Tue, 24 Sep 2024 16:37:47 -0400"},{"index":23,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 14 printed in Part D of House Report 118-705 to require regional foresters to submit a plan through the Collaborative Forest Landscape Restoration Program for the treatment and removal of trees killed by or infested with bark beetles in Western states.","actionTimeStamp":"Tue, 24 Sep 2024 16:37:40 -0400"},{"index":24,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 24 Sep 2024 16:37:22 -0400"},{"index":25,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1486, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 13.","actionTimeStamp":"Tue, 24 Sep 2024 16:32:47 -0400"},{"index":26,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 13 printed in Part D of House Report 118-705 to ensure grazing is one of the hazardous fuels reduction activities authorized by the bill.","actionTimeStamp":"Tue, 24 Sep 2024 16:32:31 -0400"},{"index":27,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 24 Sep 2024 16:32:24 -0400"},{"index":28,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1486, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 12.","actionTimeStamp":"Tue, 24 Sep 2024 16:25:34 -0400"},{"index":29,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 12 printed in Part D of House Report 118-705 to clarify existing authorities may be utilized to prevent wildfires in Fire Regimes IV and V which are located in Colorado, Wyoming, New Mexico, Arizona, California, Utah, Nevada, Oregon, Idaho, Montana, Michigan, Minnesota, Wisconsin, New York, Maine, West Virginia, New Jersey, Rhode Island, Missouri, Louisiana, Mississippi, Indiana, Ohio, Vermont, New Hampshire, Massachusetts, Virginia, North Carolina, Iowa, Florida, and Texas.","actionTimeStamp":"Tue, 24 Sep 2024 16:25:31 -0400"},{"index":30,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 24 Sep 2024 16:25:21 -0400"},{"index":31,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1486, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 11.","actionTimeStamp":"Tue, 24 Sep 2024 16:19:49 -0400"},{"index":32,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 11 printed in Part D of House Report 118-705 to allow GNA revenue to be used for reconstruction, repair, and restoration of non-NFS roads necessary to implement GNA projects on federal lands, to allow GNA cooperators to construct new permanent roads on federal lands that is necessary to implement authorized restoration activities and approved by the federal agency through an Environmental Analysis or Categorical Exclusion decision, and to allow GNA cooperators to complete new permanent road construction to replace and decommission existing permanent road(s) that are adversely impacting forest, rangeland, or watershed health.","actionTimeStamp":"Tue, 24 Sep 2024 16:19:46 -0400"},{"index":33,"header":"--","actionItem":"On agreeing to the Valadao amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 24 Sep 2024 16:19:29 -0400"},{"index":34,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1486, the Committee of the Whole proceeded with 10 minutes of debate on the Valadao amendment No. 10.","actionTimeStamp":"Tue, 24 Sep 2024 16:15:15 -0400"},{"index":35,"header":"--","actionItem":"An amendment, offered by Mr. Valadao,  numbered 10 printed in Part D of House Report 118-705 to expand public and private forestry and watershed management partnerships by reducing redundancy for existing water source management plans and increasing the number of eligible entities.","actionTimeStamp":"Tue, 24 Sep 2024 16:15:14 -0400"},{"index":36,"header":"--","actionItem":"On agreeing to the Mullin amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 24 Sep 2024 16:15:03 -0400"},{"index":37,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1486, the Committee of the Whole proceeded with 10 minutes of debate on the Mullin amendment No. 9.","actionTimeStamp":"Tue, 24 Sep 2024 16:11:56 -0400"},{"index":38,"header":"--","actionItem":"An amendment, offered by Mr. Mullin,  numbered 9 printed in Part D of House Report 118-705 to add artificial intelligence and other decision support tools for use by the Fireshed Center.","actionTimeStamp":"Tue, 24 Sep 2024 16:11:55 -0400"},{"index":39,"header":"--","actionItem":"On agreeing to the Pettersen amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 24 Sep 2024 16:11:42 -0400"},{"index":40,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1486, the Committee of the Whole proceeded with 10 minutes of debate on the Pettersen amendment No. 8.","actionTimeStamp":"Tue, 24 Sep 2024 16:06:49 -0400"},{"index":41,"header":"--","actionItem":"An amendment, offered by Ms. Pettersen,  numbered 8 printed in Part D of House Report 118-705 to expand nursery and seed capacity work to support reforestation and restoration by state, Tribal, and local governments and institutions of higher education.","actionTimeStamp":"Tue, 24 Sep 2024 16:06:31 -0400"},{"index":42,"header":"--","actionItem":"On agreeing to the Barr amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 24 Sep 2024 16:06:15 -0400"},{"index":43,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1486, the Committee of the Whole proceeded with 10 minutes of debate on the Barr amendment No. 7.","actionTimeStamp":"Tue, 24 Sep 2024 16:00:04 -0400"},{"index":44,"header":"--","actionItem":"An amendment, offered by Mr. Barr,  numbered 7 printed in Part D of House Report 118-705 to direct the US Forest Service and the Department of the Interior to address reforestation and regeneration issues specific to the White Oak species through the White Oak Initiative and pilot projects.","actionTimeStamp":"Tue, 24 Sep 2024 15:59:38 -0400"},{"index":45,"header":"--","actionItem":"On agreeing to the Harder (CA) amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 24 Sep 2024 15:59:12 -0400"},{"index":46,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1486, the Committee of the Whole proceeded with 10 minutes of debate on the Harder amendment No. 6.","actionTimeStamp":"Tue, 24 Sep 2024 15:54:00 -0400"},{"index":47,"header":"--","actionItem":"An amendment, offered by Mr. Harder (CA),  numbered 6 printed in Part D of House Report 118-705 to authorize a Department of Interior Casualty Assistance Program to provide assistance to firefighters and the families of firefighters who were critically injured, ill, or killed in the line-of-duty.","actionTimeStamp":"Tue, 24 Sep 2024 15:53:40 -0400"},{"index":48,"header":"--","actionItem":"On agreeing to the Obernolte amendment; as modified Agreed to by voice vote.","actionTimeStamp":"Tue, 24 Sep 2024 15:53:06 -0400"},{"index":49,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1486, the Committee of the Whole proceeded with 10 minutes of debate on the Obernolte amendment No. 5, as modified.","actionTimeStamp":"Tue, 24 Sep 2024 15:48:14 -0400"},{"index":50,"header":"--","actionItem":"Obernolte amendment; modified by unanimous consent. Amendment strikes and replaces section 303, subsection (e). Agreed to without objection.","actionTimeStamp":"Tue, 24 Sep 2024 15:48:10 -0400"},{"index":51,"header":"--","actionItem":"An amendment, offered by Mr. Obernolte,  numbered 5 printed in Part D of House Report 118-705 to add thermal mid-wave infrared equipped low earth orbit satellites as a prioritized emerging technology for agencies to implement through public-private partnerships for wildfire mitigation and detection.","actionTimeStamp":"Tue, 24 Sep 2024 15:47:39 -0400"},{"index":52,"header":"--","actionItem":"On agreeing to the Garamendi amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 24 Sep 2024 15:47:28 -0400"},{"index":53,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1486, the Committee of the Whole proceeded with 10 minutes of debate on the Garamendi amendment No. 4.","actionTimeStamp":"Tue, 24 Sep 2024 15:41:30 -0400"},{"index":54,"header":"--","actionItem":"An amendment, offered by Mr. Garamendi,  numbered 4 printed in Part D of House Report 118-705 to clarify that special districts are eligible to participate in the wildfire-related programs authorized under the Healthy Forests Restoration Act of 2003. Also, the amendment clarifies that special districts are eligible to participate in the biochar research and development program established in Sec.301 of H.R. 8790. Expands the Good Neighbor Authority to special districts.","actionTimeStamp":"Tue, 24 Sep 2024 15:41:12 -0400"},{"index":55,"header":"--","actionItem":"On agreeing to the Valadao amendment; as modified Agreed to by voice vote.","actionTimeStamp":"Tue, 24 Sep 2024 15:40:34 -0400"},{"index":56,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1486, the Committee of the Whole proceeded with 10 minutes of debate on the Valadao amendment No. 3, as modified.","actionTimeStamp":"Tue, 24 Sep 2024 15:35:40 -0400"},{"index":57,"header":"--","actionItem":"An amendment, offered by Mr. Valadao,  numbered 3 printed in Part D of House Report 118-705 to require the U.S. Forest Service to conduct an evaluation of the container aerial firefighting system (CAFFS) to assess the use of such a system to mitigate and suppress wildfires.","actionTimeStamp":"Tue, 24 Sep 2024 15:35:06 -0400"},{"index":58,"header":"--","actionItem":"On agreeing to the LaMalfa amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 24 Sep 2024 15:34:50 -0400"},{"index":59,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1486, the Committee of the Whole proceeded with 10 minutes of debate on the LaMalfa amendment No. 2.","actionTimeStamp":"Tue, 24 Sep 2024 15:28:31 -0400"},{"index":60,"header":"--","actionItem":"An amendment, offered by Mr. LaMalfa,  numbered 2 printed in Part D of House Report 118-705 to direct the United States Forest Service to expand the use of proactive, targeted animal grazing in fuels management programs to reduce wildfire risk.","actionTimeStamp":"Tue, 24 Sep 2024 15:28:12 -0400"},{"index":61,"header":"--","actionItem":"On agreeing to the Molinaro amendment; Agreed to by voice vote.","actionTimeStamp":"Tue, 24 Sep 2024 15:27:53 -0400"},{"index":62,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1486, the Committee of the Whole proceeded with 10 minutes of debate on the Molinaro amendment No. 1.","actionTimeStamp":"Tue, 24 Sep 2024 15:22:25 -0400"},{"index":63,"header":"--","actionItem":"An amendment, offered by Mr. Molinaro,  numbered 1 printed in Part D of House Report 118-705 to add consideration of a strategy for reducing the threat of wildfires to wildland firefighters to the fireshed assessment.","actionTimeStamp":"Tue, 24 Sep 2024 15:21:57 -0400"},{"index":64,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 8790.","actionTimeStamp":"Tue, 24 Sep 2024 14:22:45 -0400"},{"index":65,"header":"--","actionItem":"The Speaker designated the Honorable Scott Fitzgerald to act as Chairman of the Committee.","actionTimeStamp":"Tue, 24 Sep 2024 14:21:27 -0400"},{"index":66,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 1486 and Rule XVIII.","actionTimeStamp":"Tue, 24 Sep 2024 14:21:26 -0400"},{"index":67,"header":"--","actionItem":"Rule provides for consideration of H.R. 3334, H.R. 8205, H.R. 8790 and H. Res. 1469. The resolution provides for consideration of H.R. 3334 and H.R. 8790 under a structured rule and H.R. 8205 and H. Res. 1469 under a closed rule. The resolution provides for one hour of general debate on each measure with one motion to recommit on H.R. 3334, H.R. 8790, and H.R. 8205.","actionTimeStamp":"Tue, 24 Sep 2024 14:21:02 -0400"},{"index":68,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 1486. H.R. 8790 — \"To expedite under the National Environmental Policy Act of 1969 and improve forest management activities on National Forest System lands, on public lands under the jurisdiction of the Bureau of Land Management, and on Tribal lands to return resilience to overgrown, fire-prone forested lands, and for other purposes.\"","actionTimeStamp":"Tue, 24 Sep 2024 14:20:57 -0400"},{"index":69,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Tue, 24 Sep 2024 14:20:06 -0400"},{"index":70,"header":"On motion to suspend the rules and pass the bill, as amended Agreed to by the Yeas and Nays: (2/3 required): 373","actionItem":"41 (Roll no. 447).","actionTimeStamp":"Tue, 24 Sep 2024 14:20:05 -0400"},{"index":71,"header":"--","actionItem":"Considered as unfinished business. H.R. 7073 — \"To improve public-private partnerships and increase Federal research, development, and demonstration related to the evolution of next generation pipeline systems, and for other purposes.\"","actionTimeStamp":"Tue, 24 Sep 2024 14:14:36 -0400"},{"index":72,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Tue, 24 Sep 2024 14:14:33 -0400"},{"index":73,"header":"On motion to suspend the rules and pass the bill Agreed to by the Yeas and Nays: (2/3 required): 415","actionItem":"0, 2 Present (Roll no. 446).","actionTimeStamp":"Tue, 24 Sep 2024 14:14:32 -0400"},{"index":74,"header":"--","actionItem":"Considered as unfinished business. H.R. 8057 — \"To designate the facility of the United States Postal Service located at 9317 Bolsa Avenue in Westminster, California, as the \"Little Saigon Vietnam War Veterans Memorial Post Office\".\"","actionTimeStamp":"Tue, 24 Sep 2024 14:10:56 -0400"},{"index":75,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Tue, 24 Sep 2024 14:10:54 -0400"},{"index":76,"header":"On motion to suspend the rules and pass the bill Agreed to by the Yeas and Nays: (2/3 required): 377","actionItem":"43 (Roll no. 445).","actionTimeStamp":"Tue, 24 Sep 2024 14:10:53 -0400"},{"index":77,"header":"--","actionItem":"Considered as unfinished business. H.R. 3208 — \"To amend the Homeland Security Act of 2002 to establish a DHS Cybersecurity On-the-Job Training Program, and for other purposes.\"","actionTimeStamp":"Tue, 24 Sep 2024 14:06:13 -0400"},{"index":78,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Tue, 24 Sep 2024 14:05:17 -0400"},{"index":79,"header":"On agreeing to the resolution Agreed to by recorded vote: 212","actionItem":"207 (Roll no. 444).","actionTimeStamp":"Tue, 24 Sep 2024 14:05:15 -0400"},{"index":80,"header":"On ordering the previous question Agreed to by the Yeas and Nays: 208","actionItem":"204 (Roll no. 443).","actionTimeStamp":"Tue, 24 Sep 2024 13:59:01 -0400"},{"index":81,"header":"--","actionItem":"Considered as unfinished business. H. Res. 1486 — \"Providing for consideration of the bill (H.R. 3334) to provide for the imposition of sanctions on members of the National Communist Party Congress of the People's Republic of China, and for other purposes; providing for consideration of the bill (H.R. 8205) to amend the Omnibus Crime Control and Safe Streets Act of 1968 to provide that Byrne grant funds may be used for public safety report systems, and for other purposes; providing for consideration of the bill (H.R. 8790) to expedite under the National Environmental Policy Act of 1969 and improve forest management activities on National Forest System lands, on public lands under the jurisdiction of the Bureau of Land Management, and on Tribal lands to return resilience to overgrown, fire-prone forested lands, and for other purposes; providing for consideration of the resolution (H. Res. 1469) ensuring accountability for key officials in the Biden-Harris administration responsible for decisionmaking and execution failures throughout the withdrawal from Afghanistan; and for other purposes.\"","actionTimeStamp":"Tue, 24 Sep 2024 13:31:02 -0400"},{"index":82,"header":"UNFINISHED BUSINESS","actionItem":"The Chair announced that the unfinished business was the question on ordering the previous question on H. Res. 1486, on agreeing to the resolution, if ordered, and on motions to suspend the rules, which had been debated earlier and on which further proceedings had been postponed.","actionTimeStamp":"Tue, 24 Sep 2024 13:30:13 -0400"},{"index":83,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of September 24.","actionTimeStamp":"Tue, 24 Sep 2024 13:30:12 -0400"},{"index":84,"header":"--","actionItem":"The Speaker announced that the House do now recess for a period of less than 15 minutes.","actionTimeStamp":"Tue, 24 Sep 2024 13:22:53 -0400"},{"index":85,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on H. Res. 1486, the Chair put the question on ordering the previous question and by voice vote, announced that the ayes had prevailed. Mr. McGovern demanded the yeas and nays and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 24 Sep 2024 13:22:39 -0400"},{"index":86,"header":"DEBATE","actionItem":"The House resumed debate on H. Res. 1486.","actionTimeStamp":"Tue, 24 Sep 2024 12:33:10 -0400"},{"index":87,"header":"UNANIMOUS CONSENT REQUEST","actionItem":"Mr. Burgess asked unanimous consent that amendment No. 3 printed in part D of House Report 118-705, to be offered by Representative Valadao of California or a designee, be modified by an amendment placed at the desk. Agreed to without objection.","actionTimeStamp":"Tue, 24 Sep 2024 12:33:03 -0400"},{"index":88,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 1486.","actionTimeStamp":"Tue, 24 Sep 2024 12:30:32 -0400"},{"index":89,"header":"--","actionItem":"Considered as privileged matter. H. Res. 1486 — \"Providing for consideration of the bill (H.R. 3334) to provide for the imposition of sanctions on members of the National Communist Party Congress of the People's Republic of China, and for other purposes; providing for consideration of the bill (H.R. 8205) to amend the Omnibus Crime Control and Safe Streets Act of 1968 to provide that Byrne grant funds may be used for public safety report systems, and for other purposes; providing for consideration of the bill (H.R. 8790) to expedite under the National Environmental Policy Act of 1969 and improve forest management activities on National Forest System lands, on public lands under the jurisdiction of the Bureau of Land Management, and on Tribal lands to return resilience to overgrown, fire-prone forested lands, and for other purposes; providing for consideration of the resolution (H. Res. 1469) ensuring accountability for key officials in the Biden-Harris administration responsible for decisionmaking and execution failures throughout the withdrawal from Afghanistan; and for other purposes.\"","actionTimeStamp":"Tue, 24 Sep 2024 12:24:10 -0400"},{"index":90,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair would be limited to 15 per side of the aisle.","actionTimeStamp":"Tue, 24 Sep 2024 12:01:58 -0400"},{"index":91,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Ms. Brownley to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Tue, 24 Sep 2024 12:01:36 -0400"},{"index":92,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Tue, 24 Sep 2024 12:01:31 -0400"},{"index":93,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Tue, 24 Sep 2024 12:00:11 -0400"},{"index":94,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of September 24.","actionTimeStamp":"Tue, 24 Sep 2024 12:00:01 -0400"},{"index":95,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Tue, 24 Sep 2024 11:06:18 -0400"},{"index":96,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Tue, 24 Sep 2024 10:01:30 -0400"},{"index":97,"header":"--","actionItem":"The Speaker designated the Honorable Mike Ezell to act as Speaker pro tempore for today.","actionTimeStamp":"Tue, 24 Sep 2024 10:00:14 -0400"},{"index":98,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Tue, 24 Sep 2024 10:00:00 -0400"}]}