{"retrieved-date":"2023-9-8","actions-date":"Thursday, September 7, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, September  7)","actionItem":"H.R. 4366 (Rep. Carter):\n        A bill making appropriations for military construction, the Department of Veterans Affairs, and related agencies for the fiscal year ending September 30, 2024, and for other purposes .\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed presented in Senate.\n\n\n S. 294 (Sen. Kennedy):\n        A bill to amend the Securities Exchange Act of 1934 to expand access to capital for rural-area small businesses, and for other purposes.\n\n        -- Senate Committee on Banking, Housing, and Urban Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 2747 (Sen. Klobuchar):\n        A bill to amend the Federal Election Campaign Act of 1971 to extend the Administrative Fine Program for certain reporting violations.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Voice Vote.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, September  7)","actionItem":"PN287:\n        Jeffrey Irvine Cummings, of Illinois, to be United States District Judge for the Northern District of Illinois\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN551:\n        Tanya J. Bradsher, of Virginia, to be Deputy Secretary of Veterans Affairs\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, debate and vote 9/11/2023.\n\n\n PN646:\n        Adriana Debora Kugler, of Maryland, to be a Member of the Board of Governors of the Federal Reserve System for the unexpired term of fourteen years from February 1, 2012\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 45. Record Vote Number: 220 \n\n\n\n PN673:\n        Anna M. Gomez, of Virginia, to be a Member of the Federal Communications Commission for a term of five years from July 1, 2021\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 55 - 43. Record Vote Number: 221 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 55 - 43. Record Vote Number: 222","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  4:17 p.m, the Presiding Officer (Mr. Fetterman in the chair) declared the Senate adjourned, under its order of today, until  3 p.m. on Monday, September 11, 2023.","actionTimeStamp":"--"}]}