{"retrieved-date":"2022-11-17","actions-date":"Wednesday, November 16, 2022","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, November 16)","actionItem":"H.R. 8404 (Rep. Nadler):\n        A bill to repeal the Defense of Marriage Act and ensure respect for State regulation of marriage, and for other purposes.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Cloture on the motion to proceed to the measure invoked in Senate by Yea-Nay Vote. 62 - 37. Record Vote Number: 356 \n\n\n\n H.R. 8454 (Rep. Blumenauer):\n        A bill to expand research on cannabidiol and marijuana, and for other purposes.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n S.Res. 820 (Sen. Blunt):\n        A resolution honoring the 100th anniversary of the Reserve Officers Association, now known as the Reserve Organization of America.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 827 (Sen. Feinstein):\n        A resolution supporting the goals and ideals of National Domestic Violence Awareness Month.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 836 (Sen. Tester):\n        A resolution permitting the collection of clothing , toys, food, and housewares during the holiday season for charitable purposes in Senate buildings.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  6:58 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}