{"retrieved-date":"2022-12-22","actions-date":"Tuesday, December 20, 2022","actions-title":"Recent Floor Activity","actions-count":7,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday,the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, December 20)","actionItem":"H.R. 785 (Rep. DeSaulnier):\n        A bill for the relief of Maria Isabel Bueso Barrera, Alberto Bueso Mendoza, and Karla Maria Barrera De Bueso.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n H.R. 2617 (Rep. Connolly):\n        A bill to amend section 1115 of title 31, United States Code, to amend the description of how performance goals are achieved, and for other purposes.\n\n        -- Motion to proceed to consideration of the House message to accompany H.R. 2617 agreed to in Senate by Yea-Nay Vote. 70 - 25. Record Vote Number: 403 \n\n\n        -- Measure laid before Senate by motion.\n\n        -- Motion by Senator Schumer to concur in the House amendment to Senate amendment SA 4 to H.R. 2617 with an amendment (SA 6552) made in Senate.\n\n        -- Motion by Senator Schumer to refer to Senate Committee on Appropriations the House message to accompany H.R. 2617 with instructions to report back forthwith with the following amendment (SA 6572) made in Senate.\n \n\n S.Amdt. 6552 (Sen. Leahy):\n        In the nature of a substitute.\n\n        --Amendment SA 6552 proposed by Senator Schumer for Senator Leahy.\n\n\n S.Amdt. 6571 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 6571 proposed by Senator Schumer to Amendment SA 6552.\n\n\n S.Amdt. 6572 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 6572 proposed by Senator Schumer.\n\n\n S.Amdt. 6573 (Sen. Schumer):\n        To modify the effective date.\n\n        --Amendment SA 6573 proposed by Senator Schumer to Amendment SA 6572 (the instructions of the motion to refer).\n\n\n S.Amdt. 6574 (Sen. Schumer):\n        To modify the effective date.\n\n        --Amendment SA 6574 proposed by Senator Schumer to Amendment SA 6573.\n\n\n\n\n H.R. 3285 (Rep. Pocan):\n        A bill to amend gendered terms in Federal law relating to the President and the President's spouse.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 5961 (Rep. Neguse):\n        A bill to make revisions in title 5, United StatesCode, as necessary to keep the title current, and to make technical amendments to improve the United States Code.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7939 (Rep. Levin):\n        A bill to make permanent certain educational assistance benefits under the laws administered by the Secretary of Veterans Affairs in the case of changes to courses of education by reason of emergency situations, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6578 (Sen. Moran):\n        In the nature of a substitute.\n\n        --Amendment SA 6578 proposed by Senator Heinrich for Senator Moran.\n\n        --Amendment SA 6578 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 1294 (Sen. Van Hollen):\n        A bill to authorize the imposition of sanctions with respect to foreign persons that have engaged in significant theft of trade secrets of United States persons, and for other purposes.\n\n        -- Senate Committee on Banking, Housing, and Urban Affairs discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Voice Vote.\n \n\n S.Amdt. 6580 (Sen. Van Hollen):\n        In the nature of a substitute.\n\n        --Amendment SA 6580 proposed by Senator Heinrich for Senator Van Hollen.\n\n        --Amendment SA 6580 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 1324 (Sen. Rosen):\n        A bill to establish a Civilian Cyber Security Reserve as a pilot project to address the cyber security needs of the United States with respect to national security, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 1942 (Sen. Stabenow):\n        A bill to standardize the designation of National Heritage Areas, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute withdrawn by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6587 (Sen. Manchin):\n        In the nature of a substitute.\n\n        --Amendment SA 6587 proposed by Senator Heinrich for Senator Manchin.\n\n        --Amendment SA 6587 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 3519 (Sen. Boozman):\n        A bill to amend the National Trails System Act to designate the Butterfield Overland National Historic Trail, and for other purposes.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6586 (Sen. Boozman):\n        In the nature of a substitute.\n\n        --Amendment SA 6586 proposed by Senator Heinrich for Senator Boozman.\n\n        --Amendment SA 6586 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 3773 (Sen. Cantwell):\n        A bill to authorize the leases of up to 99 years for land held in trust for the Confederated Tribes of the Chehalis Reservation.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 3946 (Sen. Cornyn):\n        A bill to reauthorize the Trafficking Victims Protection Act of 2017, and for other purposes.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6581 (Sen. Cornyn):\n        In the nature of a substitute.\n\n        --Amendment SA 6581 proposed by Senator Heinrich for Senator Cornyn.\n\n        --Amendment SA 6581 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 3949 (Sen. Grassley):\n        A bill to reauthorize the Trafficking Victims Protection Act of 2000, and for other purposes.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6583 (Sen. Grassley):\n        In the nature of a substitute.\n\n        --Amendment SA 6583 proposed by Senator Heinrich for Senator Grassley.\n\n        --Amendment SA 6583 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 4120 (Sen. Reed):\n        A bill to maximize discovery, and accelerate development and availability, of promising childhood cancer treatments, andfor other purposes.\n\n        -- Senate Committee on Health, Education, Labor, and Pensions discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6584 (Sen. Reed):\n        In the nature of a substitute.\n\n        --Amendment SA 6584 proposed by Senator Heinrich for Senator Reed.\n\n        --Amendment SA 6584 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 4859 (Sen. Cornyn):\n        A bill to reauthorize the Project Safe Neighborhoods Grant Program Authorization Act of 2018, and for other purposes.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with amendments by Unanimous Consent.\n \n\n S.Amdt. 6582 (Sen. Durbin):\n        To support multi-jurisdictional task forces.\n\n        --Amendment SA 6582 proposed by Senator Heinrich for Senator Durbin.\n\n        --Amendment SA 6582 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 5087 (Sen. Murkowski):\n        A bill to amend the Not Invisible Act of 2019 to extend, and provide additional support for, the activities of the Department of the Interior and the Department of Justice Joint Commission on Reducing Violent Crime Against Indians, and for other purposes.\n\n        -- Senate Committee on Indian Affairs discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n \n\n S.Amdt. 6556 (Sen. Schatz):\n        In the nature of a substitute.\n\n        --Amendment SA 6556 proposed by Senator Schatz.\n\n        --Amendment SA 6556 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 5323 (Sen. Cornyn):\n        A bill amend title VI of the Social Security Act to allow States and local governments to use coronavirus relief funds provided under the American Rescue Plan Act for infrastructure projects, improve the Local Assistance and Tribal Consistency Fund, provide Tribal governments with more time to use Coronavirus Relief Fund payments, and forother purposes.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.\n\n\n S. 5328 (Sen. Cortez Masto):\n        A bill to amend the Farm Security and Rural Investment Act of 2002 to extend terminal lakes assistance.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.\n\n\n S. 5329 (Sen. Blumenthal):\n        A bill to amend the Bill Emerson Good Samaritan Food Donation Act to improve the program, and for other purposes.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, December 20)","actionItem":"PN1242:\n        Kathy K. Im, of Illinois, to be a Member of the Board of Directors of the Corporation for Public Broadcasting for a term expiring January 31, 2024\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1883:\n        R. Russell Rumbaugh, of Nebraska, to be an Assistant Secretary of the Navy\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, vote today.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 80 - 10. Record Vote Number: 401 \n\n\n\n PN1959:\n        Cynthia Dyer, of Virginia, to be Director of the Office to Monitor and Combat Trafficking, with the rank of Ambassador at Large\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2136:\n        Rubydee Calvert, of Wyoming, to be a Member of theBoard of Directors of the Corporation for Public Broadcasting for a term expiring January 31, 2028\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2268:\n        Robert E. Primus, of New Jersey, to be a Member ofthe Surface Transportation Board for a term expiring December 31, 2027\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2272:\n        Lucy Tamlyn, of Rhode Island, to be Ambassador to the Democratic Republic of the Congo\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2312:\n        Diane Susan Kaplan, of Alaska, to be a Member of the Board of Directors of the Corporation for Public Broadcasting for a term expiring January 31, 2026\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2446:\n        Alan J. Patricof, of New York, to be a Director ofthe Securities Investor Protection Corporation for a term expiring December31, 2022\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2447:\n        Alan J. Patricof, of New York, to be a Director ofthe Securities Investor Protection Corporation for a term expiring December31, 2025\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2458:\n        Robert Harley Shriver III, of Virginia, to be Deputy Director of the Office of Personnel Management\n\n        -- By unanimous consent agreement, debate and vote to be determined.\n\n        -- By unanimous consent agreement, debate and vote today.\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 57 - 35. Record Vote Number: 402","actionTimeStamp":"--"},{"index":6,"header":"Executive Business (Wednesday, December 21)","actionItem":"PN2633:\n        Gene Rodrigues, of California, to be an Assistant Secretary of Energy (Electricity Delivery and Energy Reliability)\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":7,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at 12:11 a.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}