{"retrieved-date":"2024-5-14","actions-date":"Thursday, May 9, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, May  9)","actionItem":"H.R. 3935 (Rep. Graves):\n        A bill to amend title 49, United States Code, to reauthorize and improve the Federal Aviation Administration and other civil aviation programs, and for other purposes.\n\n        -- Considered by Senate.\n\n        -- Cloture on SA 1911, as modified, invoked in Senate by Yea-Nay Vote. 84 - 13. Record Vote Number: 161 \n\n\n        -- Motion by Senator Schumer to commit to Senate Committee on Commerce, Science, and Transportation with instructions to report back forthwith with the following amendment (SA 2027) fell when cloture was invoked on SA 1911, as modified, in Senate.\n\n        -- Passed Senate, under the order of 5/9/2024, having achieved 60 votes in the affirmative with an amendment by Yea-Nay Vote. 88 - 4. Record Vote Number: 162 \n\n \n\n S.Amdt. 1911 (Sen. Cantwell):\n        In the nature of a substitute.\n\n        --Considered by Senate.\n\n        --Amendment SA 1911 as modified agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 2026 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate.\n\n        --Proposed amendment SA 2026 withdrawn in Senate.\n\n\n S.Amdt. 2027 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate.\n\n        --SA 2027 fell when cloture invoked on SA 1911, as modified.\n\n\n S.Amdt. 2028 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate.\n\n        --SA 2028 fell when SA 2027 (the instructions of the motion to commit) fell.\n\n\n S.Amdt. 2029 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate.\n\n        --SA 2029 fell when SA 2028 fell.\n\n\n S.Amdt. 2040 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 2040 proposed by Senator Schumer.\n\n        --Proposed amendment SA 2040 withdrawn in Senate.\n\n\n S.Amdt. 2041 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 2041 proposed by Senator Cantwell for Senator Schumer to Amendment SA 2040.\n\n        --SA 2041 fell when SA 2040 was withdrawn.\n\n\n\n\n H.R. 8289 (Rep. Graves):\n        A bill to extend authorizations for the airport improvement program, to extend the funding and expenditure authority of the Airport and Airway Trust Fund, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.Con.Res. 83 (Rep. Perry):\n        A concurrent resolution authorizing the use of the Capitol Grounds for the National Peace Officers Memorial Service and the National Honor Guard and Pipe Band Exhibition.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 870 (Sen. Peters):\n        A bill to amend the Federal Fire Prevention and Control Act of 1974 to authorize appropriations for the United States Fire Administration and firefighter assistance grant programs.\n\n        -- Message on House action received in Senate and at desk: House amendments to Senate bill.\n\n\n S. 2825 (Sen. Cornyn):\n        A bill to award a Congressional Gold Medal to the United States Army Dustoff crews of the Vietnam War, collectively, in recognition of their extraordinary heroism and life-saving actions in Vietnam.\n\n        -- Senate Committee on Banking, Housing, and Urban Affairs discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 2066 (Sen. Cornyn):\n        In the nature of a substitute.\n\n        --Amendment SA 2066 proposed by Senator Schumer for Senator Cornyn.\n\n        --Amendment SA 2066 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 683 (Sen. Hassan):\n        A resolution supporting the designation of the week of April 29 through May 3, 2024, as \"National Specialized Instructional Support Personnel Appreciation Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, May  9)","actionItem":"PN927:\n        Courtney Diesel O'Donnell, of California, to be United States Permanent Representative to the United Nations Educational, Scientific, and Cultural Organization, with the rank of Ambassador\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- By unanimous consent agreement, debate 5/14/2024.\n\n\n PN1238:\n        Seth Robert Aframe, of New Hampshire, to be United States Circuit Judge for the First Circuit\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN1433:\n        Sanket Jayshukh Bulsara, of New York, to be United States District Judge for the Eastern District of New York\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  9:02 p.m., the Senate adjourned, under its order of today, until  6:30 p.m. tomorrow.","actionTimeStamp":"--"}]}