{"retrieved-date":"2023-5-18","actions-date":"Wednesday, May 17, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, May 17)","actionItem":"S.J.Res. 18 (Sen. Marshall):\n        A joint resolution disapproving of the rule submitted by the Department of Homeland Security relating to \"Public Charge Ground of Inadmissibility\".\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 50 - 47. Record Vote Number: 130 \n\n\n\n S.Res. 203 (Sen. Rosen):\n        A resolution recognizing the significance of Jewish American Heritage Month as a time to celebrate the contributions of Jewish Americans to the society and culture of the United States.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 215 (Sen. Feinstein):\n        A resolution supporting the mission and goals of National Fentanyl Awareness Day in 2023, including increasing individual and public awareness of the impact of fake or counterfeit fentanyl pills on families and young people.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 216 (Sen. Graham):\n        A resolution designating the week of May 14 through May 20, 2023, as \"National Police Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 217 (Sen. Collins):\n        A resolution supporting the designation of May 15, 2023, as \"National Senior Fraud Awareness Day\" to raise awareness about the increasing number of fraudulent scams targeted at seniors in the United States, to encourage the implementation of policies to prevent those scams from happening, and to improve protections from those scams for seniors.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, May 17)","actionItem":"PN95:\n        Nancy G. Abudu, of Georgia, to be United States Circuit Judge for the Eleventh Circuit\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 48. Record Vote Number: 131 \n\n\n        -- Considered by Senate.\n\n\n PN450:\n        Jeremy C. Daniel, of Illinois, to be United States District Judge for the Northern District of Illinois\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 57 - 39. Record Vote Number: 127 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 56 - 40. Record Vote Number: 128 \n\n\n\n PN455:\n        Darrel James Papillion, of Louisiana, to be United States District Judge for the Eastern District of Louisiana\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 63 - 33. Record Vote Number: 129 \n\n\n        -- Considered by Senate.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  8:15 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}