{"retrieved-date":"2025-11-17","actions-date":"Monday, November 10, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, November 10)","actionItem":"H.R. 5371 (Rep. Cole):\n        A bill making continuing appropriations and extensions for fiscal year 2026, and for other purposes.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 60 - 40. Record Vote Number: 611 \n\n\n        -- Measure laid before Senate by motion.\n\n        -- Motion by Senator Thune to commit to Senate Committee on Appropriations with instructions to report back forthwith with the following amendment (SA 3945) made in Senate.\n\n        -- Cloture motion on the measure presented in Senate.\n\n        -- Motion by Senator Thune to commit to Senate Committee on Appropriations with instructions to report back forthwith with the following amendment (SA 3945) fell when cloture was invoked on amendment SA 3937 in Senate.\n\n        -- Cloture on the measure, as amended, invoked in Senate by Yea-Nay Vote. 60 - 40. Record Vote Number: 617 \n\n\n        -- Passed Senate with an amendment by Yea-Nay Vote. 60 - 40. Record Vote Number: 618 \n\n\n        -- Message on Senate action sent to the House.\n \n\n S.Amdt. 3937 (Sen. Collins):\n        In the nature of a substitute.\n\n        --Amendment SA 3937 proposed by Senator Thune for Senator Collins.\n\n        --Cloture motion on amendment SA 3937 presented in Senate.\n\n        --Cloture on amendment SA 3937 invoked in Senate by Yea-Nay Vote. 60 - 40. Record Vote Number: \n\n        --Amendment SA 3937 agreed to in Senate by Yea-Nay Vote. 60 - 40. Record Vote Number: \n\n\n S.Amdt. 3941 (Sen. Paul):\n        To strike a provision modifying the definition of hemp for purposes of the Agricultural Marketing Act of 1946.\n\n        --Amendment SA 3941 proposed by Senator Thune for Senator Paul to Amendment SA 3937.\n\n        --Motion to table amendment SA 3941 agreed to in Senate by Yea-Nay Vote. 76 - 24. Record Vote Number: \n\n\n S.Amdt. 3942 (Sen. Thune):\n        To improve the bill.\n\n        --Amendment SA 3942 proposed by Senator Thune to Amendment SA 3941.\n\n        --SA 3942 fell when SA 3941 tabled.\n\n\n S.Amdt. 3943 (Sen. Thune):\n        To improve the bill.\n\n        --Amendment SA 3943 proposed by Senator Thune to language proposed to be stricken by amendment no. 3937.\n\n        --Proposed amendment SA 3943 to language proposed to be stricken by SA 3937 withdrawn in Senate.\n\n\n S.Amdt. 3944 (Sen. Thune):\n        To improve the bill.\n\n        --Amendment SA 3944 proposed by Senator Thune to Amendment SA 3943.\n\n        --SA 3944 fell when SA 3943 to language proposed to be stricken by SA 3937 withdrawn.\n\n\n S.Amdt. 3945 (Sen. Thune):\n        To improve the bill.\n\n        --Amendment SA 3945 proposed by Senator Thune.\n\n        --SA 3945 fell when cloture invoked on SA 3937.\n\n\n S.Amdt. 3946 (Sen. Thune):\n        To improve the bill.\n\n        --Amendment SA 3946 proposed by Senator Thune to Amendment SA 3945 (the instructions of the motion to commit).\n\n        --Motion to table amendment SA 3946 rejected in Senate by Yea-Nay Vote. 47 - 53. Record Vote Number: \n\n        --SA 3946 fell when when SA 3945 fell.\n\n\n S.Amdt. 3947 (Sen. Thune):\n        To improve the bill.\n\n        --Amendment SA 3947 proposed by Senator Thune to Amendment SA 3946.\n\n        --Motion to table amendment SA 3947 rejected in Senate by Yea-Nay Vote. 47 - 53. Record Vote Number: \n\n        --SA 3947 fell when when SA 3946 fell.\n\n\n\n\n S.Res. 494 (Sen. Klobuchar):\n        A resolution observing the 50th anniversary of the date on which the SS Edmund Fitzgerald sank in Lake Superior, and remembering the 29 lives lost in one of the worst storms ever recorded on the Great Lakes.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 495 (Sen. Moran):\n        A resolution recognizing the 50th anniversary of the end of the Vietnam War and honoring the United States veterans who served during the conflict.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 496 (Sen. Marshall):\n        A resolution expressing support for the designation of November 8, 2025, as \"National First-Generation College Celebration Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 497 (Sen. Moran):\n        A resolution permitting the collection of clothing, toys, food, and housewares during the holiday season for charitable purposes in Senate buildings.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.\n\n\n S.Res. 498 (Sen. Coons):\n        A resolution honoring Dr. Jane Goodall and her legacy as an ethologist, conservationist, and activist.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Monday, November 10)","actionItem":"PN129-9:\n        Donald Korb, of Ohio, to be Chief Counsel for the Internal Revenue Service and an Assistant General Counsel in the Department of the Treasury\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN445-6:\n        Ho Nieh, of Alabama, to be a Member of the Nuclear Regulatory Commission for the remainder of the term expiring June 30, 2029\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  9:46 p.m., the Senate adjourned, under its order of today, until  6:30 p.m. on Thursday, November 13, 2025.","actionTimeStamp":"--"}]}