{"retrieved-date":"2023-12-5","actions-date":"Monday, December 4, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Thursday, November 30, 2023,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Thursday, November 30, 2023, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, December  4)","actionItem":"H.R. 815 (Rep. Rodgers):\n        A bill to amend title 38, United States Code, to make certain improvements relating to the eligibility of veterans to receive reimbursement for emergency treatment furnished through the Veterans Community Care program, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed presented in Senate.\n\n\n S. 2087 (Sen. Lummis):\n        A bill to reauthorize the Congressional Award Act.\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 1370 (Sen. Lummis):\n        In the nature of a substitute.\n\n        --Amendment SA 1370 proposed by Senator Schumer for Senator Lummis.\n\n        --Amendment SA 1370 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 483 (Sen. Wyden):\n        A resolution commending the officers of the Commissioned Corps of the United States Public Health Service for 225 years of work protecting, promoting, and advancing the health and safety of the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Monday, December  4)","actionItem":"PN500:\n        Irma Carrillo Ramirez, of Texas, to be United States Circuit Judge for the Fifth Circuit\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 80 - 12. Record Vote Number: 326 \n\n\n\n PN648:\n        Nathalie Rayes, of Massachusetts, to be Ambassador to the Republic of Croatia\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  6:46 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}