{"retrieved-date":"2023-7-6","actions-date":"Mon, 03 Jul 2023 10:04:08 -0400","actions-title":"House Floor Proceedings","actions-count":7,"actions-list":[{"index":1,"header":"--","actionItem":"The Speaker announced that the House do now adjourn pursuant to section 3(z) of H. Res. 5. The next meeting is scheduled for 12:00 p.m. on July 6, 2023.","actionTimeStamp":"Mon, 03 Jul 2023 10:04:08 -0400"},{"index":2,"header":"--","actionItem":"The House received a message from the Acting Clerk. Under Clause 2(g) of Rule II of the Rules of the U.S. House of Representatives, the Acting Clerk notified the House of his designation of Ms. Lisa P. Grant, Deputy Clerk, and Ms. Cheryl H. Muller, Director of Personnel, to sign any and all papers and perform all other acts for him under the name of the Acting Clerk of the House for which they would be authorized to do by virtue of this designation, except such as are provided by statute, in case of his temporary absence or disability and that this designation shall remain in effect for the 118th Congress, or until modified by him.","actionTimeStamp":"Mon, 03 Jul 2023 10:03:46 -0400"},{"index":3,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair led the House in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Mon, 03 Jul 2023 10:03:09 -0400"},{"index":4,"header":"SPEAKER'S APPROVAL OF THE JOURNAL","actionItem":"Pursuant to section 3(z) of H. Res. 5, the Journal of the last day's proceedings was approved.","actionTimeStamp":"Mon, 03 Jul 2023 10:02:54 -0400"},{"index":5,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Mon, 03 Jul 2023 10:01:16 -0400"},{"index":6,"header":"--","actionItem":"The Speaker designated the Honorable David Kustoff to act as Speaker pro tempore for today.","actionTimeStamp":"Mon, 03 Jul 2023 10:00:56 -0400"},{"index":7,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Mon, 03 Jul 2023 10:00:00 -0400"}]}