{"retrieved-date":"2024-9-30","actions-date":"Fri, 27 Sep 2024 10:04:52 -0400","actions-title":"House Floor Proceedings","actions-count":7,"actions-list":[{"index":1,"header":"--","actionItem":"The Speaker announced that the House do now adjourn pursuant to section 3(z) of H. Res. 5. The next meeting is scheduled for 11:00 a.m. on October 1, 2024.","actionTimeStamp":"Fri, 27 Sep 2024 10:04:52 -0400"},{"index":2,"header":"--","actionItem":"The House received a message from the Acting Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Representatives, the Acting Clerk notified the House that he had received the following message from the Secretary of the Senate on September 26, 2024, at 12:15 p.m.: That the Senate passed S. 91, S. 275, S. 1570, S. 3475, S. 3698, S. 4293, S. 4489, S. 5284, and S. 5292, Senate agreed to S. Res. 888 and H. Con. Res. 127, Senate passed H.R. 4190, H.R. 7189, and H.R. 7777. Appointments: Social Security Advisory Board, State and Local Enforcement Congressional Badge of Bravery Board, Commission on Reform and Modernization of the Department of State, and Public Safety Officer Medal of Valor Review Board.","actionTimeStamp":"Fri, 27 Sep 2024 10:02:34 -0400"},{"index":3,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Mooney to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Fri, 27 Sep 2024 10:02:06 -0400"},{"index":4,"header":"SPEAKER'S APPROVAL OF THE JOURNAL","actionItem":"Pursuant to section 3(z) of H. Res. 5, the Journal of the last day's proceedings was approved.","actionTimeStamp":"Fri, 27 Sep 2024 10:01:26 -0400"},{"index":5,"header":"--","actionItem":"Today's prayer was offered by Dr. Darin M. Wood, First Baptist Church, Midland, TX","actionTimeStamp":"Fri, 27 Sep 2024 10:00:43 -0400"},{"index":6,"header":"--","actionItem":"The Speaker designated the Honorable Mike Bost to act as Speaker pro tempore for today.","actionTimeStamp":"Fri, 27 Sep 2024 10:00:27 -0400"},{"index":7,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Fri, 27 Sep 2024 10:00:00 -0400"}]}