{"retrieved-date":"2025-7-11","actions-date":"Thu, 10 Jul 2025 11:06:37 -0400","actions-title":"House Floor Proceedings","actions-count":10,"actions-list":[{"index":1,"header":"--","actionItem":"The Speaker announced that the House do now adjourn pursuant to clause 13 of Rule I. The next meeting is scheduled for 12:00 p.m. on July 14, 2025.","actionTimeStamp":"Thu, 10 Jul 2025 11:06:37 -0400"},{"index":2,"header":"Canada-United States Interparliamentary Group","actionItem":"Pursuant to 22 U.S.C. 276d and the order of the House of January 3, 2025, the Speaker appointed the following members of the House to the Canada-United States Interparliamentary Group: Mr. Bergman, Mr. Stauber, Ms. Tenney, Mr. Finstad, Mr. Langworthy and Mr. Baumgartner.","actionTimeStamp":"Thu, 10 Jul 2025 11:06:13 -0400"},{"index":3,"header":"Congressional-Executive Commission on the People's Republic of China","actionItem":"Pursuant to 22 U.S.C. 6913, and the order of the House of January 3, 2025, the Speaker appointed the following members of the House to the Congressional-Executive Commission on the People's Republic of China: Mrs. Kiggans of Virginia and Mr. Strong.","actionTimeStamp":"Thu, 10 Jul 2025 11:05:43 -0400"},{"index":4,"header":"Commission on Security and Cooperation in Europe","actionItem":"Pursuant to 22 U.S.C. 3003, and the order of the House of January 3, 2025, the Speaker appointed the following members of the House to the Commission on Security and Cooperation in Europe: Mr. Aderholt, Mr. Hudson, Mr. Murphy, Mr. Ellzey, Mr. Cohen, Mr. Cleaver, Mr. Veasey and Mr. Doggett.","actionTimeStamp":"Thu, 10 Jul 2025 11:05:11 -0400"},{"index":5,"header":"--","actionItem":"The House received a message from the Senate. The Senate passed S. 1003.","actionTimeStamp":"Thu, 10 Jul 2025 11:04:53 -0400"},{"index":6,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair led the House in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 10 Jul 2025 11:04:29 -0400"},{"index":7,"header":"SPEAKER'S APPROVAL OF THE JOURNAL","actionItem":"Pursuant to clause 13 of Rule I, the Journal of the last day's proceedings was approved.","actionTimeStamp":"Thu, 10 Jul 2025 11:04:18 -0400"},{"index":8,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Thu, 10 Jul 2025 11:03:20 -0400"},{"index":9,"header":"--","actionItem":"The Speaker designated the Honorable Christopher H. Smith to act as Speaker pro tempore for today.","actionTimeStamp":"Thu, 10 Jul 2025 11:02:56 -0400"},{"index":10,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 10 Jul 2025 11:00:00 -0400"}]}