{"retrieved-date":"2023-9-22","actions-date":"Thursday, September 21, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, September 21)","actionItem":"H.R. 3935 (Rep. Graves):\n        A bill to amend title 49, United States Code, to reauthorize and improve the Federal Aviation Administration and other civil aviation programs, and for other purposes.\n\n        -- Read the second time. Placed on Senate Legislative Calendar under General Orders. Calendar No. 211.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.\n\n\n S. 2787 (Sen. Kennedy):\n        A bill to authorize the Federal Communications Commission to process applications for spectrum licenses from applicants who were successful bidders in an auction before the authority of the Commission to conduct auctions expired on March 9, 2023.\n\n        -- Senate Committee on Commerce, Science, and Transportation discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 208 (Sen. Shaheen):\n        A resolution expressing support for the designation of November 12, 2023, as \"National Warrior Call Day\" and recognizing the importance of connecting warriors in the United States to support structures necessary to transition from the battlefield, especially peer-to-peer connection.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Resolution agreed to in Senate with an amendment and an amended preamble by Unanimous Consent.\n \n\n S.Amdt. 1286 (Sen. Shaheen):\n        To amend the resolving clause.\n\n        --Amendment SA 1286 proposed by Senator Schumer for Senator Shaheen.\n\n        --Amendment SA 1286 agreed to in Senate by Unanimous Consent.\n\n\n S.Amdt. 1287 (Sen. Shaheen):\n        To amend the preamble.\n\n        --Amendment SA 1287 proposed by Senator Schumer for Senator Shaheen.\n\n        --Amendment SA 1287 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 358 (Sen. Reed):\n        A resolution expressing support for designation of the week of September 17 through 23, 2023, as National Adult Education and Family Literacy Week.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 359 (Sen. Crapo):\n        A resolution recognizing and supporting the goals and ideals of National Forensic Science Week.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, September 21)","actionItem":"PN537:\n        Gen. Randy A. George, in the Army, to be General\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 96 - 1. Record Vote Number: 237 \n\n\n\n PN691:\n        Gen. Eric M. Smith, in the Marine Corps, to be General\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 96 - 0. Record Vote Number: 238 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 96 - 0. Record Vote Number: 239 \n\n\n\n PN770:\n        Philip S. Hadji, of the District of Columbia, to be a Judge of the United States Court of Federal Claims for a term of fifteen years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  4:43 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}