{"retrieved-date":"2025-6-18","actions-date":"Monday, June 16, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Thursday, June 12, 2025,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Thursday, June 12, 2025, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, June 16)","actionItem":"S.Res. 247 (Sen. Hirono):\n        A resolution designating May 2025 as \"National Wildfire Preparedness Month\".\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 279 (Sen. Daines):\n        A resolution designating June 2025 as \"Great Outdoors Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Monday, June 16)","actionItem":"PN12-40:\n        Rodney Scott, of Oklahoma, to be Commissioner of U.S. Customs and Border Protection, Department of Homeland Security\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN25-1:\n        Gary Andres, of Virginia, to be an Assistant Secretary of Health and Human Services\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 44 - 33. Record Vote Number: 313 \n\n\n        -- By unanimous consent agreement, vote 6/17/2025.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Moreno, at  6:59 p.m., the Senate adjourned, under its order of today, until 11:30 a.m. tomorrow.","actionTimeStamp":"--"}]}