{"retrieved-date":"2025-3-14","actions-date":"Wednesday, March 12, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, March 12)","actionItem":"H.R. 1968 (Rep. Cole):\n        A bill making further continuing appropriations and other extensions for the fiscal year ending September 30, 2025, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.\n\n\n S.J.Res. 3 (Sen. Cruz):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Internal Revenue Service relating to \"Gross Proceeds Reporting by Brokers That Regularly Provide Services Effectuating Digital Asset Sales\".\n\n        -- Message received in Senate: Returned to the Senate pursuant to the provisions of H.Res. 212.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, March 12)","actionItem":"PN12-16:\n        Stephen Feinberg, of New York, to be Deputy Secretary of Defense\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN12-36:\n        John Phelan, of Florida, to be Secretary of the Navy\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN12-42:\n        Keith Sonderling, of Florida, to be Deputy Secretary of Labor\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 45. Record Vote Number: 118 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 46. Record Vote Number: 119 \n\n\n\n PN19:\n        Stephen Miran, of New York, to be Chairman of the Council of Economic Advisers\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 45. Record Vote Number: 116 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 46. Record Vote Number: 117","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  7:31 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}