{"retrieved-date":"2023-10-26","actions-date":"Wed, 25 Oct 2023 20:49:40 -0400","actions-title":"House Floor Proceedings","actions-count":112,"actions-list":[{"index":1,"header":"--","actionItem":"The House adjourned pursuant to a previous special order. The next meeting is scheduled for 10:00 a.m. on October 26, 2023.","actionTimeStamp":"Wed, 25 Oct 2023 20:49:40 -0400"},{"index":2,"header":"--","actionItem":"On motion to adjourn Agreed to by voice vote.","actionTimeStamp":"Wed, 25 Oct 2023 20:49:34 -0400"},{"index":3,"header":"--","actionItem":"Mr. Moran moved that the House do now adjourn.","actionTimeStamp":"Wed, 25 Oct 2023 20:49:30 -0400"},{"index":4,"header":"--","actionItem":"Mr. Moran asked unanimous consent that when the House adjourns today, it adjourn to meet at 10:00 a.m. on October 26. Agreed to without objection.","actionTimeStamp":"Wed, 25 Oct 2023 20:49:15 -0400"},{"index":5,"header":"--","actionItem":"Committee of the Whole House on the state of the Union rises leaving H.R. 4394 as unfinished business.","actionTimeStamp":"Wed, 25 Oct 2023 20:48:35 -0400"},{"index":6,"header":"--","actionItem":"On motion that the committee rise Agreed to by voice vote.","actionTimeStamp":"Wed, 25 Oct 2023 20:48:33 -0400"},{"index":7,"header":"--","actionItem":"Mr. Fleischmann moved that the committee rise.","actionTimeStamp":"Wed, 25 Oct 2023 20:47:33 -0400"},{"index":8,"header":"--","actionItem":"On agreeing to the Fallon amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 25 Oct 2023 20:47:32 -0400"},{"index":9,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Fallon amendment No. 35.","actionTimeStamp":"Wed, 25 Oct 2023 20:38:52 -0400"},{"index":10,"header":"--","actionItem":"An amendment, offered by Mr. Fallon,  numbered 35 printed in Part B of House Report 118-242 to prohibit funding to be used to finalize, implement, or enforce the proposed rule titled, \"Energy Conservation Program: Energy Conservation Standards for Consumer Furnaces.\"","actionTimeStamp":"Wed, 25 Oct 2023 20:38:39 -0400"},{"index":11,"header":"--","actionItem":"On agreeing to the Cammack amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 25 Oct 2023 20:38:09 -0400"},{"index":12,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Cammack amendment No. 34.","actionTimeStamp":"Wed, 25 Oct 2023 20:31:14 -0400"},{"index":13,"header":"--","actionItem":"An amendment, offered by Mrs. Cammack,  numbered 34 printed in Part B of House Report 118-242 to prohibit funds from being used to finalize any rule or regulation that has resulted in or is likely to result in an annual effect on the economy of $100 million or more.","actionTimeStamp":"Wed, 25 Oct 2023 20:31:03 -0400"},{"index":14,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Perry amendment No. 32, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Perry demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 25 Oct 2023 20:30:29 -0400"},{"index":15,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 32.","actionTimeStamp":"Wed, 25 Oct 2023 20:24:39 -0400"},{"index":16,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 32 printed in Part B of House Report 118-242 to cut funding for the Great Lakes Authority in half.","actionTimeStamp":"Wed, 25 Oct 2023 20:24:29 -0400"},{"index":17,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Perry amendment No. 31, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Perry demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 25 Oct 2023 20:23:56 -0400"},{"index":18,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 31.","actionTimeStamp":"Wed, 25 Oct 2023 20:15:56 -0400"},{"index":19,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 31 printed in Part B of House Report 118-242 to cut funding for the Southwest Border Regional Commission in half.","actionTimeStamp":"Wed, 25 Oct 2023 20:15:45 -0400"},{"index":20,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Perry amendment No. 30, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Perry demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 25 Oct 2023 20:15:14 -0400"},{"index":21,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 30.","actionTimeStamp":"Wed, 25 Oct 2023 20:09:55 -0400"},{"index":22,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 30 printed in Part B of House Report 118-242 to reduce funding for the Southeast Crescent Regional Commission to FY19 levels.","actionTimeStamp":"Wed, 25 Oct 2023 20:09:41 -0400"},{"index":23,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Perry amendment No. 29, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Perry demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 25 Oct 2023 20:08:59 -0400"},{"index":24,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 29.","actionTimeStamp":"Wed, 25 Oct 2023 20:05:15 -0400"},{"index":25,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 29 printed in Part B of House Report 118-242 to reduce funding for the Northern Border Regional Commission to FY19 levels.","actionTimeStamp":"Wed, 25 Oct 2023 20:05:07 -0400"},{"index":26,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Perry amendment No. 28, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Perry demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 25 Oct 2023 20:04:40 -0400"},{"index":27,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 28.","actionTimeStamp":"Wed, 25 Oct 2023 20:01:54 -0400"},{"index":28,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 28 printed in Part B of House Report 118-242 to eliminate funding for the Denali Commission.","actionTimeStamp":"Wed, 25 Oct 2023 20:01:37 -0400"},{"index":29,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Perry amendment No. 27, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Perry demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 25 Oct 2023 20:00:40 -0400"},{"index":30,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 27.","actionTimeStamp":"Wed, 25 Oct 2023 19:55:19 -0400"},{"index":31,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 27 printed in Part B of House Report 118-242 to reduce funding level for the Denali Commission to the FY19 level.","actionTimeStamp":"Wed, 25 Oct 2023 19:55:06 -0400"},{"index":32,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Perry amendment No. 26, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Perry demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 25 Oct 2023 19:54:38 -0400"},{"index":33,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 26.","actionTimeStamp":"Wed, 25 Oct 2023 19:47:21 -0400"},{"index":34,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 26 printed in Part B of House Report 118-242 to reduce funding level for the Delta Regional Commission to the FY19 level.","actionTimeStamp":"Wed, 25 Oct 2023 19:47:06 -0400"},{"index":35,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Perry amendment No. 25, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Perry demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 25 Oct 2023 19:46:34 -0400"},{"index":36,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 25.","actionTimeStamp":"Wed, 25 Oct 2023 19:38:13 -0400"},{"index":37,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 25 printed in Part B of House Report 118-242 to reduce funding level in this bill for the Appalachian Regional Commission to FY19 levels.","actionTimeStamp":"Wed, 25 Oct 2023 19:38:03 -0400"},{"index":38,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Norman amendment No. 20, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Norman demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 25 Oct 2023 19:37:26 -0400"},{"index":39,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 20.","actionTimeStamp":"Wed, 25 Oct 2023 19:28:05 -0400"},{"index":40,"header":"--","actionItem":"An amendment, offered by Mr. Norman,  numbered 20 printed in Part B of House Report 118-242 to eliminate funding for Advanced Research Projects Agency-Energy.","actionTimeStamp":"Wed, 25 Oct 2023 19:27:52 -0400"},{"index":41,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Perry amendment No. 19, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Perry demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 25 Oct 2023 19:26:48 -0400"},{"index":42,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 19.","actionTimeStamp":"Wed, 25 Oct 2023 19:19:09 -0400"},{"index":43,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 19 printed in Part B of House Report 118-242 to eliminate funding for Clean Energy Demonstrations.","actionTimeStamp":"Wed, 25 Oct 2023 19:18:53 -0400"},{"index":44,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Roy amendment No. 16, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Roy demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 25 Oct 2023 19:18:25 -0400"},{"index":45,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 16.","actionTimeStamp":"Wed, 25 Oct 2023 19:08:23 -0400"},{"index":46,"header":"--","actionItem":"An amendment, offered by Mr. Roy,  numbered 16 printed in Part B of House Report 118-242 to eliminate funding for Energy Department's Office of Energy Efficiency and Renewable Energy.","actionTimeStamp":"Wed, 25 Oct 2023 19:07:51 -0400"},{"index":47,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Griffith amendment No. 15, the Chair put the question on agreeing to the amendment and by voice vote, announced the nays had prevailed. Mr. Griffith demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 25 Oct 2023 19:07:29 -0400"},{"index":48,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Griffith amendment No. 15.","actionTimeStamp":"Wed, 25 Oct 2023 18:55:58 -0400"},{"index":49,"header":"--","actionItem":"An amendment, offered by Mr. Griffith,  numbered 15 printed in Part B of House Report 118-242 to increase funds for the Fossil Energy and Carbon Management program within the Department of Energy by $600 million and reduces funds for the Energy Efficiency and Renewable Energy program by $1.1 billion.","actionTimeStamp":"Wed, 25 Oct 2023 18:55:26 -0400"},{"index":50,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Westerman amendment No. 14, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Ms. Kaptur demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 25 Oct 2023 18:54:47 -0400"},{"index":51,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Westerman amendment No. 14.","actionTimeStamp":"Wed, 25 Oct 2023 18:47:02 -0400"},{"index":52,"header":"--","actionItem":"An amendment, offered by Mr. Westerman,  numbered 14 printed in Part B of House Report 118-242 to reduce funding for the Bureau of Reclamation's Policy and Administration to Fiscal Year 2022.","actionTimeStamp":"Wed, 25 Oct 2023 18:46:37 -0400"},{"index":53,"header":"--","actionItem":"On agreeing to the Neguse amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 25 Oct 2023 18:46:11 -0400"},{"index":54,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Neguse amendment No. 13.","actionTimeStamp":"Wed, 25 Oct 2023 18:43:47 -0400"},{"index":55,"header":"--","actionItem":"An amendment, offered by Mr. Neguse,  numbered 13 printed in Part B of House Report 118-242 to increase the Water and Related Resources Account by $500,000, to be directed to the Endangered Species Recovery Implementation Program (Upper Colorado and San Juan River Basins).","actionTimeStamp":"Wed, 25 Oct 2023 18:43:28 -0400"},{"index":56,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Neguse amendment No. 12, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Neguse demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 25 Oct 2023 18:43:04 -0400"},{"index":57,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Neguse amendment No. 12.","actionTimeStamp":"Wed, 25 Oct 2023 18:38:11 -0400"},{"index":58,"header":"--","actionItem":"An amendment, offered by Mr. Neguse,  numbered 12 printed in Part B of House Report 118-242 to increase the Water and Related Resources Account by $1 million to be directed to the Colorado River Compliance Activities account, specifically for the Upper Colorado and San Juan River Endangered Fish Recovery programs.","actionTimeStamp":"Wed, 25 Oct 2023 18:37:49 -0400"},{"index":59,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Perry amendment No. 3, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mrs. Watson Coleman demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 25 Oct 2023 18:36:54 -0400"},{"index":60,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 3.","actionTimeStamp":"Wed, 25 Oct 2023 18:27:28 -0400"},{"index":61,"header":"An amendment, offered by Mr. Perry,  numbered 3 printed in Part B of House Report 118-242 to reduce the funding for Army Corps of Engineers","actionItem":"Civil; Investigations by $715,000 for the purpose of eliminating funding for the Delaware River Basin Commission.","actionTimeStamp":"Wed, 25 Oct 2023 18:26:33 -0400"},{"index":62,"header":"--","actionItem":"On agreeing to the Fleischmann amendments; Agreed to by voice vote.","actionTimeStamp":"Wed, 25 Oct 2023 18:26:03 -0400"},{"index":63,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 756, the Committee of the Whole proceeded with 20 minutes of debate on the Fleischmann amendment en bloc.","actionTimeStamp":"Wed, 25 Oct 2023 18:22:10 -0400"},{"index":64,"header":"--","actionItem":"Amendments en bloc  offered by Mr. Fleischmann,  comprised of the following amendments printed in Part B of House Report 118-242 as en bloc: Nos. 1, 2, 4, 5, 6, 7, 8, 9, 10, 11, 17, 18, 21, 23, and 33.","actionTimeStamp":"Wed, 25 Oct 2023 18:21:42 -0400"},{"index":65,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 4394.","actionTimeStamp":"Wed, 25 Oct 2023 17:37:36 -0400"},{"index":66,"header":"--","actionItem":"The Speaker designated the Honorable Mike Flood to act as Chairman of the Committee.","actionTimeStamp":"Wed, 25 Oct 2023 17:37:07 -0400"},{"index":67,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 756 and Rule XVIII.","actionTimeStamp":"Wed, 25 Oct 2023 17:37:07 -0400"},{"index":68,"header":"--","actionItem":"Rule provides for consideration of H.R. 4394 and H.R. 4364. The resolution provides for consideration of H.R. 4394 and H.R. 4364. Resolution provides for consideration of H.R. 4394, under a structured rule with one hour of general debate and one motion to recommit. The resolution provides for consideration of H.R. 4364 under a closed rule with one hour of general debate and one motion to recommit. The resolution lays H. Res. 699 on the table.","actionTimeStamp":"Wed, 25 Oct 2023 17:36:44 -0400"},{"index":69,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 756. H.R. 4394 — \"Making appropriations for energy and water development and related agencies for the fiscal year ending September 30, 2024, and for other purposes.\"","actionTimeStamp":"Wed, 25 Oct 2023 17:36:39 -0400"},{"index":70,"header":"The Speaker laid before the House a message from the President transmitting a notification stating that the national emergency with respect to the situation in or in relation to the Democratic Republic of the Congo is to continue in effect beyond October 27, 2023","actionItem":"referred to the Committee on Foreign Affairs and ordered to be printed (H. Doc. 118-71).","actionTimeStamp":"Wed, 25 Oct 2023 17:34:44 -0400"},{"index":71,"header":"--","actionItem":"The House received a message from the Acting Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Representatives, the Acting Clerk transmitted to the House a sealed envelope received from the White House on October 24, 2023, at 3:55 p.m., said to contain a message from the President regarding the Continuation of the National Emergency With Respect to the Democratic Republic of the Congo.","actionTimeStamp":"Wed, 25 Oct 2023 17:34:00 -0400"},{"index":72,"header":"The Speaker laid before the House a message from the President transmitting a notification stating that the national emergency with respect to significant narcotics traffickers centered in Columbia is to continue in effect beyond October 21, 2023","actionItem":"referred to the Committee on Foreign Affairs and ordered to be printed (H. Doc. 118-70).","actionTimeStamp":"Wed, 25 Oct 2023 17:32:00 -0400"},{"index":73,"header":"--","actionItem":"The House received a message from the Acting Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Representatives, the Acting Clerk transmitted to the House a sealed envelope received from the White House on October 17, 2023, at 3:44 p.m., said to contain a message from the President regarding the Continuation of the National Emergency with Respect to Significant Narcotics Traffickers Centered in Colombia.","actionTimeStamp":"Wed, 25 Oct 2023 17:31:50 -0400"},{"index":74,"header":"--","actionItem":"The House received a message from the Acting Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Representatives, the Acting Clerk notified the House that he had received the following message from the Secretary of the Senate on October 23, 2023, at 12:38 p.m.: That the Senate passed S. 2854 and H.R. 366.","actionTimeStamp":"Wed, 25 Oct 2023 17:31:10 -0400"},{"index":75,"header":"--","actionItem":"The House received a message from the Acting Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Representatives, the Acting Clerk notified the House that he had received the following message from the Secretary of the Senate on October 18, 2023, at 2:55 p.m.: That the Senate passed S. J. Res. 32; that the Senate agreed to S. Res. 406.","actionTimeStamp":"Wed, 25 Oct 2023 17:30:00 -0400"},{"index":76,"header":"--","actionItem":"The House received a message from the Acting Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Representatives, the Acting Clerk notified the House that he had received the following message from the Secretary of the Senate on October 16, 2023, at 3:10: p.m.: That the Senate agreed to S. Res. 400.","actionTimeStamp":"Wed, 25 Oct 2023 17:29:00 -0400"},{"index":77,"header":"--","actionItem":"The House received a message from the Acting Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Representatives, the Acting Clerk notified the House that he had received the following message from the Secretary of the Senate on October 4, 2023 at 5:47 p.m.: That the Senate passed S. 2231; that the Senate agreed to S. Res. 393 and S. Res. 394.","actionTimeStamp":"Wed, 25 Oct 2023 17:28:45 -0400"},{"index":78,"header":"--","actionItem":"The House received a communication from Michael R. Turner, Chairman of the House Permanent Select Committee on Intelligence. Pursuant to Rule VIII of the Rules of the House of Representatives, Mr. Turner notified the House that the House Permanent Select Committee on Intelligence had been served with a subpoena for documents issued by the United States District Court for the Southern District of New York and after consultation with the Office of General Counsel, he had determined that compliance with the subpoena is consistent with the privileges and rights of the House.","actionTimeStamp":"Wed, 25 Oct 2023 17:28:15 -0400"},{"index":79,"header":"--","actionItem":"The House received a communication from the Honorable Mike Johnson. Mr. Johnson (LA) submitted his resignation from the Committee on the Judiciary and the House Judiciary Select Subcommittee on the Weaponization of the Federal Government. The resignation was accepted without objection.","actionTimeStamp":"Wed, 25 Oct 2023 17:27:03 -0400"},{"index":80,"header":"--","actionItem":"The House received a communication from the Honorable Mike Johnson. Mr. Johnson (LA) submitted his resignation from the Committee on Armed Services. The resignation was accepted without objection.","actionTimeStamp":"Wed, 25 Oct 2023 17:27:02 -0400"},{"index":81,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Wed, 25 Oct 2023 17:26:42 -0400"},{"index":82,"header":"On motion to suspend the rules and agree to the resolution Agreed to by the Yeas and Nays: (2/3 required): 412","actionItem":"10, 6 Present (Roll no. 528).","actionTimeStamp":"Wed, 25 Oct 2023 17:26:41 -0400"},{"index":83,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 771.","actionTimeStamp":"Wed, 25 Oct 2023 15:32:30 -0400"},{"index":84,"header":"ORDER OF PROCEDURE","actionItem":"Mr. McCaul asked unanimous consent that debate be extended by 10 minutes on each side. Agreed to without objection.","actionTimeStamp":"Wed, 25 Oct 2023 15:32:29 -0400"},{"index":85,"header":"--","actionItem":"Considered under suspension of the rules.","actionTimeStamp":"Wed, 25 Oct 2023 15:32:25 -0400"},{"index":86,"header":"--","actionItem":"Mr. McCaul moved to suspend the rules and agree to the resolution. H. Res. 771 — \"Standing with Israel as it defends itself against the barbaric war launched by Hamas and other terrorists.\"","actionTimeStamp":"Wed, 25 Oct 2023 15:31:45 -0400"},{"index":87,"header":"--","actionItem":"The Speaker announced that votes on suspensions, if ordered, will be postponed until a time to be announced.","actionTimeStamp":"Wed, 25 Oct 2023 15:31:44 -0400"},{"index":88,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of October 25.","actionTimeStamp":"Wed, 25 Oct 2023 15:31:43 -0400"},{"index":89,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is subject to the call of the Chair.","actionTimeStamp":"Wed, 25 Oct 2023 14:49:12 -0400"},{"index":90,"header":"SPEAKER PRO TEMPORE","actionItem":"The Speaker appointed the Honorable Patrick McHenry, the Honorable Adrian Smith (NE), the Honorable Andy Harris, the Honorable Guy Reschenthaler, the Honorable Rob Wittman, the Honorable Ben Cline, the Honorable Richard Hudson, and the Honorable John Joyce (PA) to act as Speaker pro tempore to sign enrolled bills and joint resolutions through the remainder of the One Hundred Eighteenth Congress.","actionTimeStamp":"Wed, 25 Oct 2023 14:49:10 -0400"},{"index":91,"header":"--","actionItem":"The House received a communication from The Honorable Mike Johnson (LA), Speaker. Pursuant to H. Con. Res. 1, clause 12 of rule I, and any concurrent resolutions of the current Congress as may contemplate his designation of Members to exercise similar authority, the Speaker notified the Acting Clerk of his designation of Representative Steve Scalise of Louisiana to exercise any authority regarding assembly, reassembly, convening, or reconvening of the House. In the event of the death or inability of that designee, the alternate Members of the House listed in the letter bearing the date of October 25, 2023, placed with the Acting Clerk are designated, in turn, for the same purposes.","actionTimeStamp":"Wed, 25 Oct 2023 14:48:55 -0400"},{"index":92,"header":"--","actionItem":"The Chair announced that the Speaker has delivered to the Acting Clerk a letter dated October 25, 2023, listing Members in the order in which each shall act as Speaker pro tempore under clause 8(b)(3) of rule 1.","actionTimeStamp":"Wed, 25 Oct 2023 14:48:25 -0400"},{"index":93,"header":"--","actionItem":"The Chair announced that the Speaker's announced policies with respect to particular aspects of the legislative process placed in the Record on January 9, 2023, will continue in effect for the remainder of the 118th Congress.","actionTimeStamp":"Wed, 25 Oct 2023 14:48:07 -0400"},{"index":94,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Wed, 25 Oct 2023 14:47:17 -0400"},{"index":95,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Wed, 25 Oct 2023 14:47:10 -0400"},{"index":96,"header":"--","actionItem":"Considered as privileged matter. H. Res. 811 — \"Authorizing the Clerk to inform the President of the election of the Speaker.\"","actionTimeStamp":"Wed, 25 Oct 2023 14:46:39 -0400"},{"index":97,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Wed, 25 Oct 2023 14:46:36 -0400"},{"index":98,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Wed, 25 Oct 2023 14:46:31 -0400"},{"index":99,"header":"--","actionItem":"Considered as privileged matter. H. Res. 810 — \"To inform the Senate of the election of the Speaker.\"","actionTimeStamp":"Wed, 25 Oct 2023 14:45:47 -0400"},{"index":100,"header":"ADMINISTRATION OF THE OATH OF OFFICE","actionItem":"The Dean of the House administered the Oath of Office to the Speaker-elect.","actionTimeStamp":"Wed, 25 Oct 2023 14:43:16 -0400"},{"index":101,"header":"ADDRESS BY THE SPEAKER-ELECT","actionItem":"The Speaker-elect addressed the House prior to taking the Oath of Office which will be administered by the Dean of the House, Representative Harold Rogers, Kentucky.","actionTimeStamp":"Wed, 25 Oct 2023 14:23:34 -0400"},{"index":102,"header":"--","actionItem":"The Speaker-elect was escorted into the Chamber by the Escort Committee and introduced by Representative Jeffries, Democratic Leader, before assuming the Chair.","actionTimeStamp":"Wed, 25 Oct 2023 14:10:38 -0400"},{"index":103,"header":"COMMITTEE TO ESCORT THE SPEAKER-ELECT","actionItem":"The Speaker appointed a Committee of Members to escort the Speaker-elect into the Chamber and to the Chair.","actionTimeStamp":"Wed, 25 Oct 2023 13:54:34 -0400"},{"index":104,"header":"Roll call 527","actionItem":"Election of the Speaker. Mr. Johnson (LA) 220 and Mr. Jeffries 209 (Roll no. 527). Mr. Johnson (LA) was elected Speaker.","actionTimeStamp":"Wed, 25 Oct 2023 13:53:59 -0400"},{"index":105,"header":"NOMINATIONS FOR OFFICE OF SPEAKER","actionItem":"The Honorable Elise Stefanik, by direction of the Republican Conference, nominated the Honorable Mike Johnson, a Member from the State of Louisiana. The Honorable Pete Aguilar, by direction of the Democratic Caucus, nominated the Honorable Hakeem Jeffries, a Member from the State of New York. No other nominations were put forward.","actionTimeStamp":"Wed, 25 Oct 2023 12:52:49 -0400"},{"index":106,"header":"ORDER OF BUSINESS-ELECTION OF THE SPEAKER","actionItem":"The Chair announced that the floor was open to receive nominations for the Office of the Speaker of the U.S. House of Representatives.","actionTimeStamp":"Wed, 25 Oct 2023 12:52:20 -0400"},{"index":107,"header":"--","actionItem":"Call of the House Quorum responded: 429 present (Roll no. 526).","actionTimeStamp":"Wed, 25 Oct 2023 12:50:29 -0400"},{"index":108,"header":"CALL OF THE HOUSE","actionItem":"Pursuant to clause 7 of rule XX, Mr. Bost moved a call of the House. The Speaker announced that under clause 7(b) of rule XX, he conferred recognition for that purpose and that without objection, a call of the House would be ordered.","actionTimeStamp":"Wed, 25 Oct 2023 12:05:05 -0400"},{"index":109,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Newhouse to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 25 Oct 2023 12:05:00 -0400"},{"index":110,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 25 Oct 2023 12:04:55 -0400"},{"index":111,"header":"--","actionItem":"Today's prayer was offered by Reverend Jeremy Leganski, Immaculate Conception Church, Elmhurst, IL.","actionTimeStamp":"Wed, 25 Oct 2023 12:03:32 -0400"},{"index":112,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 25 Oct 2023 12:00:00 -0400"}]}