{"retrieved-date":"2023-10-20","actions-date":"Thursday, October 19, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, October 19)","actionItem":"H.R. 366 (Rep. Takano):\n        A bill to amend title 38, United States Code, to treat certain individuals who served in Vietnam as a member of the armed forces of the Republic of Korea as a veteran of the Armed Forces of the United States for purposes of the provision of health care by the Department of Veterans Affairs.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 2854 (Sen. Hoeven):\n        A bill to require the Secretary of Veterans Affairs to enter into an agreement with the city of Fargo, North Dakota, for the conveyance of certain land of the Department of Veterans Affairs at Fargo National Cemetery, and for other purposes.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 417 (Sen. Schumer):\n        A resolution standing with Israel against terrorism.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Yea-Nay Vote. 97 - 0. Record Vote Number: 261 \n\n\n\n S.Res. 420 (Sen. Schumer):\n        A resolution designating Betty K. Koed as Historian Emerita of the United States Senate.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 421 (Sen. Coons):\n        A resolution designating the week of October 15 through 21, 2023, as \"National Chemistry Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 422 (Sen. Wicker):\n        A resolution designating August 1, 2023, as \"Gold Star Children's Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, October 19)","actionItem":"PN155:\n        Jessica Looman, of Minnesota, to be Administrator of the Wage and Hour Division, Department of Labor\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN978:\n        2 nominations in the Coast Guard beginning with Matthew A. Gans and ending with Ian W. Marks\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN980:\n        Michael G. Whitaker, of Vermont, to be Administrator of the Federal Aviation Administration for the term of five years\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- By unanimous consent agreement, debate 10/24/2023.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mrs. Murray, at  5:49 p.m., the Senate adjourned, under its order of today, until 12 noon on Monday, October 23, 2023.","actionTimeStamp":"--"}]}