{"retrieved-date":"2024-4-12","actions-date":"Fri, 12 Apr 2024 13:27:33 -0400","actions-title":"House Floor Proceedings","actions-count":49,"actions-list":[{"index":1,"header":"SPECIAL ORDER SPEECHES","actionItem":"The House has concluded all anticipated legislative business and has proceeded to Special Order speeches.","actionTimeStamp":"Fri, 12 Apr 2024 13:27:33 -0400"},{"index":2,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with further one minute speeches.","actionTimeStamp":"Fri, 12 Apr 2024 13:05:35 -0400"},{"index":3,"header":"--","actionItem":"Mr. Barr asked unanimous consent That, when the House adjourns on Friday, April 12, 2024, it adjourn to meet at noon on Monday, April 15, 2024 for Morning-Hour debate and 2:00 p.m. for legislative business. Agreed to without objection.","actionTimeStamp":"Fri, 12 Apr 2024 13:04:28 -0400"},{"index":4,"header":"POSTPONED PROCEEDINGS","actionItem":"The Chair put the question on the motion to table the motion to reconsider and by voice vote announced that the ayes had prevailed. Mrs. Luna demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Fri, 12 Apr 2024 13:03:56 -0400"},{"index":5,"header":"--","actionItem":"Mr. Turner moved to table the motion to reconsider","actionTimeStamp":"Fri, 12 Apr 2024 13:03:55 -0400"},{"index":6,"header":"--","actionItem":"Ms. Lee (FL) moved to reconsider.","actionTimeStamp":"Fri, 12 Apr 2024 13:02:55 -0400"},{"index":7,"header":"--","actionItem":"Motion to reconsider laid upon the table. Objection heard.","actionTimeStamp":"Fri, 12 Apr 2024 13:01:55 -0400"},{"index":8,"header":"On passage Passed by recorded vote: 273","actionItem":"147 (Roll no. 119).","actionTimeStamp":"Fri, 12 Apr 2024 13:01:53 -0400"},{"index":9,"header":"--","actionItem":"The House adopted the amendments en gross as agreed to by the Committee of the Whole House on the state of the Union.","actionTimeStamp":"Fri, 12 Apr 2024 12:51:27 -0400"},{"index":10,"header":"--","actionItem":"The previous question was ordered pursuant to the rule.","actionTimeStamp":"Fri, 12 Apr 2024 12:51:15 -0400"},{"index":11,"header":"--","actionItem":"The House rose from the Committee of the Whole House on the state of the Union to report H.R. 7888.","actionTimeStamp":"Fri, 12 Apr 2024 12:50:17 -0400"},{"index":12,"header":"On agreeing to the Turner amendment; Agreed to by recorded vote: 236","actionItem":"186 (Roll no. 118).","actionTimeStamp":"Fri, 12 Apr 2024 12:50:08 -0400"},{"index":13,"header":"On agreeing to the Waltz amendment; Agreed to by recorded vote: 227","actionItem":"193 (Roll no. 117).","actionTimeStamp":"Fri, 12 Apr 2024 12:44:55 -0400"},{"index":14,"header":"On agreeing to the Crenshaw amendment; Agreed to by recorded vote: 268","actionItem":"152 (Roll no. 116).","actionTimeStamp":"Fri, 12 Apr 2024 12:41:25 -0400"},{"index":15,"header":"On agreeing to the Roy amendment; Agreed to by recorded vote: 269","actionItem":"153 (Roll no. 115).","actionTimeStamp":"Fri, 12 Apr 2024 12:37:43 -0400"},{"index":16,"header":"On agreeing to the Biggs amendment; Failed by recorded vote: 212","actionItem":"212 (Roll no. 114).","actionTimeStamp":"Fri, 12 Apr 2024 12:32:12 -0400"},{"index":17,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Turner amendment No. 6, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Turner demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Fri, 12 Apr 2024 11:54:20 -0400"},{"index":18,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1137, the Committee of the Whole proceeded with 10 minutes of debate on the Turner amendment No. 6.","actionTimeStamp":"Fri, 12 Apr 2024 11:46:04 -0400"},{"index":19,"header":"--","actionItem":"An amendment, offered by Mr. Turner,  numbered 6 printed in House Report 118-456 to modify the definition of electronic communication service provider under section 702.","actionTimeStamp":"Fri, 12 Apr 2024 11:46:01 -0400"},{"index":20,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Waltz amendment No. 5, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Ms. Jayapal demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Fri, 12 Apr 2024 11:45:10 -0400"},{"index":21,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1137, the Committee of the Whole proceeded with 10 minutes of debate on the Waltz amendment No. 5.","actionTimeStamp":"Fri, 12 Apr 2024 11:34:02 -0400"},{"index":22,"header":"--","actionItem":"An amendment, offered by Mr. Waltz,  numbered 5 printed in House Report 118-456 to enable the use of section 702 information to vet foreigners traveling to the United States.","actionTimeStamp":"Fri, 12 Apr 2024 11:34:00 -0400"},{"index":23,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Crenshaw amendment No. 4, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Mr. Crenshaw demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Fri, 12 Apr 2024 11:33:02 -0400"},{"index":24,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1137, the Committee of the Whole proceeded with 10 minutes of debate on the Crenshaw amendment No. 4.","actionTimeStamp":"Fri, 12 Apr 2024 11:22:57 -0400"},{"index":25,"header":"--","actionItem":"An amendment, offered by Mr. Crenshaw,  numbered 4 printed in House Report 118-456 to modify the definition of foreign intelligence under section 702.","actionTimeStamp":"Fri, 12 Apr 2024 11:22:50 -0400"},{"index":26,"header":"--","actionItem":"On agreeing to the Cline amendment; Agreed to by voice vote.","actionTimeStamp":"Fri, 12 Apr 2024 11:22:29 -0400"},{"index":27,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1137, the Committee of the Whole proceeded with 10 minutes of debate on the Cline amendment No. 3.","actionTimeStamp":"Fri, 12 Apr 2024 11:12:50 -0400"},{"index":28,"header":"--","actionItem":"An amendment, offered by Mr. Cline,  numbered 3 printed in House Report 118-456 to prohibit the resumption of \"abouts\" collection under section 702.","actionTimeStamp":"Fri, 12 Apr 2024 11:12:31 -0400"},{"index":29,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Roy amendment No. 2, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Turner demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Fri, 12 Apr 2024 11:12:08 -0400"},{"index":30,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1137, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 2.","actionTimeStamp":"Fri, 12 Apr 2024 11:04:38 -0400"},{"index":31,"header":"--","actionItem":"An amendment, offered by Mr. Roy,  numbered 2 printed in House Report 118-456 to require the FBI to report to Congress on a quarterly basis the number of U.S. person queries conducted and permits Congressional leadership to attend Foreign Intelligence Surveillance Court proceedings.","actionTimeStamp":"Fri, 12 Apr 2024 11:03:52 -0400"},{"index":32,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Biggs amendment No. 1, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Turner demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Fri, 12 Apr 2024 11:03:27 -0400"},{"index":33,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1137, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 1.","actionTimeStamp":"Fri, 12 Apr 2024 10:51:30 -0400"},{"index":34,"header":"--","actionItem":"An amendment, offered by Mr. Biggs,  numbered 1 printed in House Report 118-456 to prohibit warrantless searches of U.S. person communications in the FISA 702 database, with exceptions for imminent threats to life or bodily harm, consent searches, or known cybersecurity threat signatures.","actionTimeStamp":"Fri, 12 Apr 2024 10:51:03 -0400"},{"index":35,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 7888.","actionTimeStamp":"Fri, 12 Apr 2024 09:41:47 -0400"},{"index":36,"header":"--","actionItem":"The Speaker designated the Honorable Daniel Meuser to act as Chairman of the Committee.","actionTimeStamp":"Fri, 12 Apr 2024 09:40:24 -0400"},{"index":37,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 1137 and Rule XVIII.","actionTimeStamp":"Fri, 12 Apr 2024 09:40:23 -0400"},{"index":38,"header":"--","actionItem":"Rule provides for consideration of H.R. 7888, H.R. 529, H. Res. 1112 and H. Res. 1117. The resolution provides for consideration of H.R. 7888 under a structured rule and H.R. 529, H. Res. 1112, and H. Res. 1117 each under a closed rule. Rule provides for one hour of general debate on H.R. 7888, H.R. 529, H. Res. 1112, and H. Res. 1117. Motion to recommit allowed on H.R. 7888 and H.R. 529.","actionTimeStamp":"Fri, 12 Apr 2024 09:39:58 -0400"},{"index":39,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 1137. H.R. 7888 — \"To reform the Foreign Intelligence Surveillance Act of 1978.\"","actionTimeStamp":"Fri, 12 Apr 2024 09:39:53 -0400"},{"index":40,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Fri, 12 Apr 2024 09:35:51 -0400"},{"index":41,"header":"On agreeing to the resolution Agreed to by recorded vote: 213","actionItem":"208 (Roll no. 113).","actionTimeStamp":"Fri, 12 Apr 2024 09:35:50 -0400"},{"index":42,"header":"On ordering the previous question Agreed to by the Yeas and Nays: 208","actionItem":"202 (Roll no. 112).","actionTimeStamp":"Fri, 12 Apr 2024 09:25:39 -0400"},{"index":43,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 1137.","actionTimeStamp":"Fri, 12 Apr 2024 08:10:45 -0400"},{"index":44,"header":"--","actionItem":"Considered as privileged matter. H. Res. 1137 — \"Providing for consideration of the bill (H.R. 7888) to reform the Foreign Intelligence Surveillance Act of 1978; providing for consideration of the bill (H.R. 529) to extend the customs waters of the United States from 12 nautical miles to 24 nautical miles from the baselines of the United States, consistent with Presidential Proclamation 7219; providing for consideration of the resolution (H. Res. 1112) denouncing the Biden administration's immigration policies; and providing for consideration of the resolution (H. Res. 1117) opposing efforts to place one-sided pressure on Israel with respect to Gaza.\"","actionTimeStamp":"Fri, 12 Apr 2024 08:05:48 -0400"},{"index":45,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Neguse to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Fri, 12 Apr 2024 08:04:44 -0400"},{"index":46,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Fri, 12 Apr 2024 08:04:41 -0400"},{"index":47,"header":"--","actionItem":"Today's prayer was offered by Rev. Robert Suhr, Christ Church, Mequon, Wisconsin.","actionTimeStamp":"Fri, 12 Apr 2024 08:02:17 -0400"},{"index":48,"header":"--","actionItem":"The Speaker designated the Honorable Dan Newhouse to act as Speaker pro tempore for today.","actionTimeStamp":"Fri, 12 Apr 2024 08:02:09 -0400"},{"index":49,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Fri, 12 Apr 2024 08:00:00 -0400"}]}