{"retrieved-date":"2026-1-15","actions-date":"Tuesday, January 13, 2026","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, January 13)","actionItem":"H.R. 6938 (Rep. Cole):\n        A bill making consolidated appropriations for the fiscal year ending September 30, 2026, and for other purposes.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Voice Vote.\n\n        -- Measure laid before Senate by motion.\n\n        -- Motion by Senator Thune to commit to Senate Committee on Appropriations with instructions to report back forthwith with the following amendment (SA 4210) made in Senate.\n\n        -- Cloture motion on the measure presented in Senate.\n \n\n S.Amdt. 4208 (Sen. Thune):\n        To improve the bill.\n\n        --Amendment SA 4208 proposed by Senator Thune.\n\n\n S.Amdt. 4209 (Sen. Thune):\n        To improve the bill.\n\n        --Amendment SA 4209 proposed by Senator Thune to Amendment SA 4208.\n\n\n S.Amdt. 4210 (Sen. Thune):\n        To improve the bill.\n\n        --Amendment SA 4210 proposed by Senator Thune.\n\n\n S.Amdt. 4211 (Sen. Thune):\n        To improve the bill.\n\n        --Amendment SA 4211 proposed by Senator Thune to Amendment SA 4210 (the instructions of the motion to commit).\n\n\n S.Amdt. 4212 (Sen. Thune):\n        To improve the bill.\n\n        --Amendment SA 4212 proposed by Senator Thune to Amendment SA 4211.\n\n\n\n\n S. 1837 (Sen. Durbin):\n        A bill to improve rights to relief for individuals affected by non-consensual activities involving intimate digital forgeries, and for other purposes.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S.J.Res. 84 (Sen. Warner):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Centers for Medicare & Medicaid Services relating to \"Patient Protection and Affordable Care Act; Market Integrity and Affordability\".\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Motion to proceed to consideration of measure rejected in Senate by Yea-Nay Vote. 47 - 52. Record Vote Number: 8","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  6:56 p.m, the Presiding Officer (Mr. Curtis in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}