{"retrieved-date":"2023-7-13","actions-date":"Wednesday, July 12, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, July 12)","actionItem":"S. 2226 (Sen. Reed):\n        An original bill to authorize appropriations for fiscal year 2024 for military activities of the Department of Defense, for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- By Senator Reed from Committee on Armed Services filed written report. Report No. 118-58.\n\n\n S.Res. 291 (Sen. Bennet):\n        A resolution commending and congratulating the Denver Nuggets on their championship victory in the 2023 National Basketball Association Finals.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 292 (Sen. Braun):\n        A resolution congratulating the Fighting Irish of the University of Notre Dame men's lacrosse team for winning the 2023 National Collegiate Athletic Association Division I Men's Lacrosse National Championship.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 293 (Sen. Booker):\n        A resolution designating June 12, 2023, as \"Women Veterans Appreciation Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, July 12)","actionItem":"PN64:\n        Kalpana Kotagal, of Ohio, to be a Member of the Equal Employment Opportunity Commission for a term expiring July 1, 2027\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 50. Record Vote Number: 183 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate 7/13/2023.\n\n\n PN81:\n        Tiffany M. Cartwright, of Washington, to be United States District Judge for the Western District of Washington\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 47. Record Vote Number: 180 \n\n\n\n PN169:\n        Myong J. Joun, of Massachusetts, to be United States District Judge for the District of Massachusetts\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 46. Record Vote Number: 181 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, vote today.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 46. Record Vote Number: 182","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Whitehouse, at  6:59 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}