{"retrieved-date":"2026-1-8","actions-date":"Wednesday, January 7, 2026","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, January  7)","actionItem":"S.J.Res. 86 (Sen. Whitehouse):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Environmental Protection Agency relating to \"Air Plan Approval; South Dakota; Regional Haze Plan for the Second Implementation Period\".\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Motion to proceed to consideration of measure rejected in Senate by Yea-Nay Vote. 43 - 50. Record Vote Number: 4 \n\n\n\n S.Res. 288 (Sen. McCormick):\n        A resolution condemning the rise in ideologically motivated attacks on Jewish individuals in the United States, including the recent violent assault in Boulder, Colorado, and reaffirming the commitment of the Senate to combating antisemitism and politically motivated violence.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 503 (Sen. Bennet):\n        A resolution recognizing the third commemoration of the anti-LGBTQ+ attack that occurred on November 19-20, 2022, at Club Q, an LGBTQ+ bar in Colorado Springs, Colorado.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 543 (Sen. Kennedy):\n        A resolution commending Centenary College of Louisiana on the occasion of its bicentennial and its years of service to the State of Louisiana and the United States.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Recess","actionItem":"Under the authority of the order of today, at  5:45 p.m, the Presiding Officer (Mr. Moreno in the chair) declared the Senate recessed, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}