{"retrieved-date":"2024-6-5","actions-date":"Tuesday, June 4, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, June  4)","actionItem":"S. 3237 (Sen. Tillis):\n        A bill to amend the Camp Lejeune Justice Act of 2022 to ensure claimants are adequately informed regarding filing a Federal cause of action.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 2072 (Sen. Tillis):\n        In the nature of a substitute.\n\n        --Amendment SA 2072 proposed by Senator Blumenthal for Senator Tillis.\n\n        --Amendment SA 2072 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 385 (Sen. Risch):\n        A resolution calling for the immediate release of Evan Gershkovich, a United States citizen and journalist, who was wrongfully detained by the Government of the Russian Federation in March 2023.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 719 (Sen. Cassidy):\n        A resolution designating June 13, 2024, as \"National Seersucker Day\", designating every Thursday after National Seersucker Day through the last Thursday in August 2024 as \"Seersucker Thursday\", and designating June 2024 as \"Seersucker Appreciation Month\" .\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 720 (Sen. Braun):\n        A resolution congratulating Trine University men's basketball team for winning the 2024 National Collegiate Athletic Association Division III Men's Basketball National Championship .\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 721 (Sen. Braun):\n        A resolution congratulating the Grace College Lancers women's basketball team for winning the 2024 National Christian College Athletic Association Division I National Championship .\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 722 (Sen. Boozman):\n        A resolution expressing the gratitude and appreciation of the Senate for the acts of heroism and valor by the members of the United States Armed Forces who participated in the June 6, 1944, amphibious landing at Normandy, France, and commending those individuals for leadership and bravery in an operation that helped bring an end to World War II.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 723 (Sen. Hassan):\n        A resolution celebrating 40 years of Universal Design for Learning.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 724 (Sen. Daines):\n        A resolution designating May 2024 as \"National Brain Tumor Awareness Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Con.Res. 18 (Sen. Casey):\n        A concurrent resolution calling for the immediate release of Marc Fogel, a United States citizen and teacher, who was given an unjust and disproportionate criminal sentence by the Government of the Russian Federation in June 2022.\n\n        -- Resolution agreed to in Senate with an amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, June  4)","actionItem":"PN1350:\n        Tanya Monique Jones Bosier, of the District of Columbia, to be an Associate Judge of the Superior Court of the District of Columbia for the term of fifteen years\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 57 - 41. Record Vote Number: 185 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 57 - 41. Record Vote Number: 186 \n\n\n\n PN1354:\n        Judith E. Pipe, of the District of Columbia, to be an Associate Judge of the Superior Court of the District of Columbia for the term of fifteen years\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 56 - 42. Record Vote Number: 187 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate and vote 6/5/2024.\n\n\n PN1569:\n        Christopher T. Hanson, of Michigan, to be a Member of the Nuclear Regulatory Commission for the term of five years expiring June 30, 2029\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 81 - 17. Record Vote Number: 184","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Blumenthal, at  6:04 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}