{"retrieved-date":"2022-12-29","actions-date":"Thursday, December 22, 2022","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, December 22)","actionItem":"H.R. 1082 (Rep. Smith):\n        An Act to study the incidence of fatal and non-fatal assaults in TNC and for-hire vehicles in order to enhance safety and save lives.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment and an amendment to the Title by Unanimous Consent.\n \n\n S.Amdt. 6624 (Sen. Wicker):\n        In the nature of a substitute.\n\n        --Amendment SA 6624 proposed by Senator Schumer for Senator Wicker.\n\n        --Amendment SA 6624 agreed to in Senate by Unanimous Consent.\n\n\n S.Amdt. 6625 (Sen. Wicker):\n        To amend the title.\n\n        --Amendment SA 6625 proposed by Senator Schumer for Senator Wicker.\n\n        --Amendment SA 6625 agreed to in Senate by Unanimous Consent.\n\n\n\n\n H.R. 2617 (Rep. Connolly):\n        A bill to amend section 1115 of title 31, United States Code, to amend the description of how performance goals are achieved , and for other purposes.\n\n        -- Considered by Senate (Message from the House considered).\n\n        -- Motion by Senator Schumer to refer to Senate Committee on Appropriations the House message to accompany H.R. 2617 with instructions to report back forthwith with the following amendment (SA 6572) withdrawn in Senate by Unanimous Consent.\n\n        -- Senate concurred in the House amendment to Senate amendment SA 4 to H.R. 2617 with an amendment (SA 6552), under the order of 12/22/22, having achieved 60 votes in the affirmative, by Yea-Nay Vote. 68 - 29. Record Vote Number: 421 \n\n \n\n S.Amdt. 6552 (Sen. Leahy):\n        In the nature of a substitute.\n\n        --Considered by Senate (Message from the House considered).\n\n        --Point of order that the motion to concur in the House amendment to amendment SA 4 with an amendment (SA 6552) violates section 306 of the CBA raised in Senate with respect to amendment SA 6552.\n\n        --Motion to waive all applicable budgetary disciple with respect to the motion to concur in the House amendment to amendment SA 4 with an amendment (SA 6552) agreed to in Senate by Yea-Nay Vote. 65 - 31. Record Vote Number: \n\n\n S.Amdt. 6555 (Sen. Johnson):\n        To eliminate all earmarks in the bill .\n\n        --Amendment SA 6555 proposed by Senator Schumer for Senator Johnson to Amendment SA 6552.\n\n        --Amendment SA 6555 not agreed to in Senate by Yea-Nay Vote. 34 - 63. Record Vote Number: \n\n\n S.Amdt. 6558 (Sen. Cassidy):\n        To eliminate discrimination and promote women's health and economic security by ensuring reasonable workplace accommodations for workers whose ability to perform the functions of a job are limited by pregnancy, childbirth, or a related medical condition .\n\n        --Amendment SA 6558 proposed by Senator Schumer for Senator Cassidy to Amendment SA 6552.\n\n        --Amendment SA 6558, under the order of 12/22/22, having achieved 60 votes in the affirmative, was agreed to in Senate by Yea-Nay Vote. 73 - 24. Record Vote Number: \n\n\n S.Amdt. 6559 (Sen. Johnson):\n        To restrict the use of Federal funds appropriated to the Department of Homeland Security for the transportation of illegal aliens within the United States.\n\n        --Amendment SA 6559 proposed by Senator Schumer for Senator Johnson to Amendment SA 6552.\n\n        --Amendment SA 6559, under the order of 12/22/22, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 47 - 50. Record Vote Number: \n\n\n S.Amdt. 6561 (Sen. Paul):\n        To increase the voting threshold for budget points of order.\n\n        --Amendment SA 6561 proposed by Senator Schumer for Senator Paul to Amendment SA 6552.\n\n        --Amendment SA 6561, under the order of 12/22/22, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 34 - 63. Record Vote Number: \n\n\n S.Amdt. 6563 (Sen. Lee):\n        To prohibit the expenditure of Federal funds to terminate the prohibitions on entry into the United States that are commonly referred to as Title 42.\n\n        --Amendment SA 6563 proposed by Senator Schumer for Senator Lee to Amendment SA 6552.\n\n        --Amendment SA 6563 not agreed to in Senate by Yea-Nay Vote. 47 - 50. Record Vote Number: \n\n\n S.Amdt. 6569 (Sen. Braun):\n        To eliminate a waiver of State immunity .\n\n        --Amendment SA 6569 proposed by Senator Schumer for Senator Braun to Amendment SA 6558.\n\n        --Amendment SA 6569, under the order of 12/22/22, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 40 - 57. Record Vote Number: \n\n\n S.Amdt. 6571 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate (Message from the House considered).\n\n        --Proposed amendment SA 6571 withdrawn in Senate.\n\n\n S.Amdt. 6572 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate (Message from the House considered).\n\n        --Proposed amendment SA 6572 withdrawn in Senate.\n\n\n S.Amdt. 6573 (Sen. Schumer):\n        To modify the effective date.\n\n        --Considered by Senate (Message from the House considered).\n\n        --SA 6573 fell when SA 6572 was withdrawn.\n\n\n S.Amdt. 6574 (Sen. Schumer):\n        To modify the effective date.\n\n        --Considered by Senate (Message from the House considered).\n\n        --SA 6574 fell when SA 6573 fell.\n\n\n S.Amdt. 6576 (Sen. Lee):\n        To provide for the continuation of pay and benefits for Lieutenant Ridge Alkonis.\n\n        --Amendment SA 6576 proposed by Senator Schumer for Senator Lee to Amendment SA 6552.\n\n        --Amendment SA 6576 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 6577 (Sen. Lankford):\n        To establish a rule of construction relating to religious entities.\n\n        --Amendment SA 6577 proposed by Senator Schumer for Senator Lankford to Amendment SA 6558.\n\n        --Amendment SA 6577 not agreed to in Senate by Yea-Nay Vote. 44 - 53. Record Vote Number: \n\n\n S.Amdt. 6588 (Sen. Padilla):\n        To amend title VI of the Social Security Act to allow States and local governments to use coronavirus relief funds provided under the American Rescue Plan Act for infrastructure projects, improve the Local Assistance and Tribal Consistency Fund, provide Tribal governments with more time to Coronavirus Relief Fund payments, and for other purposes .\n\n        --Amendment SA 6588 proposed by Senator Schumer for Senator Padilla to Amendment SA 6552.\n\n        --Amendment SA 6588 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 6595 (Sen. Merkley):\n        To amend the Fair Labor Standards Act of 1938 to expand access to breastfeeding accommodations in the workplace, and for other purposes.\n\n        --Amendment SA 6595 proposed by Senator Schumer for Senator Merkley to Amendment SA 6552.\n\n        --Amendment SA 6595, under the order of 12/22/22, having achieved 60 votes in the affirmative, was agreed to in Senate by Yea-Nay Vote. 92 - 5. Record Vote Number: \n\n\n S.Amdt. 6596 (Sen. Graham):\n        To authorize the transfer of the proceeds of certain forfeited property to help Ukraine recover from the harms caused by the ongoing Russian aggression.\n\n        --Amendment SA 6596 proposed by Senator Schumer for Senator Graham to Amendment SA 6552.\n\n        --Amendment SA 6596 as modified agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 6597 (Sen. Klobuchar):\n        To improve the bill.\n\n        --Amendment SA 6597 proposed by Senator Schumer for Senator Klobuchar to Amendment SA 6552.\n\n        --Amendment SA 6597, under the order of 12/22/22, having achieved 60 votes in the affirmative, was agreed to in Senate by Yea-Nay Vote. 88 - 8. Record Vote Number: \n\n\n S.Amdt. 6607 (Sen. Gillibrand):\n        To establish a World Trade Center Health Program Supplemental Fund.\n\n        --Amendment SA 6607 proposed by Senator Schumer for Senator Gillibrand to Amendment SA 6552.\n\n        --Amendment SA 6607 as modified, under the order of 12/22/22, having achieved 60 votes in the affirmative, was agreed to in Senate by Yea-Nay Vote. 90 - 6. Record Vote Number: \n\n\n S.Amdt. 6617 (Sen. Menendez):\n        To improve the Justice for the United States Victims of State Sponsored Terrorism Act.\n\n        --Amendment SA 6617 proposed by Senator Schumer for Senator Menendez to Amendment SA 6552.\n\n        --Amendment SA 6617, under the order of 12/22/22, having achieved 60 votes in the affirmative, was agreed to in Senate by Yea-Nay Vote. 93 - 4. Record Vote Number: \n\n\n S.Amdt. 6621 (Sen. Sinema):\n        To appropriate amounts for the Executive Office for Immigration Review, U.S. Customs and Border Protection, U.S. Immigration and Customs Enforcement, the Federal Emergency Management Agency, U.S. Citizenship and Immigration Services, refugee and entrant assistance, and other Federal agencies.\n\n        --Amendment SA 6621 proposed by Senator Schumer for Senator Sinema to Amendment SA 6552.\n\n        --Amendment SA 6621, under the order of 12/22/22, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 10 - 87. Record Vote Number: \n\n\n\n\n H.R. 4373 (Rep. Lee):\n        A bill making appropriations for the Department of State, foreign operations, and related programs for the fiscal year ending September 30, 2022, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Voice Vote.\n\n        -- Cloture motion on the motion to proceed to the measure rendered moot in Senate.\n\n        -- Motion by Senator Schumer to reconsider the vote by which cloture was not invoked on the motion to proceed (Record Vote No. 129) rendered moot in Senate.\n \n\n S.Amdt. 6623 (Sen. Leahy):\n        In the nature of a substitute.\n\n        --Amendment SA 6623 proposed by Senator Schumer for Senator Leahy.\n\n        --Amendment SA 6623 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 2524 (Sen. Murkowski):\n        A bill to amend the Alaska Native Claims Settlement Act to exclude certain payments to aged, blind, or disabled Alaska Natives or descendants of Alaska Natives from being used to determine eligibility or certain programs, and for other purposes .\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 2708 (Sen. Lujan):\n        A bill to provide for greater consultation between the Federal Government and the governing bodies and community users of land grant-mercedes in New Mexico, to provide for a process for recognition of the historic-traditional uses of land grant-mercedes, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 3046 (Sen. Daines):\n        A bill to codify the authority of the Secretary of Agriculture and the Secretary of the Interior to conduct certain landscape-scale forest restoration projects, and for other purposes .\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 3428 (Sen. Manchin):\n        A bill to require the Secretary of Energy to establish a Nuclear Fuel Security Program, expand the American Assured Fuel Supply Program, and submit a report on a civil nuclear credit program, and for other purposes.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment and an amendment to the Title by Voice Vote \n \n\n S.Amdt. 6627 (Sen. Manchin):\n        In the nature of a substitute.\n\n        --Amendment SA 6627 proposed by Senator Schumer for Senator Manchin.\n\n        --Amendment SA 6627 agreed to in Senate by Unanimous Consent.\n\n\n S.Amdt. 6628 (Sen. Manchin):\n        To amend the title.\n\n        --Amendment SA 6628 proposed by Senator Schumer for Senator Manchin.\n\n        --Amendment SA 6628 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 3873 (Sen. Warner):\n        A bill to designate the outdoor amphitheater at the Blue Ridge Music Center in Galax, Virginia, as the \"Rock Boucher Amphitheater\".\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 4105 (Sen. Brown):\n        A bill to treat certain liquidations of new motor vehicle inventory as qualified liquidations of LIFO inventory for purposes of the Internal Revenue Code of 1986.\n\n        -- Senate Committee on Finance discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 4321 (Sen. Sullivan):\n        A bill to amend the Save Our Seas 2.0 Act to improve the administration of the Marine Debris Foundation, to amend the Marine Debris Act to improve the administration of the Marine Debris Program of the National Oceanic and Atmospheric Administration, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee amendment withdrawn by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6626 (Sen. Sullivan):\n        In the nature of substitute.\n\n        --Amendment SA 6626 proposed by Senator Schumer for Senator Sullivan.\n\n        --Amendment SA 6626 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 5355 (Sen. Scott, of FL):\n        A bill making emergency supplemental appropriations for disaster relief for the fiscal year ending September 30, 2023, and for other purposes.\n\n        -- Introduced in the Senate, read twice.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Under the order of 12/22/22, not having achieved 60 votes in the affirmative, failed of passage in Senate by Yea-Nay Vote. 22 - 73. Record Vote Number: 407 \n\n\n\n S. 5357 (Sen. Collins):\n        A bill to provide compensation for United States victims of Libyan state-sponsored terrorism, and for other purposes .\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.\n\n\n S.Res. 785 (Sen. Murray):\n        A resolution designating October 30, 2022, as a national day of remembrance for the workers of the nuclear weapons program of the United States.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Con.Res. 51 (Sen. Leahy):\n        A concurrent resolution providing for a correction in the enrollment of H.R. 2617.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Voice Vote.\n\n\n S.Con.Res. 52 (Sen. Leahy):\n        A concurrent resolution providing for a correction in the enrollment of H.R. 4373.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Voice Vote.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, December 22)","actionItem":"PN1366:\n        Jose Emilio Esteban, of California, to be Under Secretary of Agriculture for Food Safety\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1659:\n        Rebecca E. Jones Gaston, of Oregon, to be Commissioner on Children, Youth, and Families, Department of Health and Human Services\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1690:\n        Franklin R. Parker, of the District of Columbia, to be an Assistant Secretary of the Navy\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 70 - 22. Record Vote Number: 406 \n\n\n\n PN2225:\n        Terrence Edwards, of Maryland, to be Inspector General of the National Reconnaissance Office\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2250:\n        Douglas J. McKalip, of the District of Columbia, to be Chief Agricultural Negotiator, Office of the United States Trade Representative, with the rank of Ambassador\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2305:\n        Milancy Danielle Harris, of Virginia, to be a Deputy Under Secretary of Defense\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  6:06 p.m., the Senate adjourned, under its order of today, until 11 a.m. tomorrow.","actionTimeStamp":"--"}]}