{"retrieved-date":"2023-1-26","actions-date":"Thu, 26 Jan 2023 16:49:42 -0500","actions-title":"House Floor Proceedings","actions-count":115,"actions-list":[{"index":1,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Gottheimer amendment No. 86, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Carter (GA) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 16:49:42 -0500"},{"index":2,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Gottheimer amendment No. 86 under the five-minute rule, pending a reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 16:45:40 -0500"},{"index":3,"header":"--","actionItem":"An amendment, offered by Mr. Gottheimer,  numbered 86 printed in the Congressional Record to require the Secretary to consult with certain Secretaries about the plan and ensure such plan will not result in the sale of petroleum products drawn down from the Reserve to Iran, China, North Korea, or Russia.","actionTimeStamp":"Thu, 26 Jan 2023 16:45:37 -0500"},{"index":4,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Gottheimer amendment No. 85, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Gottheimer demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 16:45:15 -0500"},{"index":5,"header":"--","actionItem":"Mr. Carter (GA) raised a point of order against the Gottheimer amendment. Mr. Carter (GA) stated that the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. Point of order overruled by the Chair.","actionTimeStamp":"Thu, 26 Jan 2023 16:43:29 -0500"},{"index":6,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Gottheimer amendment No. 85 under the five-minute rule, pending a reservation of a point of order.","actionTimeStamp":"Thu, 26 Jan 2023 16:41:48 -0500"},{"index":7,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Torres (CA) amendment No. 50, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mrs. Torres (CA) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 16:41:06 -0500"},{"index":8,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Torres (CA) amendment No. 50 under the five-minute rule, pending a reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 16:36:03 -0500"},{"index":9,"header":"--","actionItem":"An amendment, offered by Mrs. Torres (CA),  numbered 50 printed in the Congressional Record to change the effective date to be the date the Secretary certifies that the oil and gas leasing on Federal lands is necessary to replenish the Strategic Petroleum Reserve to the amount held on February 23, 2022.","actionTimeStamp":"Thu, 26 Jan 2023 16:35:15 -0500"},{"index":10,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the DeGette amendment No. 89, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. DeGette demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 16:34:18 -0500"},{"index":11,"header":"--","actionItem":"Mr. Walberg raised a point of order against the DeGette amendment. Mr. Walberg raised a point of order against the DeGette amendment. Mr. Walberg stated that the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. Point of order overruled by the Chair.","actionTimeStamp":"Thu, 26 Jan 2023 16:31:42 -0500"},{"index":12,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the DeGette amendment No. 89 under the five-minute rule, pending a reservation of a point of order.","actionTimeStamp":"Thu, 26 Jan 2023 16:27:44 -0500"},{"index":13,"header":"--","actionItem":"An amendment, offered by Ms. DeGette,  numbered 89 printed in the Congressional Record to add a new subparagraph only allowing for a lease or permit if accompanied by a certification to the Secretary that it would not excessively increase the sales price of any petroleum products during a severe energy supply interruption or any period of decreased supply of petroleum products.","actionTimeStamp":"Thu, 26 Jan 2023 16:27:06 -0500"},{"index":14,"header":"--","actionItem":"Mr. Walberg raised a point of order against the Thompson (CA) amendment. Mr. Walberg stated that the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. The Chair sustained the point of order.","actionTimeStamp":"Thu, 26 Jan 2023 16:24:52 -0500"},{"index":15,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Thompson (CA) amendment No. 23 under the five-minute rule, pending a reservation of a point of order.","actionTimeStamp":"Thu, 26 Jan 2023 16:22:11 -0500"},{"index":16,"header":"--","actionItem":"An amendment, offered by Mr. Thompson (CA),  numbered 23 printed in the Congressional Record to change the short title to Strategic Production and Conservation Response Act and add conservation requirements to the plan.","actionTimeStamp":"Thu, 26 Jan 2023 16:21:43 -0500"},{"index":17,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Grijalva amendment No. 57, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Grijalva demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 16:20:47 -0500"},{"index":18,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Grijalva amendment No. 57 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 16:18:16 -0500"},{"index":19,"header":"--","actionItem":"An amendment, offered by Mr. Grijalva,  numbered 57 printed in the Congressional Record to exclude oil and gas leasing on any Federal lands that are viable for renewable energy production from the plan required in paragraph (1).","actionTimeStamp":"Thu, 26 Jan 2023 16:17:33 -0500"},{"index":20,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Grijalva amendment No. 56, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Grijalva demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 16:17:19 -0500"},{"index":21,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Grijalva amendment No. 56 under the five-minute rule. %kp1 %kp1","actionTimeStamp":"Thu, 26 Jan 2023 16:15:02 -0500"},{"index":22,"header":"--","actionItem":"An amendment, offered by Mr. Grijalva,  numbered 56 printed in the Congressional Record to exclude any oil and gas leasing on any Federal land where oil and gas leasing would result in or exacerbate disproportionate burdens on certain communities from the plan required by paragraph (1).","actionTimeStamp":"Thu, 26 Jan 2023 16:14:30 -0500"},{"index":23,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Grijalva amendment No. 55, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Grijalva demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 16:14:12 -0500"},{"index":24,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Grijalva amendment No. 55 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 16:11:50 -0500"},{"index":25,"header":"--","actionItem":"An amendment, offered by Mr. Grijalva,  numbered 55 printed in the Congressional Record to add a new paragraph at the end of the bill requiring a plan to consult with Tribal governments and other government officials to be included in the plan required by paragraph (1).","actionTimeStamp":"Thu, 26 Jan 2023 16:11:04 -0500"},{"index":26,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Grijalva amendment No. 55, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Levin demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 16:10:04 -0500"},{"index":27,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Levin amendment No. 21 under the five-minute rule, pending a reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 16:07:36 -0500"},{"index":28,"header":"--","actionItem":"An amendment, offered by Mr. Levin,  numbered 21 printed in the Congressional Record to limit Federal land from the plan if it would not provide a fair return taxpayers.","actionTimeStamp":"Thu, 26 Jan 2023 16:07:34 -0500"},{"index":29,"header":"--","actionItem":"Mr. Pallone raised a point of order against the Barr amendment. Mr. Pallone raised a point of order against the Barr amendment. Mr. Pallone stated that the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. The Chair sustained the point of order.","actionTimeStamp":"Thu, 26 Jan 2023 16:04:12 -0500"},{"index":30,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Barr amendment No. 48 under the five-minute rule, pending the reservation of a point of order.","actionTimeStamp":"Thu, 26 Jan 2023 15:59:28 -0500"},{"index":31,"header":"--","actionItem":"An amendment, offered by Mr. Barr,  numbered 48 printed in the Congressional Record to add a new section at the end of the bill Temporary Suspension of Certain Financial Regulations to limit access to financing for oil and gas companies until the date the amount of petroleum products in the Strategic Petroleum Reserve is equal to or greater than the amount on the day before the drawdown.","actionTimeStamp":"Thu, 26 Jan 2023 15:59:11 -0500"},{"index":32,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the DelBene amendment No. 7, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. DelBene demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 15:58:13 -0500"},{"index":33,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the DelBene amendment No. 7 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 15:52:53 -0500"},{"index":34,"header":"--","actionItem":"An amendment, offered by Ms. DelBene,  numbered 7 printed in the Congressional Record to add a new paragraph within section 2 excluding oil and gas leasing in any tract located in the Washington/Oregon planning area.","actionTimeStamp":"Thu, 26 Jan 2023 15:52:05 -0500"},{"index":35,"header":"POSTONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Levin amendment No. 18, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Levin demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 15:51:33 -0500"},{"index":36,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Levin amendment No. 18 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 15:47:36 -0500"},{"index":37,"header":"--","actionItem":"An amendment, offered by Mr. Levin,  numbered 18 printed in the Congressional Record to exclude oil and gas leasing in any tract located in the Southern California planning area.","actionTimeStamp":"Thu, 26 Jan 2023 15:47:03 -0500"},{"index":38,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Panetta amendment No. 26, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Panetta demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 15:46:28 -0500"},{"index":39,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Panetta amendment No. 26 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 15:42:23 -0500"},{"index":40,"header":"--","actionItem":"An amendment, offered by Mr. Panetta,  numbered 26 printed in the Congressional Record to add a new paragraph, Offshore Exclusions, which shall not include oil and gas leasing in any tract located in the Central California planning area.","actionTimeStamp":"Thu, 26 Jan 2023 15:42:09 -0500"},{"index":41,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Huffman amendment No. 65, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Huffman demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 15:41:23 -0500"},{"index":42,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Huffman amendment No. 15 under the five-minute rule, pending the reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 15:37:35 -0500"},{"index":43,"header":"--","actionItem":"An amendment, offered by Mr. Huffman,  numbered 65 printed in the Congressional Record to exclude any tract of Federal land where oil and gas leasing would decrease land and water available for outdoor recreation from the total increase in the percentage of Federal lands described in paragraph (1) leased for oil and gas production.","actionTimeStamp":"Thu, 26 Jan 2023 15:36:42 -0500"},{"index":44,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Huffman amendment No. 15, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Huffman demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 15:36:08 -0500"},{"index":45,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Huffman amendment No. 15 under the five-minute rule, pending the reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 15:32:27 -0500"},{"index":46,"header":"--","actionItem":"An amendment, offered by Mr. Huffman,  numbered 15 printed in the Congressional Record to add a new paragraph, Offshore Exclusions which shall not include oil and gas leasing in any tract located in the Northern California planning area.","actionTimeStamp":"Thu, 26 Jan 2023 15:32:02 -0500"},{"index":47,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Tlaib amendment No. 11, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Tlaib demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 15:31:20 -0500"},{"index":48,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Tlaib amendment No. 11 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 15:29:34 -0500"},{"index":49,"header":"--","actionItem":"An amendment, offered by Ms. Tlaib,  numbered 11 printed in the Congressional Record to add the Administrator of the Environmental Protection Agency and the Council on Environmental Quality to the list of officials to be consulted in the Compensatory Production Increase Plan.","actionTimeStamp":"Thu, 26 Jan 2023 15:29:18 -0500"},{"index":50,"header":"--","actionItem":"On agreeing to the Perry amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 15:28:43 -0500"},{"index":51,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Perry amendment No. 41 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 15:22:37 -0500"},{"index":52,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 41 printed in the Congressional Record to add a paragraph at the end of the bill that the plan required by paragraph (1) shall include a list of parcels planned to be offered for lease.","actionTimeStamp":"Thu, 26 Jan 2023 15:22:20 -0500"},{"index":53,"header":"--","actionItem":"Mr. Johnson (OH) raised a point of order against the Tlaib amendment. Mr. Johnson stated that the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. The Chair sustained the point of order.","actionTimeStamp":"Thu, 26 Jan 2023 15:20:16 -0500"},{"index":54,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Tlaib amendment No. 10 under the five-minute rule, pending a reservation of a point of order.","actionTimeStamp":"Thu, 26 Jan 2023 15:19:09 -0500"},{"index":55,"header":"--","actionItem":"An amendment, offered by Ms. Tlaib,  numbered 10 printed in the Congressional Record to add a new paragraph within section 2 titled \"Environmental Reviews\".","actionTimeStamp":"Thu, 26 Jan 2023 15:19:06 -0500"},{"index":56,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 15:18:49 -0500"},{"index":57,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Boebert amendment No. 137 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 15:11:39 -0500"},{"index":58,"header":"--","actionItem":"An amendment, offered by Mrs. Boebert,  numbered 137 printed in the Congressional Record to add a paragraph that the Secretary shall identify areas to lease within the approximately 224,793.73 acres, including approximately 200,518.28 acres of National Forest System lands, approximately 15,464.99 acres of public lands, and approximately 8,810.46 acres of reserved Federal mineral interest within the Thompson Divide area in Colorado.","actionTimeStamp":"Thu, 26 Jan 2023 15:11:36 -0500"},{"index":59,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Spanberger amendment No. 29, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Spanberger demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 15:11:07 -0500"},{"index":60,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Spanberger amendment No. 29 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 15:06:21 -0500"},{"index":61,"header":"--","actionItem":"An amendment, offered by Ms. Spanberger,  numbered 29 printed in the Congressional Record to add a new paragraph entitled Offshore Exclusion which shall not include oil and gas leasing in any tract located off the coast of Virginia.","actionTimeStamp":"Thu, 26 Jan 2023 15:05:58 -0500"},{"index":62,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Boebert amendment No. 33, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Pallone demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 15:05:15 -0500"},{"index":63,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Boebert amendment No. 33 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 14:56:34 -0500"},{"index":64,"header":"--","actionItem":"An amendment, offered by Mrs. Boebert,  numbered 33 printed in the Congressional Record to reduce the 10 percent leased for oil and gas production and increase it to 15 percent.","actionTimeStamp":"Thu, 26 Jan 2023 14:56:33 -0500"},{"index":65,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Soto amendment No. 44, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Soto demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 14:56:03 -0500"},{"index":66,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Soto amendment No. 44 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 14:52:00 -0500"},{"index":67,"header":"--","actionItem":"An amendment, offered by Mr. Soto,  numbered 44 printed in the Congressional Record to change the effective date to be the date the Secretary submits a certification to Congress that the price of gasoline and diesel fuel will not increase in any Petroleum Administration for Defense District.","actionTimeStamp":"Thu, 26 Jan 2023 14:51:39 -0500"},{"index":68,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 14:51:19 -0500"},{"index":69,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Boebert amendment No. 32 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 14:47:20 -0500"},{"index":70,"header":"--","actionItem":"An amendment, offered by Mrs. Boebert,  numbered 32 printed in the Congressional Record to add a new paragraph stating the Secretaries of various agencies shall submit to certain committees in Congress plans for Federal lands.","actionTimeStamp":"Thu, 26 Jan 2023 14:47:17 -0500"},{"index":71,"header":"--","actionItem":"On agreeing to the Cleaver amendment; Failed by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 14:46:58 -0500"},{"index":72,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Cleaver amendment No. 9 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 14:43:37 -0500"},{"index":73,"header":"--","actionItem":"An amendment, offered by Mr. Cleaver,  numbered 9 printed in the Congressional Record to add an additional limitation to when the Secretary may execute the first drawdown of petroleum products in the reserve.","actionTimeStamp":"Thu, 26 Jan 2023 14:43:34 -0500"},{"index":74,"header":"--","actionItem":"On agreeing to the Clyde amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 14:42:47 -0500"},{"index":75,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Clyde amendment No. 91 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 14:40:40 -0500"},{"index":76,"header":"--","actionItem":"An amendment, offered by Mr. Clyde,  numbered 91 printed in the Congressional Record to insert language stating the Secretary submit the developed plans to Congress.","actionTimeStamp":"Thu, 26 Jan 2023 14:40:37 -0500"},{"index":77,"header":"--","actionItem":"On agreeing to the Cleaver amendment; Failed by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 14:40:15 -0500"},{"index":78,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Cleaver amendment No. 8 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 14:37:45 -0500"},{"index":79,"header":"--","actionItem":"An amendment, offered by Mr. Cleaver,  numbered 8 printed in the Congressional Record to add the Administrator of the Environmental Protection Agency and Director of the Bureau of Indian Affairs to the list of officials to be consulted in the Compensatory Production Increase Plan.","actionTimeStamp":"Thu, 26 Jan 2023 14:37:42 -0500"},{"index":80,"header":"--","actionItem":"On agreeing to the LaLota amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 14:37:00 -0500"},{"index":81,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the LaLota amendment No. 143 under the five-minute rule, pending a reservation of a point of order, pending a reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 14:34:46 -0500"},{"index":82,"header":"--","actionItem":"An amendment, offered by Mr. LaLota,  numbered 143 printed in the Congressional Record to add a new section at the end of the bill titled No Effect on Existing Leasing Restrictions.","actionTimeStamp":"Thu, 26 Jan 2023 14:34:44 -0500"},{"index":83,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Blunt Rochester amendment No. 71, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Blunt Rochester demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 14:33:51 -0500"},{"index":84,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Blunt Rochester amendment No. 71 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 14:30:25 -0500"},{"index":85,"header":"--","actionItem":"An amendment, offered by Ms. Blunt Rochester,  numbered 71 printed in the Congressional Record to add a new section at the end Rule of Construction with Respect to Greenhouse Gas Emissions to provide that this Act not controvert United States commitment under the Paris Agreement.","actionTimeStamp":"Thu, 26 Jan 2023 14:30:18 -0500"},{"index":86,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Greene (GA) amendment No. 2, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Pallone demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 14:29:46 -0500"},{"index":87,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Greene (GA) amendment No. 2 under the five-minute rule, pending a reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 14:19:06 -0500"},{"index":88,"header":"--","actionItem":"An amendment, offered by Mrs. Greene (GA),  numbered 2 printed in the Congressional Record to make a technical correction to section 2, Compensatory Production Increase Plan.","actionTimeStamp":"Thu, 26 Jan 2023 14:18:56 -0500"},{"index":89,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Castor (FL) amendment No. 3, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Castor (FL) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 14:18:17 -0500"},{"index":90,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Castor (FL) amendment No. 3 under the five-minute rule, pending the reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 14:12:28 -0500"},{"index":91,"header":"--","actionItem":"An amendment, offered by Ms. Castor (FL),  numbered 3 printed in the Congressional Record to add a new paragraph within section 2 pertaining to offshore exclusions.","actionTimeStamp":"Thu, 26 Jan 2023 14:11:45 -0500"},{"index":92,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Mace amendment No. 133, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Pallone demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 14:10:50 -0500"},{"index":93,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Mace amendment No. 133 under the five-minute rule, pending the reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 14:06:59 -0500"},{"index":94,"header":"--","actionItem":"An amendment, offered by Ms. Mace,  numbered 133 printed in the Congressional Record to add a new section that nothing in this Act, shall affect any statutory or regulatory restrictions in effect on the date of enacment of this Act (including any withdrawal of Federal land) that may prohibit oil and gas leasing within the area designated as the South Atlantic Planning Area.","actionTimeStamp":"Thu, 26 Jan 2023 14:06:55 -0500"},{"index":95,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Pallone amendment No. 104, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Pallone demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 14:05:53 -0500"},{"index":96,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Pallone amendment No. 104 under the five-minute rule, pending the reservation of a point of order. Subsequently the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 14:01:17 -0500"},{"index":97,"header":"--","actionItem":"An amendment, offered by Mr. Pallone,  numbered 104 printed in the Congressional Record to add a paragraph Offshore Exclusions to exclude oil and gas leasing located in the North Atlantic Planning Area.","actionTimeStamp":"Thu, 26 Jan 2023 14:00:58 -0500"},{"index":98,"header":"--","actionItem":"On agreeing to the Gaetz amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 14:00:19 -0500"},{"index":99,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Gaetz amendment No. 1 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 13:53:02 -0500"},{"index":100,"header":"--","actionItem":"An amendment, offered by Mr. Gaetz,  numbered 1 printed in the Congressional Record to add a new section stating that nothing in the Act or amendments made by the Act shall affect the Presidential memorandum titled \"Memorandum on the Withdrawal of Certain Areas of the United States Outer Continental Shelf from Leasing Disposition\".","actionTimeStamp":"Thu, 26 Jan 2023 13:52:53 -0500"},{"index":101,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 21.","actionTimeStamp":"Thu, 26 Jan 2023 12:30:33 -0500"},{"index":102,"header":"--","actionItem":"The Speaker designated the Honorable David Rouzer to act as Chairman of the Committee.","actionTimeStamp":"Thu, 26 Jan 2023 12:29:37 -0500"},{"index":103,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 5 and Rule XVIII.","actionTimeStamp":"Thu, 26 Jan 2023 12:29:35 -0500"},{"index":104,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 5. H.R. 21 — \"To provide for the development of a plan to increase oil and gas production under oil and gas leases of Federal lands under the jurisdiction of the Secretary of Agriculture, the Secretary of Energy, the Secretary of the Interior, and the Secretary of Defense in conjunction with a drawdown of petroleum reserves from the Strategic Petroleum Reserve.\"","actionTimeStamp":"Thu, 26 Jan 2023 12:29:12 -0500"},{"index":105,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Thu, 26 Jan 2023 12:24:56 -0500"},{"index":106,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Thu, 26 Jan 2023 12:24:52 -0500"},{"index":107,"header":"--","actionItem":"Considered as privileged matter. H. Res. 60 — \"The title of this measure is not available.\"","actionTimeStamp":"Thu, 26 Jan 2023 12:24:27 -0500"},{"index":108,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches which by direction of the Chair, would be limited to 15 per side of the aisle.","actionTimeStamp":"Thu, 26 Jan 2023 12:02:36 -0500"},{"index":109,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Wilson of SC to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 26 Jan 2023 12:02:16 -0500"},{"index":110,"header":"--","actionItem":"The Speaker announced approval of the Journal. Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Thu, 26 Jan 2023 12:02:05 -0500"},{"index":111,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Thu, 26 Jan 2023 12:00:39 -0500"},{"index":112,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of January 26.","actionTimeStamp":"Thu, 26 Jan 2023 12:00:27 -0500"},{"index":113,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Thu, 26 Jan 2023 11:19:27 -0500"},{"index":114,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Thu, 26 Jan 2023 10:00:17 -0500"},{"index":115,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 26 Jan 2023 10:00:00 -0500"}]}