{"retrieved-date":"2024-12-13","actions-date":"Wednesday, December 11, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, December 11)","actionItem":"H.R. 5009 (Rep. Joyce):\n        A bill to reauthorize wildlife habitat and conservation programs, and for other purposes.\n\n        -- Message on House action received in Senate and at desk: House amendment to Senate amendment.\n\n\n H.R. 5301 (Rep. Garcia):\n        A bill to amend title 31, United States Code, to require agencies to include a list of outdated or duplicative reporting requirements in annual budget justifications, and for other purposes.\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 5646 (Rep. McBath):\n        A bill to amend the Higher Education Act of 1965 to require institutions of higher education to disclose hazing incidents, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 1351 (Sen. Merkley):\n        A bill to study and prevent child abuse in youth residential programs, and for other purposes.\n\n        -- Senate Committee on Health, Education, Labor, and Pensions discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3316 (Sen. Merkley):\n        In the nature of a substitute.\n\n        --Amendment SA 3316 proposed by Senator Merkley.\n\n        --Amendment SA 3316 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 5060 (Sen. Cornyn):\n        A bill to reauthorize the PROTECT Our Children Act of 2008, and for other purposes.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, December 11)","actionItem":"PN1789:\n        Lauren McGarity McFerran, of the District of Columbia, to be a Member of the National Labor Relations Board for the term of five years expiring December 16, 2029\n\n        -- Considered by Senate.\n\n        -- Cloture not invoked in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 320 \n\n\n\n PN1790:\n        Joshua L. Ditelberg, of Illinois, to be a Member of the National Labor Relations Board for the term of five years expiring December 16, 2027\n\n        -- Cloture motion withdrawn by unanimous consent in Senate.\n\n\n PN1827:\n        Noel Wise, of California, to be United States District Judge for the Northern District of California\n\n        -- By unanimous consent agreement, vote 12/11/2024.\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 47. Record Vote Number: 321 \n\n\n\n PN1980:\n        Matthew James Marzano, of Illinois, to be a Member of the Nuclear Regulatory Commission for the term of five years expiring June 30, 2028\n\n        -- By unanimous consent agreement, debate 12/11/2024.\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate 12/12/2024.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Manchin, at  7:17 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}