{"retrieved-date":"2025-12-9","actions-date":"Monday, December 8, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Thursday, December 4, 2025,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Thursday, December 4, 2025, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, December  8)","actionItem":"H.R. 4016 (Rep. Calvert):\n        A bill making appropriations for the Department of Defense for the fiscal year ending September 30, 2026, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n\n S. 2950 (Sen. Cornyn):\n        A bill to require the Secretary of State and relevant executive branch agencies to address international scam compounds defrauding people in the United States, to hold significant transnational criminal organizations accountable, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S.Res. 532 (Sen. Thune):\n        An executive resolution authorizing the en bloc consideration in Executive Session of certain nominations on the Executive Calendar.\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Voice Vote.\n\n        -- Measure laid before Senate by motion.\n\n        -- Cloture motion on the measure presented in Senate.\n\n\n S.Res. 535 (Sen. Cortez Masto):\n        A resolution commending and congratulating the Las Vegas Aces professional basketball team on winning the 2025 Women's National Basketball Association championship.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 536 (Sen. Risch):\n        A resolution designating December 2, 2025, as \"World Nuclear Energy Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Monday, December  8)","actionItem":"PN466-1:\n        Robert P. Chamberlin, of Mississippi, to be United States District Judge for the Northern District of Mississippi\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 44. Record Vote Number: 635 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate and vote 12/9/2025.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  6:50 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}