{"retrieved-date":"2024-6-19","actions-date":"Tuesday, June 18, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, June 18)","actionItem":"S. 870 (Sen. Peters):\n        A bill to authorize appropriations for the United States Fire Administration and firefighter assistance grant programs, to advance the benefits of nuclear energy, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Motion by Senator Schumer to concur in the House amendment to S. 870 made in Senate.\n\n        -- Senate agreed to the House amendments to S. 870 by Yea-Nay Vote. 88 - 2. Record Vote Number: 200","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, June 18)","actionItem":"PN1244:\n        Mustafa Taher Kasubhai, of Oregon, to be United States District Judge for the District of Oregon\n\n        -- Cloture motion withdrawn by unanimous consent in Senate.\n\n\n PN1353:\n        Katherine E. Oler, of the District of Columbia, to be an Associate Judge of the Superior Court of the District of Columbia for the term of fifteen years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 42. Record Vote Number: 199 \n\n\n\n PN1448:\n        Rear Adm. (lh) Luke A. Frost, in the Navy, to be Rear Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1449:\n        Rear Adm. (lh) Dennis E. Collins, in the Navy, to be Rear Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1450:\n        Rear Adm. (lh) Gregory K. Emery, in the Navy, to be Rear Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1451:\n        3 nominations in the Navy beginning with Rear Adm. (lh) Bradley D. Dunham and ending with Rear Adm. (lh) Douglas W. Sasse III\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1452:\n        Capt. Troy S. Pugh, in the Navy, to be Rear Admiral (lower half)\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1453:\n        2 nominations in the Navy beginning with Capt. Michael L. Freidberg and ending with Capt. Ryan K. Mahelona\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1454:\n        Capt. Shawn G. Denihan, in the Navy, to be Rear Admiral (lower half)\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1455:\n        Capt. Benjamin E. Baran, in the Navy, to be Rear Admiral (lower half)\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1456:\n        5 nominations in the Navy beginning with Capt. David N. Barnes and ending with Capt. Katie F. Sheldon\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1461:\n        Nancy L. Maldonado, of Illinois, to be United States Circuit Judge for the Seventh Circuit\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate 6/20/2024.\n\n\n PN1601-1:\n        190 nominations in the Army beginning with Anthony B. Abraham and ending with Brian K. Young\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1644:\n        9 nominations in the Army beginning with Kristin E. Agresta and ending with Emilee C. Venn\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1645:\n        9 nominations in the Army beginning with Barbara K. Bujak and ending with Joshua D. Walters\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1646:\n        46 nominations in the Army beginning with Lovie L. Abraham and ending with Michael T. Walkingstick\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1647:\n        30 nominations in the Army beginning with Marlene Ariasreynoso and ending with 0002516194\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1673:\n        13 nominations in the Navy beginning with Albert E. Arnold IV and ending with Justin R. Wiesen\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1674:\n        13 nominations in the Navy beginning with Gina M.D. Becker and ending with Anne L. Zack\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1675:\n        251 nominations in the Navy beginning with Allen M. Agor and ending with Steven Zielechowski\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1676:\n        4 nominations in the Navy beginning with Brian C. Earp and ending with Chad A. Redmer\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1677:\n        21 nominations in the Navy beginning with Travis J. Anderson and ending with Jeremy R. Woody\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1678:\n        12 nominations in the Navy beginning with Kitan Bae and ending with David T. Spalding\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1679:\n        4 nominations in the Navy beginning with Matthew S. Cushanick and ending with Jeffrey R. Portell\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1680:\n        10 nominations in the Navy beginning with Matthew P. Allan and ending with Christina J. Wong\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1681:\n        3 nominations in the Navy beginning with Anthony J. Falvo IV and ending with Hayley C. Sims\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1682:\n        7 nominations in the Navy beginning with Michael A. Freas and ending with Nicholas T. Walker\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1683:\n        4 nominations in the Navy beginning with Frank T. Borrego and ending with Gregory L. Tiner\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1684:\n        4 nominations in the Navy beginning with Kent L. Davis and ending with Travis L. Scott\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1685:\n        4 nominations in the Navy beginning with Zachary D. Harry and ending with Gregory B. Price\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1686:\n        6 nominations in the Navy beginning with Adam G. Borsman and ending with Dennis L. Richardson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1687:\n        Nathaniel D. Rightsell, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1688:\n        14 nominations in the Navy beginning with Justin K. Conroy and ending with Emmanuel M. Thomann\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1689:\n        11 nominations in the Navy beginning with Jonathan R. Alston and ending with Jonathan D. Tighe\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1713:\n        16 nominations in the Army beginning with Michael J. Browning and ending with 0002686492\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1714:\n        85 nominations in the Army beginning with Todd M. Anton and ending with 0002951212\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1720:\n        38 nominations in the Army beginning with Ryan H. Allred and ending with Brandon J. Wolf\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1725:\n        135 nominations in the Army beginning with Chad C. Adams and ending with 0002374957\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1726:\n        2 nominations in the Navy beginning with Scott F. Aldridge and ending with Michael P. Smith\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1727:\n        11 nominations in the Navy beginning with Kyle L. Anderson and ending with Craig A. Zecchin\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1728:\n        3 nominations in the Navy beginning with Daniel W. Berger and ending with Jared M. Stimson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1729:\n        4 nominations in the Navy beginning with Michael R. Basso and ending with Aaron D. Pickett\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1730:\n        Catherine E. Williams, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1731:\n        2 nominations in the Navy beginning with Sunghwan T. Choe and ending with Melanie A. Driver\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1732:\n        60 nominations in the Navy beginning with William L. Adkins and ending with David J. Willard\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1733:\n        15 nominations in the Navy beginning with Robert A. Bogan and ending with Robert D. Woodward\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1734:\n        6 nominations in the Navy beginning with Ronald L. James and ending with Daniel J. Woodard\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1735:\n        4 nominations in the Navy beginning with Michael A. Chinn and ending with Shane D. Uhlir\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1736:\n        Ryan T. Bangham, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1737:\n        3 nominations in the Navy beginning with Aaron J. Bedy and ending with Nicolas A. Melendez\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1738:\n        4 nominations in the Navy beginning with Vincent Deusanio, Jr. and ending with Stefan C. Yesko\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1739:\n        2 nominations in the Navy beginning with Robert J. Fleming and ending with Joseph J. Stewart\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1740:\n        2 nominations in the Navy beginning with Noreen P. Kirby and ending with Patrick D. Tackitt\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1741:\n        Bryon M. Lee, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1752:\n        Brig. Gen. Michael E. Conley, in the Air Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1753:\n        Maj. Gen. David H. Tabor, in the Air Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1754:\n        Maj. Gen. Thomas K. Hensley, in the Air Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1755:\n        Lt. Gen. Tony D. Bauernfeind, in the Air Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1757:\n        Lt. Gen. Sean C. Bernabe, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1759:\n        Rear Adm. Christopher C. French, in the Navy, to be Vice Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1760:\n        Rear Adm. Scott W. Pappano, in the Navy, to be Vice Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1761:\n        Rear Adm. Jeffrey T. Anderson, in the Navy, to be Vice Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1762:\n        Rear Adm. Nancy S. Lacore, in the Navy, to be Vice Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1763:\n        Col. Jorge M. Fonseca, in the Army, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1764:\n        Brig. Gen. Nicole M. Balliet, in the Army, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1765:\n        Col. Cindy M. Saladin-Muhammed, in the Army, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1766:\n        Brig. Gen. Thomas C. Friloux, in the Army, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1767:\n        Christopher J. Rollins, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1768:\n        Nyree Y. Watts, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1769:\n        Edward Y. Park, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1770:\n        Bridgette R. Bell, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1771:\n        Jamal D. Snell, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1772:\n        Terence W. Phillips II, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1773:\n        Zachary T. Goehler, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1774:\n        Keith M. Sanders, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1775:\n        Chelsea M. Truax, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1776:\n        Taylor B. Evans, in the Marine Corps, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1777:\n        Jacob C. Pipping, in the Marine Corps, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1778:\n        Shawn R. Loughman, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1779:\n        Hana Lee, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1780:\n        Timothy P. Fletcher, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1781:\n        5 nominations in the Navy beginning with Mark K. Anderson and ending with Gerald V. Weers\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1782:\n        21 nominations in the Navy beginning with Anastasia S. Abid and ending with Ashley L. Ward\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1783:\n        37 nominations in the Navy beginning with Adam D. Ahlstrom and ending with Jeremiah J. Zamora\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1792:\n        Col. Gordon R. Meyer, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1793:\n        Col. Carrie L. Perez, in the Army, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1794:\n        3 nominations in the Army beginning with Col. Adam K. Ake and ending with Col. John M. Dunn\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1795:\n        26 nominations in the Navy beginning with Warren K. Blackburn and ending with James L. Venckus\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1796:\n        15 nominations in the Navy beginning with John D. Ault and ending with Timothy A. Springer\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1797:\n        16 nominations in the Navy beginning with Aaron T. Allison and ending with Kristin B. Whitehouse\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1798:\n        22 nominations in the Navy beginning with Colleen C. Blosser and ending with Damian M. Storz\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1799:\n        15 nominations in the Navy beginning with Michael W. Bloomrose and ending with Matthew J. Wooten\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1800:\n        33 nominations in the Navy beginning with Garth W. Aldrich and ending with Emily L. Zywicke\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1801:\n        23 nominations in the Navy beginning with Ricardo M. Abakah and ending with Yu Zheng\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1802:\n        77 nominations in the Navy beginning with Thomas B. Ableman and ending with Jerry Yuan\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1810:\n        Maj. Gen. Joseph B. Berger III, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1811:\n        Brig. Gen. Robert A. Borcherding, in the Army, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1813:\n        Maj. Gen. Melvin G. Carter, in the Marine Corps, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1814:\n        Maj. Gen. Benjamin T. Watson, in the Marine Corps, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  7:22 p.m., the Senate adjourned, under its order of today, until 10 a.m. on Thursday, June 20, 2024.","actionTimeStamp":"--"}]}