{"retrieved-date":"2025-2-25","actions-date":"Tue, 25 Feb 2025 12:16:10 -0500","actions-title":"House Floor Proceedings","actions-count":15,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 161.","actionTimeStamp":"Tue, 25 Feb 2025 12:16:10 -0500"},{"index":2,"header":"--","actionItem":"Considered as privileged matter. H. Res. 161 — \"Providing for consideration of the joint resolution (H.J. Res. 20) providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Department of Energy relating to \"Energy Conservation Program: Energy Conservation Standards for Consumer Gas-fired Instantaneous Water Heaters\"; providing for consideration of the joint resolution (H.J. Res. 35) providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Environmental Protection Agency relating to \"Waste Emissions Charge for Petroleum and Natural Gas Systems: Procedures for Facilitating Compliance, Including Netting and Exemptions\";and providing for consideration of the concurrent resolution (H. Con. Res. 14) establishing the congressional budget for the United States Government for fiscal year 2025 and setting forth the appropriate budgetary levels for fiscal years 2026 through 2034.\"","actionTimeStamp":"Tue, 25 Feb 2025 12:13:01 -0500"},{"index":3,"header":"British-American Interparliamentary Group","actionItem":"Pursuant to 22 U.S.C. 276L, and the order of the House of January 3, 2025, the Speaker appointed the following members of the House to the British-American Interparliamentary Group: Mrs. Kim, Mr. Meuser, Mr. Aderholt, Mr. Smucker, Mr. Cole and Mr. Kean.","actionTimeStamp":"Tue, 25 Feb 2025 12:12:33 -0500"},{"index":4,"header":"Canada-United States Interparliamentary Group","actionItem":"Pursuant to 22 U.S.C. 276d, and the order of the House of January 3, 2025, the Speaker appointed the following member of the House to the Canada-United States Interparliamentary Group: Mr. Huizenga, Chair.","actionTimeStamp":"Tue, 25 Feb 2025 12:12:01 -0500"},{"index":5,"header":"Commission on Security and Cooperation in Europe","actionItem":"Pursuant to 22 U.S.C. 3003, and the order of the House of January 3, 2025, the Speaker appointed Mr. Wilson of South Carolina, Co-Chair.","actionTimeStamp":"Tue, 25 Feb 2025 12:11:41 -0500"},{"index":6,"header":"United States Holocaust Memorial Council","actionItem":"Pursuant to 36 U.S.C. 2302, and the order of the House of January 3, 2025, the Speaker appointed the following members of the House to the United States Holocaust Memorial Council: Mr. Kustoff, Mr. Bacon and Mr. Miller of Ohio.","actionTimeStamp":"Tue, 25 Feb 2025 12:11:14 -0500"},{"index":7,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches which by direction of the Chair, would be limited to 15 per side of the aisle.","actionTimeStamp":"Tue, 25 Feb 2025 12:02:14 -0500"},{"index":8,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. LaMalfa to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Tue, 25 Feb 2025 12:01:55 -0500"},{"index":9,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Tue, 25 Feb 2025 12:01:52 -0500"},{"index":10,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Tue, 25 Feb 2025 12:00:41 -0500"},{"index":11,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of February 25.","actionTimeStamp":"Tue, 25 Feb 2025 12:00:29 -0500"},{"index":12,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Tue, 25 Feb 2025 11:12:11 -0500"},{"index":13,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Tue, 25 Feb 2025 10:02:40 -0500"},{"index":14,"header":"--","actionItem":"The Speaker designated the Honorable Earl L. \"Buddy\" Carter to act as Speaker pro tempore for today.","actionTimeStamp":"Tue, 25 Feb 2025 10:02:31 -0500"},{"index":15,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Tue, 25 Feb 2025 10:00:00 -0500"}]}