{"retrieved-date":"2024-2-29","actions-date":"Tuesday, February 27, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, February 27)","actionItem":"S. 3412 (Sen. Warner):\n        A bill to redesignate the Richard H. Poff Federal Building located at 210 Franklin Road Southwest in Roanoke, Virginia, as the \"Reuben E. Lawson Federal Building\", and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 3570 (Sen. Capito):\n        A bill to designate the United States courthouse located at 500 West Pike Street in Clarksburg, West Virginia, as the \"Irene M. Keeley United States Courthouse\", and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 3577 (Sen. Ricketts):\n        A bill to designate the Federal building located at 300 E. 3rd Street in North Platte, Nebraska, as the \"Virginia Smith Federal Building\", and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 496 (Sen. Hyde-Smith):\n        A resolution designating September 2023 as \"National Cholesterol Education Month\" and September 30, 2023, as LDL-C Awareness Day.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, February 27)","actionItem":"PN671:\n        Cara L. Abercrombie, of Virginia, to be an Assistant Secretary of Defense\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1233:\n        Hampton Y. Dellinger, of North Carolina, to be Special Counsel, Office of Special Counsel, for the term of five years\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 46. Record Vote Number: 53 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 49 - 47. Record Vote Number: 54 \n\n\n\n PN1240:\n        Jacqueline Becerra, of Florida, to be United States District Judge for the Southern District of Florida\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 56 - 40. Record Vote Number: 50 \n\n\n\n PN1249:\n        David Seymour Leibowitz, of Florida, to be United States District Judge for the Southern District of Florida\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 64 - 33. Record Vote Number: 51 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 64 - 33. Record Vote Number: 52","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  7:26 p.m, the Presiding Officer (Mr. Kelly in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}