{"retrieved-date":"2025-12-18","actions-date":"Tuesday, December 16, 2025","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, December 16)","actionItem":"H.R. 131 (Rep. Boebert):\n        A bill to make certain modifications to the repayment for the Arkansas Valley Conduit in the State of Colorado.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n H.R. 187 (Rep. Moore):\n        A bill to provide for the standardization, consolidation, and publication of data relating to public outdoor recreational use of Federal waterways among Federal land and water management agencies, and for other purposes.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n H.R. 410 (Rep. Begich):\n        A bill to extend the Alaska Native Vietnam era veterans land allotment program, and for other purposes.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n H.R. 1043 (Rep. Gosar):\n        A bill to direct the Secretary of the Interior to convey certain Federal land in Arizona to La Paz County, Arizona, and for other purposes.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n S. 355 (Sen. Booker):\n        A bill to require the Secretary of Health and Human Services, acting through the Commissioner of Food and Drugs, to publish a final rule relating to nonclinical testing methods.\n\n        -- Senate Committee on Health, Education, Labor, and Pensions discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 4057 (Sen. Booker):\n        In the nature of a substitute.\n\n        --Amendment SA 4057 proposed by Senator Thune for Senator Booker.\n\n        --Amendment SA 4057 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 594 (Sen. Peters):\n        A bill to amend the Post-Katrina Management Reform Act of 2006 to repeal certain obsolete requirements, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 612 (Sen. Schatz):\n        A bill to amend the Native American Tourism and Improving Visitor Experience Act to authorize grants to Indian tribes, tribal organizations, and Native Hawaiian organizations, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 727 (Sen. Peters):\n        A bill to correct the inequitable denial of enhanced retirement and annuity benefits to certain U.S. Customs and Border Protection Officers.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 856 (Sen. Grassley):\n        A bill to amend the Lobbying Disclosure Act of 1995 to clarify a provision relating to certain contents of registrations under that Act.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 861 (Sen. Peters):\n        A bill to streamline the sharing of information among Federal disaster assistance agencies, to expedite the delivery of life-saving assistance to disaster survivors, to speed the recovery of communities from disasters, to protect the security and privacy of information provided by disaster survivors, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 865 (Sen. Peters):\n        A bill to amend the Lobbying Disclosure Act of 1995 to require certain disclosures by registrants regarding exemptions under the Foreign Agents Registration Act of 1938, as amended.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 1049 (Sen. Ossoff):\n        A bill to direct the Office for Victims of Crime of the Department of Justice to continue implementing the anti-trafficking recommendations of the Government Accountability Office and to report to Congress regarding such implementation.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 1071 (Sen. Cornyn):\n        A bill to require the Secretary of Veterans Affairs to disinter the remains of Fernando V. Cota from Fort Sam Houston National Cemetery, Texas, and for other purposes.\n\n        -- Considered by Senate (Message from the House considered).\n \n\n S.Amdt. 3961 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate (Message from the House considered).\n\n\n S.Amdt. 3962 (Sen. Thune):\n        To improve the bill.\n\n        --Considered by Senate (Message from the House considered).\n\n\n\n\n S. 3021 (Sen. Cornyn):\n        A bill to amend title 18, United States Code, to enhance enforcement with respect to material depicting obscene child sexual abuse or constituting child pornography, and for other purposes.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 3490 (Sen. Hawley):\n        A bill to establish the Fort Ontario Holocaust Refugee Shelter National Historical Park, to designate the America's National Churchill Museum National Historic Landmark, and for other purposes.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.\n\n\n S.Res. 546 (Sen. Rosen):\n        A resolution designating November 2025 as \"National Hospice and Palliative Care Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  7:53 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}