{"retrieved-date":"2025-11-5","actions-date":"Tuesday, November 4, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, November  4)","actionItem":"H.R. 5371 (Rep. Cole):\n        A bill making continuing appropriations and extensions for fiscal year 2026, and for other purposes .\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Eighth cloture motion on the motion to proceed to the measure not invoked in Senate by Yea-Nay Vote. 54 - 44. Record Vote Number: 603 \n\n\n\n S. 503 (Sen. Hickenlooper):\n        A bill to direct the Federal Communications Commission to evaluate and consider the impact of the telecommunications network equipment supply chain on the deployment of universal service, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 1872 (Sen. Ernst):\n        A bill to direct the Secretary of Commerce to conduct a study on the feasibility of manufacturing in the United States products for critical infrastructure sectors, and for other purposes .\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S.Res. 399 (Sen. Welch):\n        A resolution congratulating the people of North Macedonia on the 34th anniversary of their independence and celebrating the 30th anniversary of diplomatic relations between North Macedonia and the United States.\n\n        -- Senate Committee on Foreign Relations discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 459 (Sen. Daines):\n        A resolution honoring the strategic importance of the C5+1 diplomatic platform and recognizing the deepening partnership between the United States and the nations of Kazakhstan, Kyrgyzstan, Tajikistan, Turkmenistan, and Uzbekistan.\n\n        -- Senate Committee on Foreign Relations discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 482 (Sen. Ernst):\n        A resolution recognizing the week of November 3 through November 7, 2025, as \"National Veterans Small Business Week\" .\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, November  4)","actionItem":"PN400-1:\n        Joshua D. Dunlap, of Maine, to be United States Circuit Judge for the First Circuit\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 46. Record Vote Number: 604","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Ms. Lummis, at  7:26 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}