{"retrieved-date":"2022-12-22","actions-date":"Wednesday, December 21, 2022","actions-title":"Recent Floor Activity","actions-count":7,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday,the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, December 21)","actionItem":"H.R. 680 (Rep. Kuster):\n        A bill for the relief of Arpita Kurdekar, Girish Kurdekar, and Vandana Kurdekar.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 897 (Rep. Ruiz):\n        A bill to take certain lands in California into trust for the benefit of the Agua Caliente Band of Cahuilla Indians, and for other purposes.\n\n        -- Senate Committee on Indian Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 1154 (Rep. McEachin):\n        A bill to authorize the Secretary of the Interior to conduct a study to assess the suitability and feasibility of designatingcertain land as the Great Dismal Swamp National Heritage Area, and for other purposes.\n\n        -- Senate Committee on Environment and Public Works discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 2617 (Rep. Connolly):\n        A bill to amend section 1115 of title 31, United States Code, to amend the description of how performance goals are achieved, and for other purposes.\n\n        -- Considered by Senate (Message from the House considered).\n\n        -- Cloture motion on the motion to concur in the House amendment to Senate amendment SA 4 to H.R. 2617 with an amendment (SA 6552) presented in Senate\n \n\n S.Amdt. 6552 (Sen. Leahy):\n        In the nature of a substitute.\n\n        --Considered by Senate (Message from the House considered).\n\n\n S.Amdt. 6571 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate (Message from the House considered).\n\n\n S.Amdt. 6572 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate (Message from the House considered).\n\n\n S.Amdt. 6573 (Sen. Schumer):\n        To modify the effective date.\n\n        --Considered by Senate (Message from the House considered).\n\n\n S.Amdt. 6574 (Sen. Schumer):\n        To modify the effective date.\n\n        --Considered by Senate (Message from the House considered).\n\n\n\n\n H.Con.Res. 82 (Rep. Lofgren):\n        A concurrent resolution authorizing the printing of a revised and updated version of the House document entitled \"Black Americans in Congress, 1870-1989\".\n\n        -- Senate Committee on Rules and Administration discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment by Unanimous Consent.\n\n\n S. 1541 (Sen. Duckworth):\n        A bill to amend the Communications Act of 1934 to require the Federal Communications Commission to ensure just and reasonablecharges for telephone and advanced communications services in correctional and detention facilities.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 3405 (Sen. Blunt):\n        A bill to require the Federal Communications Commission to issue a rule providing that certain low power television stations may be accorded primary status as Class A television licensees, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 4240 (Sen. Grassley):\n        A bill to amend section 2441 of title 18, United States Code, to broaden the scope of individuals subject to prosecution forwar crimes.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n \n\n S.Amdt. 6590 (Sen. Durbin):\n        In the nature of a substitute.\n\n        --Amendment SA 6590 proposed by Senator Durbin.\n\n        --Amendment SA 6590 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 4439 (Sen. Padilla):\n        A bill to take certain Federal land located in Siskiyou County, California, and Humboldt County, California, into trust for the benefit of the Karuk Tribe, and for other purposes.\n\n        -- Senate Committee on Indian Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 4814 (Sen. Hickenlooper):\n        A bill to establish a demonstration program for the active remediation of orbital debris and to require the development of uniform orbital debris standard practices in order to support a safe and sustainable orbital environment, and for other purposes.\n\n        -- Senate Committee on Commerce, Science, and Transportation discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6619 (Sen. Hickenlooper):\n        In the nature of a substitute.\n\n        --Amendment SA 6619 proposed by Senator Baldwin for Senator Hickenlooper.\n\n        --Amendment SA 6619 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 472 (Sen. Menendez):\n        A resolution reaffirming the partnership between the United States and the Dominican Republic and advancing opportunities todeepen diplomatic, economic, and security cooperation between the two nations.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute withdrawn by Unanimous Consent.\n\n        -- Resolution agreed to in Senate with an amendment and with a preamble by Unanimous Consent.\n \n\n S.Amdt. 6614 (Sen. Menendez):\n        In the nature of a substitute.\n\n        --Amendment SA 6614 proposed by Senator Durbin for Senator Menendez.\n\n        --Amendment SA 6614 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 876 (Sen. Markey):\n        A resolution commemorating the 50th anniversary ofthe Coastal Zone Management Act of 1972, commonly known as the \"Coastal Zone Management Act\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, December 21)","actionItem":"PN1558:\n        L. Michelle Moore, of Georgia, to be a Member of the Board of Directors of the Tennessee Valley Authority for a term expiring May 18, 2026\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1560:\n        Robert P. Klein, of Tennessee, to be a Member of the Board of Directors of the Tennessee Valley Authority for a term expiring May 18, 2026\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1561:\n        Beth Pritchard Geer, of Tennessee, to be a Member of the Board of Directors of the Tennessee Valley Authority for a term expiring May 18, 2026\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1668:\n        Agnes Schaefer, of Pennsylvania, to be an Assistant Secretary of the Army\n\n        -- By unanimous consent agreement, debate and vote today.\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 68 - 26. Record Vote Number: 405 \n\n\n\n PN2130:\n        Alexis Taylor, of Iowa, to be Under Secretary of Agriculture for Trade and Foreign Agricultural Affairs\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2218:\n        William J. Renick, of Mississippi, to be a Member of the Board of Directors of the Tennessee Valley Authority for a term expiring May 18, 2027\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2219:\n        Adam Wade White, of Kentucky, to be a Member of the Board of Directors of the Tennessee Valley Authority for a term expiring May 18, 2027\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2426:\n        Joe H. Ritch, of Alabama, to be a Member of the Board of Directors of the Tennessee Valley Authority for a term expiring May 18, 2025\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2637:\n        Richard L. Revesz, of New York, to be Administrator of the Office of Information and Regulatory Affairs, Office of Management and Budget\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2668:\n        Lynne M. Tracy, of Ohio, to be Ambassador to the Russian Federation\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 93 - 2. Record Vote Number: 404","actionTimeStamp":"--"},{"index":6,"header":"Executive Business (Thursday, December 22)","actionItem":"PN912:\n        Howard A. Van Vranken, of California, to be Ambassador to the Republic of Botswana\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1540:\n        Jainey Kumar Bavishi, of New York, to be AssistantSecretary of Commerce for Oceans and Atmosphere\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1552:\n        Sara C. Bronin, of Connecticut, to be Chairman of the Advisory Council on Historic Preservation for a term expiring January 19, 2025\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1831:\n        Evelyn Wang, of Massachusetts, to be Director of the Advanced Research Projects Agency-Energy, Department of Energy\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2173:\n        Joey R. Hood, of New Hampshire, to be Ambassador to the Republic of Tunisia\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2200:\n        Sue Ellen Moore, of Washington, to be a Member of the Marine Mammal Commission for a term expiring May 13, 2023\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2201:\n        Andrew J. Read, of North Carolina, to be a Member of the Marine Mammal Commission for a term expiring May 13, 2025\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":7,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  2:01 a.m., the Senate adjourned, under its order of today, until  8 a.m. tomorrow.","actionTimeStamp":"--"}]}