{"retrieved-date":"2023-9-29","actions-date":"Thursday, September 28, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, September 28)","actionItem":"H.R. 3935 (Rep. Graves):\n        A bill to amend title 49, United States Code, to reauthorize and improve the Federal Aviation Administration and other civil aviation programs, and for other purposes.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 76 - 22. Record Vote Number: 241 \n\n\n        -- Measure laid before Senate by motion.\n\n        -- Motion by Senator Schumer to commit to Senate Committee on Commerce, Science, and Transportation with instructions to report back forthwith with the following amendment (SA 1294) made in Senate.\n\n        -- Cloture motion on measure presented in Senate.\n \n\n S.Amdt. 1293 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 1293 proposed by Senator Schumer to Amendment SA 1292.\n\n\n S.Amdt. 1294 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 1294 proposed by Senator Schumer.\n\n\n S.Amdt. 1295 (Sen. Schumer):\n        To modify the effective date.\n\n        --Amendment SA 1295 proposed by Senator Schumer to Amendment SA 1294 (the instructions of the motion to commit).\n\n\n\n\n S.J.Res. 9 (Sen. Marshall):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the United States Fish and Wildlife Service relating to \"Endangered and Threatened Wildlife and Plants; Lesser Prairie-Chicken; Threatened Status with Section 4(d) Rule for the Northern Distinct Population Segment and Endangered Status for the Southern Distinct Population Segment\".\n\n        -- Veto Message considered in Senate.\n\n        -- Failed of passage in Senate over veto by Yea-Nay Vote. 47 - 46. Record Vote Number: 242 \n\n\n\n S.J.Res. 24 (Sen. Mullin):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the United States Fish and Wildlife Service relating to \"Endangered and Threatened Wildlife and Plants; Endangered Species Status for Northern Long-Eared Bat\".\n\n        -- Veto Message considered in Senate.\n\n        -- Failed of passage in Senate over veto by Yea-Nay Vote. 47 - 45. Record Vote Number: 243 \n\n\n\n S.Res. 360 (Sen. Klobuchar):\n        A resolution designating the week of September 25 through September 29, 2023, as \"National Hazing Awareness Week\".\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, September 28)","actionItem":"PN67:\n        Robert G. Taub, of New York, to be a Commissioner of the Postal Regulatory Commission for a term expiring October 14, 2028\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1017:\n        Thomas G. Day, of Virginia, to be a Commissioner of the Postal Regulatory Commission for a term expiring October 14, 2028\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Recess","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  7:00 p.m., the Senate recessed, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}