{"retrieved-date":"2024-6-26","actions-date":"Wed, 26 Jun 2024 12:34:00 -0400","actions-title":"House Floor Proceedings","actions-count":35,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Clyde amendment No. 11.","actionTimeStamp":"Wed, 26 Jun 2024 12:34:00 -0400"},{"index":2,"header":"--","actionItem":"An amendment, offered by Mr. Clyde,  numbered 11 printed in Part C of House Report 118-559 to maintain FY24 enacted funding for CISA.","actionTimeStamp":"Wed, 26 Jun 2024 12:33:54 -0400"},{"index":3,"header":"--","actionItem":"On agreeing to the Cammack amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 12:28:08 -0400"},{"index":4,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Cammack amendment No. 9.","actionTimeStamp":"Wed, 26 Jun 2024 12:21:17 -0400"},{"index":5,"header":"--","actionItem":"An amendment, offered by Mrs. Cammack,  numbered 9 printed in Part C of House Report 118-559 to prohibit funds from being used to finalize any rule or regulation that has resulted in or is likely to result in an annual effect on the economy of $100 million or more.","actionTimeStamp":"Wed, 26 Jun 2024 12:21:13 -0400"},{"index":6,"header":"--","actionItem":"On agreeing to the Biggs amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 12:21:01 -0400"},{"index":7,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 5.","actionTimeStamp":"Wed, 26 Jun 2024 12:12:38 -0400"},{"index":8,"header":"--","actionItem":"An amendment, offered by Mr. Biggs,  numbered 5 printed in Part C of House Report 118-559 to prohibit the use of funds to implement the DHS rule titled \"Public Charge Ground of Inadmissibility.\"","actionTimeStamp":"Wed, 26 Jun 2024 12:12:35 -0400"},{"index":9,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Biggs amendment No. 4, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Underwood demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 26 Jun 2024 12:11:50 -0400"},{"index":10,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 4.","actionTimeStamp":"Wed, 26 Jun 2024 12:04:36 -0400"},{"index":11,"header":"--","actionItem":"An amendment, offered by Mr. Biggs,  numbered 4 printed in Part C of House Report 118-559 to prohibit funding to be used for the salary of the DHS Secretary, Alejandro Mayorkas.","actionTimeStamp":"Wed, 26 Jun 2024 12:04:14 -0400"},{"index":12,"header":"--","actionItem":"On agreeing to the Armstrong amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 12:03:45 -0400"},{"index":13,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of the Whole proceeded with 10 minutes of debate on the Armstrong amendment No. 1.","actionTimeStamp":"Wed, 26 Jun 2024 11:57:41 -0400"},{"index":14,"header":"--","actionItem":"An amendment, offered by Mr. Armstrong,  numbered 1 printed in Part C of House Report 118-559 to defund the implementation of COVID-19 era guidance reducing the hours of operation for CBP at certain Northern Border Ports of Entry to respond to a massive increase in border encounters and non-marijuana drug seizures in North Dakota, Idaho, Minnesota, and Western New York between FY21 and FY23, with adequate staffing and hours of operation to support interdiction and enforcement efforts at Northern Ports of Entry.","actionTimeStamp":"Wed, 26 Jun 2024 11:57:21 -0400"},{"index":15,"header":"--","actionItem":"On agreeing to the Amodei amendments; Agreed to by voice vote.","actionTimeStamp":"Wed, 26 Jun 2024 11:56:49 -0400"},{"index":16,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1316, the Committee of Whole proceeded with 20 minutes of debate on the Amodei en bloc amendment.","actionTimeStamp":"Wed, 26 Jun 2024 11:53:07 -0400"},{"index":17,"header":"--","actionItem":"Amendments en bloc  offered by Mr. Amodei,  comprised of the following amendments printed in Part C of House Report 118-559 as en bloc: Nos. 3, 6, 7, 8, 10, 13, 16, 17, 21, 22, 23, 24, 25, 26, 27, 28, 31, 33, 34, 35, 36, 40, 41, 47, 49, 51, 60, and 61.","actionTimeStamp":"Wed, 26 Jun 2024 11:51:58 -0400"},{"index":18,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 8752.","actionTimeStamp":"Wed, 26 Jun 2024 11:15:54 -0400"},{"index":19,"header":"--","actionItem":"The Speaker designated the Honorable Mariannette Miller-Meeks to act as Chairwoman of the Committee.","actionTimeStamp":"Wed, 26 Jun 2024 11:14:57 -0400"},{"index":20,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 1316 and Rule XVIII.","actionTimeStamp":"Wed, 26 Jun 2024 11:14:56 -0400"},{"index":21,"header":"--","actionItem":"Rule provides for consideration of H.R. 8774, H.R. 8771 and H.R. 8752. The resolution provides for consideration of H.R. 8774, H.R. 8771, and H.R. 8752, all under a structured rule. The resolution provides for one hour of general debate and one motion to recommit for each bill.","actionTimeStamp":"Wed, 26 Jun 2024 11:14:45 -0400"},{"index":22,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 1316. H.R. 8752 — \"Making appropriations for the Department of Homeland Security for the fiscal year ending September 30, 2025, and for other purposes.\"","actionTimeStamp":"Wed, 26 Jun 2024 11:14:40 -0400"},{"index":23,"header":"--","actionItem":"Mr. Amodei asked unanimous consent that when the House adjourns today, it adjourn to meet at 9:00 a.m. on June 27. Agreed to without objection.","actionTimeStamp":"Wed, 26 Jun 2024 11:14:20 -0400"},{"index":24,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Wed, 26 Jun 2024 11:09:08 -0400"},{"index":25,"header":"On agreeing to the resolution Agreed to by the Yeas and Nays: 207","actionItem":"201 (Roll no. 284).","actionTimeStamp":"Wed, 26 Jun 2024 11:09:06 -0400"},{"index":26,"header":"On ordering the previous question Agreed to by the Yeas and Nays: 188","actionItem":"152 (Roll no. 283).","actionTimeStamp":"Wed, 26 Jun 2024 10:55:20 -0400"},{"index":27,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 1316.","actionTimeStamp":"Wed, 26 Jun 2024 09:30:37 -0400"},{"index":28,"header":"UNANIMOUS CONSENT REQUEST","actionItem":"Mr. Austin Scott (GA) asked unanimous consent that the resolution be amended by adding at the end of the resolution section 18 stating notwithstanding any other provision of this resolution, during consideration of H.R. 8771 pursuant to this resolution, it shall not be in order to consider amendment number 37 printed in part B of House Report 118-559. Agreed to without objection.","actionTimeStamp":"Wed, 26 Jun 2024 09:28:54 -0400"},{"index":29,"header":"--","actionItem":"Considered as privileged matter. H. Res. 1316 — \"Providing for consideration of the bill (H.R. 8774) making appropriations for the Department of Defense for the fiscal year ending September 30, 2025, and for other purposes; providing for consideration of the bill (H.R. 8771) making appropriations for the Department of State, foreign operations, and related programs for the fiscal year ending September 30, 2025, and for other purposes; and providing for consideration of the bill (H.R. 8752) making appropriations for the Department of Homeland Security for the fiscal year ending September 30, 2025, and for other purposes.\"","actionTimeStamp":"Wed, 26 Jun 2024 09:16:47 -0400"},{"index":30,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches which by direction of the Chair, would be limited to 15 per side of the aisle.","actionTimeStamp":"Wed, 26 Jun 2024 09:02:50 -0400"},{"index":31,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Ms. Tlaib to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 26 Jun 2024 09:02:35 -0400"},{"index":32,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 26 Jun 2024 09:02:32 -0400"},{"index":33,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Wed, 26 Jun 2024 09:00:58 -0400"},{"index":34,"header":"--","actionItem":"The Speaker designated the Honorable Mark Alford to act as Speaker pro tempore for today.","actionTimeStamp":"Wed, 26 Jun 2024 09:00:48 -0400"},{"index":35,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 26 Jun 2024 09:00:00 -0400"}]}