{"retrieved-date":"2023-12-13","actions-date":"Wed, 13 Dec 2023 16:39:35 -0500","actions-title":"House Floor Proceedings","actions-count":44,"actions-list":[{"index":1,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is subject to the call of the Chair.","actionTimeStamp":"Wed, 13 Dec 2023 16:39:35 -0500"},{"index":2,"header":"--","actionItem":"At the conclusion of debate, the Yeas and Nays were demanded and ordered. Pursuant to the provisions of clause 8, rule XX, the Chair announced that further proceedings on the motion would be postponed.","actionTimeStamp":"Wed, 13 Dec 2023 16:39:05 -0500"},{"index":3,"header":"DEBATE","actionItem":"The House proceeded with forty minutes of debate on H.R. 2365.","actionTimeStamp":"Wed, 13 Dec 2023 16:02:27 -0500"},{"index":4,"header":"--","actionItem":"Considered under suspension of the rules.","actionTimeStamp":"Wed, 13 Dec 2023 16:02:25 -0500"},{"index":5,"header":"--","actionItem":"Mr. Bilirakis moved to suspend the rules and pass the bill, as amended. H.R. 2365 — \"To direct the Secretary of Health and Human Services to carry out a national project to prevent and cure Parkinson's, to be known as the National Parkinson's Project, and for other purposes.\"","actionTimeStamp":"Wed, 13 Dec 2023 16:00:24 -0500"},{"index":6,"header":"--","actionItem":"At the conclusion of debate, the Yeas and Nays were demanded and ordered. Pursuant to the provisions of clause 8, rule XX, the Chair announced that further proceedings on the motion would be postponed.","actionTimeStamp":"Wed, 13 Dec 2023 16:00:08 -0500"},{"index":7,"header":"DEBATE","actionItem":"The House proceeded with forty minutes of debate on H. Res. 927.","actionTimeStamp":"Wed, 13 Dec 2023 15:16:45 -0500"},{"index":8,"header":"--","actionItem":"Considered under suspension of the rules.","actionTimeStamp":"Wed, 13 Dec 2023 15:16:42 -0500"},{"index":9,"header":"--","actionItem":"Ms. Foxx moved to suspend the rules and agree to the resolution. H. Res. 927 — \"Condemning antisemitism on University campuses and the testimony of University Presidents in the House Committee on Education and the Workforce.\"","actionTimeStamp":"Wed, 13 Dec 2023 15:16:22 -0500"},{"index":10,"header":"--","actionItem":"The Speaker announced that votes on suspensions, if ordered, will be postponed until a time to be announced.","actionTimeStamp":"Wed, 13 Dec 2023 15:15:52 -0500"},{"index":11,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on H.R. 1147, the Chair put the question on passage and by voice vote, announced that the ayes had prevailed. Ms. Foxx demanded the yeas and nays and the chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 13 Dec 2023 15:15:15 -0500"},{"index":12,"header":"--","actionItem":"The House adopted the amendments en gross as agreed to by the Committee of the Whole House on the state of the Union.","actionTimeStamp":"Wed, 13 Dec 2023 15:14:14 -0500"},{"index":13,"header":"--","actionItem":"The previous question was ordered pursuant to the rule.","actionTimeStamp":"Wed, 13 Dec 2023 15:14:00 -0500"},{"index":14,"header":"--","actionItem":"The House rose from the Committee of the Whole House on the state of the Union to report H.R. 1147.","actionTimeStamp":"Wed, 13 Dec 2023 15:13:17 -0500"},{"index":15,"header":"--","actionItem":"On agreeing to the Tiffany amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 13 Dec 2023 15:12:42 -0500"},{"index":16,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 922, the Committee of the Whole proceeded with 10 minutes of debate on the Tiffany amendment No. 3.","actionTimeStamp":"Wed, 13 Dec 2023 15:05:06 -0500"},{"index":17,"header":"--","actionItem":"An amendment, offered by Mr. Tiffany,  numbered 3 printed in House Report 118-308 to prevent the United States Department of Agriculture from issuing any rule that bans varieties of milk covered in this bill, including chocolate milk.","actionTimeStamp":"Wed, 13 Dec 2023 15:04:53 -0500"},{"index":18,"header":"--","actionItem":"On agreeing to the Mills amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 13 Dec 2023 15:04:28 -0500"},{"index":19,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 922, the Committee of the Whole proceeded with 10 minutes of debate on the Mills amendment No. 2.","actionTimeStamp":"Wed, 13 Dec 2023 14:57:52 -0500"},{"index":20,"header":"--","actionItem":"An amendment, offered by Mr. Mills,  numbered 2 printed in House Report 118-308 to prohibit schools participating in the school lunch program from purchasing or offering milk produced by China state-owned enterprises.","actionTimeStamp":"Wed, 13 Dec 2023 14:57:42 -0500"},{"index":21,"header":"--","actionItem":"On agreeing to the Luna amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 13 Dec 2023 14:57:15 -0500"},{"index":22,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 922, the Committee of the Whole proceeded with 10 minutes of debate on the Luna amendment No. 1.","actionTimeStamp":"Wed, 13 Dec 2023 14:52:01 -0500"},{"index":23,"header":"--","actionItem":"An amendment, offered by Mrs. Luna,  numbered 1 printed in House Report 118-308 to ensure that the whole milk served in schools can be organic or non-organic.","actionTimeStamp":"Wed, 13 Dec 2023 14:51:47 -0500"},{"index":24,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 1147.","actionTimeStamp":"Wed, 13 Dec 2023 13:56:29 -0500"},{"index":25,"header":"--","actionItem":"The Speaker designated the Honorable Scott DesJarlais to act as Chairman of the Committee.","actionTimeStamp":"Wed, 13 Dec 2023 13:56:22 -0500"},{"index":26,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 922 and Rule XVIII.","actionTimeStamp":"Wed, 13 Dec 2023 13:56:21 -0500"},{"index":27,"header":"--","actionItem":"Rule provides for consideration of H.R. 1147 and H.R. 357. The resolution provides for consideration of H.R. 1147 under a structured rule with one hour of general debate and H.R. 357 under a closed rule with one hour of general debate. The resolution provides for a motion to recommit on both measures. It also provides that on any legislative day of the second session of the 118th Congress before January 9, 2024, the Speaker may dispense with organizational and legislative business and that the Journal of the proceedings of the previous day shall be considered as approved if applicable.","actionTimeStamp":"Wed, 13 Dec 2023 13:55:38 -0500"},{"index":28,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 922. H.R. 1147 — \"To amend the Richard B. Russell National School Lunch Act to allow schools that participate in the school lunch program under such Act to serve whole milk.\"","actionTimeStamp":"Wed, 13 Dec 2023 13:55:33 -0500"},{"index":29,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on H. Res. 918, the Chair put the question on ordering the previous question and by voice vote announced that the ayes prevailed. Mr. McGovern demanded the yeas and nays and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 13 Dec 2023 13:53:29 -0500"},{"index":30,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 918.","actionTimeStamp":"Wed, 13 Dec 2023 12:39:10 -0500"},{"index":31,"header":"--","actionItem":"Considered as privileged matter. H. Res. 918 — \"Directing certain committees to continue their ongoing investigations as part of the existing House of Representatives inquiry into whether sufficient grounds exist for the House of Representatives to exercise its Constitutional power to impeach Joseph Biden, President of the United States of America, and for other purposes.\"","actionTimeStamp":"Wed, 13 Dec 2023 12:26:21 -0500"},{"index":32,"header":"--","actionItem":"By direction of the Committee on Rules, Mr. Cole called up H. Res. 918 and asked for its immediate consideration.","actionTimeStamp":"Wed, 13 Dec 2023 12:26:19 -0500"},{"index":33,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Wed, 13 Dec 2023 12:25:13 -0500"},{"index":34,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Wed, 13 Dec 2023 12:25:09 -0500"},{"index":35,"header":"--","actionItem":"Considered as privileged matter. H. Res. 931 — \"Electing a Member to a certain standing committee of the House of Representatives.\"","actionTimeStamp":"Wed, 13 Dec 2023 12:24:44 -0500"},{"index":36,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches which by direction of the Chair, would be limited to 15 per side of the aisle.","actionTimeStamp":"Wed, 13 Dec 2023 12:03:01 -0500"},{"index":37,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Wilson of SC to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 13 Dec 2023 12:02:39 -0500"},{"index":38,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 13 Dec 2023 12:02:36 -0500"},{"index":39,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Wed, 13 Dec 2023 12:01:08 -0500"},{"index":40,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of December 13.","actionTimeStamp":"Wed, 13 Dec 2023 12:00:56 -0500"},{"index":41,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Wed, 13 Dec 2023 11:34:39 -0500"},{"index":42,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Wed, 13 Dec 2023 10:01:47 -0500"},{"index":43,"header":"--","actionItem":"The Speaker designated the Honorable Jerry L. Carl to act as Speaker pro tempore for today.","actionTimeStamp":"Wed, 13 Dec 2023 10:01:31 -0500"},{"index":44,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 13 Dec 2023 10:00:00 -0500"}]}