{"retrieved-date":"2023-6-8","actions-date":"Wednesday, June 7, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, June  7)","actionItem":"S.Res. 239 (Sen. Whitehouse):\n        A resolution designating May 2023 as \"ALS Awareness Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 240 (Sen. Cassidy):\n        A resolution designating June 8, 2023, as \"National Seersucker Day\", designating every Thursday after National Seersucker Day through the last Thursday in August 2023 as \"Seersucker Thursday\", and designating June 2023 as \"Seersucker Appreciation Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 241 (Sen. Tillis):\n        A resolution commending and congratulating the North Carolina Central University football team for winning the 2022 Historically Black Colleges and Universities National Football Championship in the 2022 Celebration Bowl.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, June  7)","actionItem":"PN18:\n        David Crane, of New Jersey, to be Under Secretary of Energy\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 56 - 43. Record Vote Number: 148 \n\n\n\n PN86:\n        Dale E. Ho, of New York, to be United States District Judge for the Southern District of New York\n\n        -- Cloture motion withdrawn by unanimous consent in Senate.\n\n\n PN99:\n        Dilawar Syed, of California, to be Deputy Administrator of the Small Business Administration\n\n        -- By unanimous consent agreement, vote 6/7/2023.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 54 - 44. Record Vote Number: 149 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, vote 6/8/2023.\n\n\n PN188:\n        William R. Hart, of New Hampshire, to be United States Marshal for the District of New Hampshire for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN192:\n        Justin L. Martinez, of Utah, to be United States Marshal for the District of Utah for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN294:\n        Shannon R. Saylor, of Virginia, to be United States Marshal for the Eastern District of Virginia for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN377:\n        Molly R. Silfen, of the District of Columbia, to be a Judge of the United States Court of Federal Claims for a term of fifteen years\n\n        -- By unanimous consent agreement, debate 6/7/2023.\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate and vote 6/8/2023.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  6:08 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}