{"retrieved-date":"2023-4-4","actions-date":"Thursday, March 30, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, March 30)","actionItem":"S. 659 (Sen. Grassley):\n        A bill to amend chapter 38 of title 31, United States Code, relating to civil remedies, and for other purposes .\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 777 (Sen. Tester):\n        A bill to increase, effective as of December 1, 2023, the rates of compensation for veterans with service-connected disabilities and the rates of dependency and indemnity compensation for the survivors of certain disabled veterans, and for other purposes .\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S. 870 (Sen. Peters):\n        A bill to amend the Federal Fire Prevention and Control Act of 1974 to authorize appropriations for the United States Fire Administration and firefighter assistance grant programs .\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Voice Vote.\n\n        -- Measure laid before Senate by motion.\n\n        -- Cloture motion on the measure presented in Senate.\n \n\n S.Amdt. 58 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 58 proposed by Senator Schumer.\n\n\n\n\n S.Res. 120 (Sen. Ernst):\n        A resolution designating March 23, 2023, as \"National Women in Agriculture Day\".\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 148 (Sen. Murkowski):\n        A resolution recognizing the heritage, culture, and contributions of American Indian, Alaska Native, and Native Hawaiian women in the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 149 (Sen. Tester):\n        A resolution designating the first week of April 2023 as \"National Asbestos Awareness Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.\n\n\n S.Res. 150 (Sen. Blackburn):\n        A resolution honoring the memories of the victims of the senseless attack at the Covenant School on March 27, 2023 .\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, March 30)","actionItem":"PN2:\n        Laura Taylor-Kale, of California, to be an Assistant Secretary of Defense\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 63 - 27. Record Vote Number: 82 \n\n\n\n PN5:\n        Radha Iyengar Plumb, of New York, to be a Deputy Under Secretary of Defense\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- By unanimous consent agreement, debate 4/17/2023.\n\n\n PN44:\n        Richard R. Verma, of Maryland, to be Deputy Secretary of State for Management and Resources\n\n        -- By unanimous consent agreement, debate and vote 3/30/2023.\n\n        -- Considered by Senate.\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 67 - 26. Record Vote Number: 81 \n\n\n\n PN69:\n        Amy Lefkowitz Solomon, of the District of Columbia , to be an Assistant Attorney General\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN238-1:\n        101 nominations in the Army beginning with Tolulope O. Akinsanya and ending with D016483\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN257:\n        Jason W. Price, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN312:\n        Shane K. Doty, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN313:\n        9 nominations in the Air Force beginning with Speight H. Caroon and ending with Teina D. Stallings Lilly\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN314:\n        Brandi Barnard King, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN315:\n        3 nominations in the Air Force beginning with Daniel S. Mcpherson and ending with Khurram M. Shahzad\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN316:\n        10 nominations in the Air Force beginning with Matthew J. Andrade and ending with Jill M. Thomas\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN317:\n        10 nominations in the Air Force beginning with Adam James Cole and ending with Mary Zachariah Kurian\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN318:\n        2 nominations in the Air Force beginning with Eric K. Wilke and ending with Ned L. Williams\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN319:\n        13 nominations in the Air Force beginning with Kelli M. Bermudez and ending with Jenny L. Wylie\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN320:\n        2 nominations in the Air Force beginning with Lisa Carol Giugliano and ending with Ryan Lee Rand\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN321:\n        7 nominations in the Air Force beginning with Joseph Catalino, Jr. and ending with Meiling C. Taylor\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN322:\n        9 nominations in the Air Force beginning with James M. Bershinsky and ending with Lisa Ann Seltman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN323:\n        2 nominations in the Air Force beginning with Gary Monroe Boutz, Jr. and ending with Jolana Ann Kubicek\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN324:\n        John Charles Easley, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN325:\n        37 nominations in the Air Force beginning with Robert M. Acosta and ending with Donna M. Whittaker\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN326:\n        2 nominations in the Air Force beginning with Nicole Dyan David and ending with Carrie L. Waltz\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN327:\n        7 nominations in the Air Force beginning with Karrie Megan Bem and ending with Jeffrey W. Scohy\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN328:\n        3 nominations in the Air Force beginning with Douglas A. Collins and ending with Jose Y. Munoz\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN329:\n        Marquis A. T. Smith, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN330:\n        61 nominations in the Air Force beginning with James D. Akers II and ending with Jonathan R. Zito\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN331:\n        31 nominations in the Air Force beginning with David I. Amar and ending with Shaun Michael Zabel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN332:\n        Sashi A. Zickefoose, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN333:\n        Howard F. Stanley, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN334:\n        Bobby J. Chun, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN335:\n        7 nominations in the Army beginning with Joshua G. Glonek and ending with Kelvin V. Simmons\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN337:\n        7 nominations in the Army beginning with Alex J. Duffy and ending with Devlin P. Winkelstein\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN338:\n        4 nominations in the Army beginning with Liza B. Crawford and ending with Derek A. Sanchez\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN339:\n        2 nominations in the Army beginning with Jeremy S. Stirm and ending with Julio Vera\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN340:\n        Renee R. Kiel, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN341:\n        2 nominations in the Army beginning with Melissa B . Riesterhartsell and ending with Thomas F. Robinson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN342:\n        Kimberly A. Dilger, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN343:\n        Abigail R. Osman, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN344:\n        Andrew J. Archuleta, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN345:\n        8 nominations in the Army beginning with Christopher C. Cross and ending with Jonathan D. Zagdanski\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN346:\n        37 nominations in the Army beginning with Michael J. Baierlein and ending with Eric D. Ziders\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN347:\n        575 nominations in the Army beginning with Austin P. Abarr and ending with D016809\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN348:\n        489 nominations in the Army beginning with James H . Abney and ending with D015738\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN349:\n        981 nominations in the Army beginning with Mitchell A. Ables and ending with D016368\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN350:\n        9 nominations in the Army beginning with Peter B. East and ending with Joel A. Smith\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN351:\n        William M. Schweitzer, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN353:\n        Louis V. Scott, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN380:\n        Maximilian S. Lee, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN381:\n        Justin J. Reeb, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN397:\n        Matthew J. Clementz, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN398:\n        Samuel T. Kramer, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN399:\n        Carla A. Kiernan, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN400:\n        John W. Brock II, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN404:\n        John D. Horton, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN405:\n        Joel N. Buffardi, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN406:\n        Sarah D. Eccleston, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN407:\n        Nicholas P. Fiebke, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN408:\n        Andrew J. Doyle, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN409:\n        William T. Griggs, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN410:\n        Megan L. Maloy, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN411:\n        Kaitlyn M. Hernandez, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN412:\n        15 nominations in the Army beginning with Timothy I. Arcelay and ending with Earl E. Weigelt\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN413:\n        Sara C. Adams, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN414:\n        Christina G. Nalley, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN415:\n        7 nominations in the Army beginning with Andrew Adamczyk and ending with Havard M. Whiles\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN416:\n        Ashley S. Lee, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN417:\n        Timothy W. Lindeman, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN418:\n        Ebony Q. Starr, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN419:\n        Sarah A. Delarosa, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN420:\n        Mark T. Sopkiw, Jr., in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN421:\n        Justin T. Thomas, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN422:\n        Rei T. Israel, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN423:\n        Adam L. Fox, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN424:\n        Jason L. Workman, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN425:\n        Stephen J. Cumby, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN426:\n        Stephen M. Anderson, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN427:\n        Elisabet Crumpler, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN428:\n        27 nominations in the Navy beginning with Kyle A. Aduskevich and ending with John M. Thorpe\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN429:\n        9 nominations in the Navy beginning with Bramwell B. Arnold III and ending with Dannie T. Stimson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN430:\n        34 nominations in the Navy beginning with Jeffery R. Biermann and ending with David A. Wakeman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN431:\n        James H. Knight, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN432:\n        9 nominations in the Space Force beginning with Ross M. Boston and ending with Robert F. Wojcik\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN433:\n        38 nominations in the Space Force beginning with Jason M. Adams and ending with Jonathan L. Whitaker\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN434:\n        68 nominations in the Space Force beginning with Christopher John Alban and ending with Costantinos Zagaris\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN435:\n        58 nominations in the Space Force beginning with Bridget L. Ajinga and ending with Brian K. Yoakam\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN436:\n        76 nominations in the Space Force beginning with John W. Anderson and ending with Abby Elizabeth Zven\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN437:\n        100 nominations in the Space Force beginning with Christina M. Akers and ending with Kathy E. Yorke\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN438:\n        2 nominations in the Space Force beginning with Cassandra R. Hidalgo and ending with Eric J. Perez\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN439:\n        Edward E. Jones, in the Space Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN463:\n        Daniel T. Turaj, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  3:26 p.m., the Senate adjourned, under its order of today, until 12 noon on Monday, April 3, 2023.","actionTimeStamp":"--"}]}