{"retrieved-date":"2024-1-23","actions-date":"Thursday, January 18, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, January 18)","actionItem":"H.R. 2872 (Rep. Graves):\n        To amend the Permanent Electronic Duck Stamp Act of 2013 to allow the Secretary of the Interior to issue electronic stamps under such Act, and for other purposes.\n\n        -- Considered by Senate.\n\n        -- Motion by Senator Marshall to commit to Senate Committee on Appropriations with instructions rejected in Senate by Yea-Nay Vote. 13 - 82. Record Vote Number: 11 \n\n\n        -- Passed Senate, under the order of 1/17/2024, having achieved 60 votes in the affirmative, with an amendment by Yea-Nay Vote. 77 - 18. Record Vote Number: 12 \n\n\n        -- Message on Senate action sent to the House.\n \n\n S.Amdt. 1381 (Sen. Murray):\n        In the nature of a substitute.\n\n        --Considered by Senate.\n\n        --Amendment SA 1381 agreed to in Senate by Unanimous Consent.\n\n\n S.Amdt. 1384 (Sen. Paul):\n        To limit foreign assistance to the Palestinian Authority or any other Palestinian governing entity in the West Bank and Gaza.\n\n        --Amendment SA 1384 proposed by Senator Paul to Amendment SA 1381.\n\n        --Amendment SA 1384, under the order of 1/17/2024, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 44 - 50. Record Vote Number: \n\n\n\n\n S.Res. 527 (Sen. Boozman):\n        A resolution to commend and congratulate the Harding University football team for winning the 2023 National Collegiate Athletic Association Division II national championship.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Con.Res. 25 (Sen. Murray):\n        A concurrent resolution providing for a correction in the enrollment of H.R. 2872.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, January 18)","actionItem":"PN13:\n        Joel Matthew Szabat, of Maryland, to be a Director of the Amtrak Board of Directors for a term of five years\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN14:\n        Anthony Rosario Coscia, of New Jersey, to be a Director of the Amtrak Board of Directors for a term of five years\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN15:\n        Christopher Koos, of Illinois, to be a Director of the Amtrak Board of Directors for a term of five years\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- By unanimous consent agreement, debate 1/22/2024.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  3:07 p.m, the Presiding Officer (Mr. Booker in the chair) declared the Senate adjourned, under its order of today, until  3 p.m. on Monday, January 22, 2024.","actionTimeStamp":"--"}]}