{"retrieved-date":"2023-3-1","actions-date":"Wed, 01 Mar 2023 09:20:10 -0500","actions-title":"House Floor Proceedings","actions-count":12,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 166, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 12.","actionTimeStamp":"Wed, 01 Mar 2023 09:20:10 -0500"},{"index":2,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 12 printed in House Report 118-4 to apply the bills requirements to all major Executive Orders which cause an annual gross budgetary effect of at least $1 million.","actionTimeStamp":"Wed, 01 Mar 2023 09:19:49 -0500"},{"index":3,"header":"--","actionItem":"On agreeing to the Omar amendment; Failed by voice vote.","actionTimeStamp":"Wed, 01 Mar 2023 09:19:32 -0500"},{"index":4,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 166, the Committee of the Whole proceeded with 10 minutes of debate on the Omar amendment No. 11.","actionTimeStamp":"Wed, 01 Mar 2023 09:13:20 -0500"},{"index":5,"header":"--","actionItem":"An amendment, offered by Ms. Omar,  numbered 11 printed in House Report 118-4 to require supplementary Genuine Progress Indicator (GPI) factors be considered and evaluated when assessing applicable major executive orders.","actionTimeStamp":"Wed, 01 Mar 2023 09:12:53 -0500"},{"index":6,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Wed, 01 Mar 2023 09:11:54 -0500"},{"index":7,"header":"--","actionItem":"Considered as unfinished business. H.R. 347 — \"To require the Executive Office of the President to provide an inflation estimate with respect to Executive orders with a significant effect on the annual gross budget, and for other purposes.\"","actionTimeStamp":"Wed, 01 Mar 2023 09:11:34 -0500"},{"index":8,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches which by direction of the Chair, would be limited to 5 per side of the aisle.","actionTimeStamp":"Wed, 01 Mar 2023 09:02:52 -0500"},{"index":9,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Ms. Garcia of TX to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 01 Mar 2023 09:02:37 -0500"},{"index":10,"header":"--","actionItem":"The Speaker announced approval of the Journal. Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 01 Mar 2023 09:02:19 -0500"},{"index":11,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Wed, 01 Mar 2023 09:00:33 -0500"},{"index":12,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 01 Mar 2023 09:00:00 -0500"}]}