{"retrieved-date":"2026-1-30","actions-date":"Thursday, January 29, 2026","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, January 29)","actionItem":"H.R. 7148 (Rep. Cole):\n        A bill making further consolidated appropriations for the fiscal year ending September 30, 2026, and for other purposes .\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Cloture on the motion to proceed to the measure not invoked in Senate by Yea-Nay Vote. 45 - 55. Record Vote Number: 13 \n\n\n        -- Motion by Senator Thune to reconsider the vote by which cloture on the motion to proceed to the measure was not invoked (Record Vote No. 13) entered in Senate.\n\n\n S.Res. 592 (Sen. Fischer):\n        A resolution supporting the designation of 2026 as the \"International Year of the Woman Farmer\" to recognize and honor the critical role of women in agriculture.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 593 (Sen. Marshall):\n        A resolution honoring the victims of the 2025 Potomac River mid-air collision.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 594 (Sen. Schmitt):\n        A resolution supporting the contributions of Catholic schools in the United States and celebrating the 52nd annual National Catholic Schools Week.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at 11:18 p.m., the Senate adjourned, under its order of today, until 11 a.m. tomorrow.","actionTimeStamp":"--"}]}