{"retrieved-date":"2024-5-7","actions-date":"Tue, 07 May 2024 13:13:20 -0400","actions-title":"House Floor Proceedings","actions-count":13,"actions-list":[{"index":1,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is subject to the call of the Chair.","actionTimeStamp":"Tue, 07 May 2024 13:13:20 -0400"},{"index":2,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on H. Res. 1194, the Chair put the question on ordering the previous question on H. Res. 1194, and by voice vote announced that the ayes prevailed. Mr. Neguse demanded the yeas and nays and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 07 May 2024 13:13:02 -0400"},{"index":3,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 1194.","actionTimeStamp":"Tue, 07 May 2024 12:23:03 -0400"},{"index":4,"header":"--","actionItem":"Considered as privileged matter. H. Res. 1194 — \"Providing for consideration of the bill (H.R. 6192) to amend the Energy Policy and Conservation Act to prohibit the Secretary of Energy from prescribing any new or amended energy conservation standard for a product that is not technologically feasible and economically justified, and for other purposes; providing for consideration of the bill (H.R. 7109) to require a citizenship question on the decennial census, to require reporting on certain census statistics, and to modify apportionment of Representatives to be based on United States citizens instead of all persons; providing for consideration of the joint resolution (H.J. Res. 109) providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Securities and Exchange Commission relating to \"Staff Accounting Bulletin No. 121\"; and providing for consideration of the bill (H.R. 2925) to amend the Omnibus Budget Reconciliation Act of 1993 to provide for security of tenure for use of mining claims for ancillary activities, and for other purposes.\"","actionTimeStamp":"Tue, 07 May 2024 12:18:35 -0400"},{"index":5,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches which by direction of the Chair, would be limited to 15 per side of the aisle.","actionTimeStamp":"Tue, 07 May 2024 12:03:07 -0400"},{"index":6,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Peters to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Tue, 07 May 2024 12:02:50 -0400"},{"index":7,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Tue, 07 May 2024 12:02:47 -0400"},{"index":8,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Tue, 07 May 2024 12:01:31 -0400"},{"index":9,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of May 7.","actionTimeStamp":"Tue, 07 May 2024 12:00:14 -0400"},{"index":10,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Tue, 07 May 2024 10:35:33 -0400"},{"index":11,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Tue, 07 May 2024 10:00:45 -0400"},{"index":12,"header":"--","actionItem":"The Speaker designated the Honorable Scott Franklin to act as Speaker pro tempore for today.","actionTimeStamp":"Tue, 07 May 2024 10:00:30 -0400"},{"index":13,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Tue, 07 May 2024 10:00:00 -0400"}]}