{"retrieved-date":"2025-5-20","actions-date":"Monday, May 19, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Thursday, May 15, 2025,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Thursday, May 15, 2025, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, May 19)","actionItem":"S. 1582 (Sen. Hagerty):\n        A bill to provide for the regulation of payment stablecoins, and for other purposes.\n\n        -- Second cloture motion on the motion to proceed invoked in Senate by Yea-Nay Vote. 66 - 32. Record Vote Number: 262 \n\n\n        -- Cloture motion on the motion to proceed rendered moot in Senate.\n\n        -- Motion by Senator Thune to reconsider the vote by which cloture on the motion to proceed to the measure was not invoked (Record Vote No. 240) rendered moot in Senate.\n\n\n S.Res. 143 (Sen. Fischer):\n        A resolution supporting the designation of May 29, 2025, as \"Mental Health Awareness in Agriculture Day\" to raise awareness around mental health in the agricultural industry and workforce and to continue to reduce stigma associated with mental illness.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 234 (Sen. Sullivan):\n        A resolution designating May 2, 2025, as \"United States Foreign Service Day\" in recognition of the men and women who have served, or are presently serving, in the Foreign Service of the United States, and honoring the members of the Foreign Service who have given their lives in the line of duty.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 235 (Sen. Wyden):\n        A resolution designating May 17, 2025, as \"Kids to Parks Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Monday, May 19)","actionItem":"PN24-4:\n        Charles Kushner, of New York, to be Ambassador to the French Republic, and to serve concurrently and without additional compensation as Ambassador to the Principality of Monaco\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 46. Record Vote Number: 260 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 45. Record Vote Number: 261","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  9:30 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}