{"retrieved-date":"2025-5-5","actions-date":"Thursday, May 1, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, May  1)","actionItem":"H.J.Res. 75 (Rep. Goldman):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Office of Energy Efficiency and Renewable Energy, Department of Energy relating to \"Energy Conservation Program: Energy Conservation Standards for Commercial Refrigerators, Freezers, and Refrigerator-Freezers\".\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 52 - 45. Record Vote Number: 228 \n\n\n        -- Message on Senate action sent to the House.\n\n\n S.J.Res. 31 (Sen. Curtis):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Environmental Protection Agency relating to \"Review of Final Rule Reclassification of Major Sources as Area Sources Under Section 112 of the Clean Air Act\".\n\n        -- Considered by Senate.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 52 - 46. Record Vote Number: 229 \n\n\n        -- Message on Senate action sent to the House.\n\n\n S.Res. 196 (Sen. Lankford):\n        A resolution congratulating the University of Oklahoma women's gymnastics team for winning the 2025 National Collegiate Athletic Association Championship, the seventh national title in program history.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 197 (Sen. Blumenthal):\n        A resolution commending and congratulating the University of Connecticut's women's basketball team for winning the 2025 National Collegiate Athletic Association Division I Women's Basketball National Championship.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, May  1)","actionItem":"PN20:\n        Frank Bisignano, of New Jersey, to be Commissioner of Social Security Administration for the term expiring January 19, 2031\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 45. Record Vote Number: 230 \n\n\n        -- By unanimous consent agreement, vote 5/6/2025.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Cornyn, at  3:23 p.m., the Senate adjourned, under its order of today, until  3 p.m. on Monday, May 5, 2025.","actionTimeStamp":"--"}]}