{"retrieved-date":"2023-3-22","actions-date":"Tuesday, March 21, 2023","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Friday, March 17, 2023,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Friday, March 17, 2023, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, March 21)","actionItem":"S. 30 (Sen. Tester):\n        A bill to authorize major medical facility projects for the Department of Veterans Affairs for fiscal year 2023, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 316 (Sen. Kaine):\n        A bill to repeal the authorizations for use of military force against Iraq.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 67 - 28. Record Vote Number: 63 \n\n\n        -- Measure laid before Senate by motion.\n \n\n S.Amdt. 15 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 15 proposed by Senator Schumer.\n\n\n\n\n S.Res. 116 (Sen. Grassley):\n        A resolution supporting the goals and ideals of \"Deep Vein Thrombosis and Pulmonary Embolism Awareness Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  7:25 p.m, the Presiding Officer (Mr. Kelly in the chair) declared the Senate adjourned, under its order of today, until 11 a.m. tomorrow.","actionTimeStamp":"--"}]}