{"retrieved-date":"2024-4-12","actions-date":"Fri, 12 Apr 2024 10:51:30 -0400","actions-title":"House Floor Proceedings","actions-count":17,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1137, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 1.","actionTimeStamp":"Fri, 12 Apr 2024 10:51:30 -0400"},{"index":2,"header":"--","actionItem":"An amendment, offered by Mr. Biggs,  numbered 1 printed in House Report 118-456 to prohibit warrantless searches of U.S. person communications in the FISA 702 database, with exceptions for imminent threats to life or bodily harm, consent searches, or known cybersecurity threat signatures.","actionTimeStamp":"Fri, 12 Apr 2024 10:51:03 -0400"},{"index":3,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 7888.","actionTimeStamp":"Fri, 12 Apr 2024 09:41:47 -0400"},{"index":4,"header":"--","actionItem":"The Speaker designated the Honorable Daniel Meuser to act as Chairman of the Committee.","actionTimeStamp":"Fri, 12 Apr 2024 09:40:24 -0400"},{"index":5,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 1137 and Rule XVIII.","actionTimeStamp":"Fri, 12 Apr 2024 09:40:23 -0400"},{"index":6,"header":"--","actionItem":"Rule provides for consideration of H.R. 7888, H.R. 529, H. Res. 1112 and H. Res. 1117. The resolution provides for consideration of H.R. 7888 under a structured rule and H.R. 529, H. Res. 1112, and H. Res. 1117 each under a closed rule. Rule provides for one hour of general debate on H.R. 7888, H.R. 529, H. Res. 1112, and H. Res. 1117. Motion to recommit allowed on H.R. 7888 and H.R. 529.","actionTimeStamp":"Fri, 12 Apr 2024 09:39:58 -0400"},{"index":7,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 1137. H.R. 7888 — \"To reform the Foreign Intelligence Surveillance Act of 1978.\"","actionTimeStamp":"Fri, 12 Apr 2024 09:39:53 -0400"},{"index":8,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Fri, 12 Apr 2024 09:35:51 -0400"},{"index":9,"header":"On agreeing to the resolution Agreed to by recorded vote: 213","actionItem":"208 (Roll no. 113).","actionTimeStamp":"Fri, 12 Apr 2024 09:35:50 -0400"},{"index":10,"header":"On ordering the previous question Agreed to by the Yeas and Nays: 208","actionItem":"202 (Roll no. 112).","actionTimeStamp":"Fri, 12 Apr 2024 09:25:39 -0400"},{"index":11,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 1137.","actionTimeStamp":"Fri, 12 Apr 2024 08:10:45 -0400"},{"index":12,"header":"--","actionItem":"Considered as privileged matter. H. Res. 1137 — \"Providing for consideration of the bill (H.R. 7888) to reform the Foreign Intelligence Surveillance Act of 1978; providing for consideration of the bill (H.R. 529) to extend the customs waters of the United States from 12 nautical miles to 24 nautical miles from the baselines of the United States, consistent with Presidential Proclamation 7219; providing for consideration of the resolution (H. Res. 1112) denouncing the Biden administration's immigration policies; and providing for consideration of the resolution (H. Res. 1117) opposing efforts to place one-sided pressure on Israel with respect to Gaza.\"","actionTimeStamp":"Fri, 12 Apr 2024 08:05:48 -0400"},{"index":13,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Neguse to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Fri, 12 Apr 2024 08:04:44 -0400"},{"index":14,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Fri, 12 Apr 2024 08:04:41 -0400"},{"index":15,"header":"--","actionItem":"Today's prayer was offered by Rev. Robert Suhr, Christ Church, Mequon, Wisconsin.","actionTimeStamp":"Fri, 12 Apr 2024 08:02:17 -0400"},{"index":16,"header":"--","actionItem":"The Speaker designated the Honorable Dan Newhouse to act as Speaker pro tempore for today.","actionTimeStamp":"Fri, 12 Apr 2024 08:02:09 -0400"},{"index":17,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Fri, 12 Apr 2024 08:00:00 -0400"}]}