{"retrieved-date":"2024-5-9","actions-date":"Wednesday, May 8, 2024","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, May  8)","actionItem":"H.R. 3935 (Rep. Graves):\n        A bill to amend title 49, United States Code, to reauthorize and improve the Federal Aviation Administration and other civil aviation programs, and for other purposes.\n\n        -- Considered by Senate.\n\n        -- Motion to table the motion by Senator Schumer to commit the bill (H.R. 3935) to Senate Committee on Commerce, Science, and Transportation with instructions to report back forthwith with amendment SA 2027 rejected in Senate by Yea-Nay Vote. 12 - 85. Record Vote Number: 160 \n\n \n\n S.Amdt. 1911 (Sen. Cantwell):\n        In the nature of a substitute.\n\n        --Considered by Senate.\n\n\n S.Amdt. 2026 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate.\n\n\n S.Amdt. 2027 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate.\n\n\n S.Amdt. 2028 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate.\n\n\n S.Amdt. 2029 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate.\n\n\n\n\n S. 2195 (Sen. Carper):\n        A bill to amend the Energy Policy Act of 2005 to reauthorize the diesel emissions reduction program.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 2861 (Sen. Gillibrand):\n        A bill to award a Congressional Gold Medal to Billie Jean King, an American icon, in recognition of a remarkable life devoted to championing equal rights for all, in sports and in society.\n\n        -- Senate Committee on Banking, Housing, and Urban Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 3791 (Sen. Carper):\n        A bill to reauthorize the America's Conservation Enhancement Act, and for other purposes.\n\n        -- Passed Senate with an amendment by Voice Vote.\n\n\n S.Res. 677 (Sen. Brown):\n        A resolution recognizing the roles and contributions of the teachers of the United States in building and enhancing the civic, cultural, and economic well-being of the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 678 (Sen. Sullivan):\n        A resolution designating May 3, 2024, as \"United States Foreign Service Day\" in recognition of the men and women who have served, or are presently serving, in the Foreign Service of the United States, and honoring the members of the Foreign Service who have given their lives in the line of duty.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 679 (Sen. Cornyn):\n        A resolution expressing support for the goals and ideals of National Child Abuse Prevention Month.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Con.Res. 36 (Sen. Schatz):\n        A concurrent resolution authorizing the use of Emancipation Hall in the Capitol Visitor Center for an event to celebrate the birthday of King Kamehameha I.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  6:58 p.m., the Senate adjourned, under its order of today, until 12 noon tomorrow.","actionTimeStamp":"--"}]}