{"retrieved-date":"2025-5-16","actions-date":"Wednesday, May 14, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday,the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, May 14)","actionItem":"S. 195 (Sen. Blackburn):\n        A bill to amend the Visit America Act to promote music tourism, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 260 (Sen. Duckworth):\n        A bill to amend the Bottles and Breastfeeding Equipment Screening Act to require hygienic handling of breast milk and baby formula by security screening personnel of the Transportation SecurityAdministration and personnel of private security companies providing security screening, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 178 (Sen. Cornyn):\n        A resolution honoring the life and legacy of the late George Foreman.\n\n        -- The preamble was amended after adoption by Unanimous Consent.\n \n\n S.Amdt. 2227 (Sen. Cornyn):\n        To amend the preamble.\n\n        --Amendment SA 2227 proposed by Senator Thune for Senator Cornyn.\n\n        --Amendment SA 2227 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 228 (Sen. Moran):\n        A resolution supporting May 2, 2025, as \"National Space Day\" in recognition of the significant positive impact the aerospace community has and will continue to have on the United States of America.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 229 (Sen. Thune):\n        A resolution to authorize the production of records by the Committee on Foreign Relations.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 230 (Sen. Barrasso):\n        A resolution supporting the goals and ideals of National Hospital Week, to be observed from May 11 through May 17, 2025.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, May 14)","actionItem":"PN12-31:\n        Emil Michael, of Florida, to be Under Secretary ofDefense for Research and Engineering\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 43. Record Vote Number: 253 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 54 - 43. Record Vote Number: 254 \n\n\n\n PN12-38:\n        Michael Rigas, of Virginia, to be Deputy Secretaryof State for Management and Resources\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 45. Record Vote Number: 251 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 46. Record Vote Number: 252 \n\n\n\n PN13-10:\n        Katharine MacGregor, of Florida, to be Deputy Secretary of the Interior\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 54 - 40. Record Vote Number: 250 \n\n\n\n PN25-11:\n        Sean Donahue, of Florida, to be an Assistant Administrator of the Environmental Protection Agency\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 47. Record Vote Number: 257 \n\n\n        -- Considered by Senate.\n\n\n PN26-46:\n        Eric Matthew Ueland, of Virginia, to be Deputy Director for Management, Office of Management and Budget\n\n        -- By unanimous consent agreement, mandatory quroum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 45. Record Vote Number: 255 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 45. Record Vote Number: 256 \n\n\n\n PN41:\n        3 nominations in the Marine Corps beginning with Michael J. Dilling and ending with Melaine D. Weaver\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN46:\n        3 nominations in the Marine Corps beginning with Ryan S. Dean and ending with Daniel B. Krake\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN63:\n        13 nominations in the Air Force beginning with Teresa A. Bonzani and ending with Onier Villarreal Alejandro\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN64:\n        8 nominations in the Air Force beginning with Laurel M. Chiaramonte and ending with Patricia A. Wilkinson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN65:\n        6 nominations in the Air Force beginning with Isreal Bennett, Jr. and ending with Christopher L. Suhr\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN66:\n        4 nominations in the Air Force beginning with Jameson C. Durham and ending with Julia K. Wriglesworth\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN67:\n        12 nominations in the Air Force beginning with James N. Bond and ending with Robert D. Rose\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN68:\n        55 nominations in the Air Force beginning with Bruce A. Abbott and ending with Christine Lauren Zmuda\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN69:\n        311 nominations in the Air Force beginning with Danielle D. Acacio and ending with Sidney E. Zven\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN70:\n        2 nominations in the Air Force beginning with Caroline G. Ferris and ending with Suzanne Pristau\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN71:\n        10 nominations in the Air Force beginning with Dominic S. Angiollo and ending with Hanna Yang\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN72:\n        8 nominations in the Air Force beginning with Jeffrey A. Ballou and ending with Brandon E. Stephens\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN73:\n        7 nominations in the Air Force beginning with Steven D. Alaniz and ending with Patrick M. Ralph\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN74:\n        Vincent T. Chiappone, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN75:\n        2 nominations in the Air Force beginning with David A. Fishman and ending with Jason M. Selleck\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN76:\n        36 nominations in the Air Force beginning with Ross E. Agee and ending with Joseph C. Wilson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN77:\n        14 nominations in the Air Force beginning with Melinda C. Albiston and ending with Jamie M. Szmodis\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN78:\n        4 nominations in the Air Force beginning with Scott W. Bohn and ending with Eugene C. Richter\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN79:\n        40 nominations in the Air Force beginning with Ronald S. Adams and ending with Matthew G. Zellner\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN80:\n        John K. Lee, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN81:\n        2 nominations in the Air Force beginning with AdamJ. Polozola and ending with Navdeep Singh\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN82:\n        18 nominations in the Air Force beginning with Jenara L. Allen and ending with Brent J. Winward\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN83:\n        55 nominations in the Air Force beginning with Hattie Dawn Alexander and ending with Joe X. Zhang\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN84:\n        Cody W. Clark, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN85:\n        40 nominations in the Air Force beginning with Michael Bartels and ending with Zachary N. Zischang\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN86:\n        9 nominations in the Air Force beginning with Steven A. Brown and ending with Jessica H. Schafer\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN87:\n        Angela C. Lipovsky, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN88:\n        49 nominations in the Air Force beginning with Daniel J. Arneson and ending with Chip R. Yde\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN90:\n        5 nominations in the Army beginning with Brenton D. Groeneveld and ending with Shawn L. Tabankin\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN91:\n        6 nominations in the Army beginning with Robert R.Andersen III and ending with Janel R. Wiese\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN92:\n        11 nominations in the Army beginning with Joseph M. Byrd and ending with Scott A. Wells\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN93:\n        8 nominations in the Army beginning with Andrew S.Brennan and ending with Scott E. Thompson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN94:\n        Virginia A. Emery, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN95:\n        5 nominations in the Army beginning with Raymond L. Ayers and ending with Steven W. Timm\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN96:\n        Stephanie M. Waddell, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN97:\n        Matthew I. Fine, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN102:\n        3 nominations in the Marine Corps beginning with Phillip S. Noack and ending with Jennifer M. Raymond\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN104:\n        Freddie F. Martinez, in the Marine Corps, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN105:\n        Jeremy C. Hawkins, in the Marine Corps, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN106:\n        Justin R. McCann, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN107:\n        Joel C. Nienaber, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN108:\n        87 nominations in the Navy beginning with Gieorag M. Andrews and ending with Daniel S. Yassuda\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN109:\n        James W. Gorman, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN110:\n        Ian G. Aucoin, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN111:\n        Christopher H. Elliott, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN112:\n        Karlie M. Blake, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN113:\n        Jeffrey J. Kim, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN114:\n        John O. Mansolillo, in the Coast Guard, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  9:39 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}