{"retrieved-date":"2024-6-13","actions-date":"Thu, 13 Jun 2024 17:33:49 -0400","actions-title":"House Floor Proceedings","actions-count":89,"actions-list":[{"index":1,"header":"On agreeing to the Norman amendment (A018) Roll Call 267","actionItem":"Recorded vote pending.","actionTimeStamp":"Thu, 13 Jun 2024 17:33:49 -0400"},{"index":2,"header":"--","actionItem":"Pursuant to clause 6(h) of rule XVIII, the votes of the Delegates and Resident Commissioner were decisive on the previous vote and a separate vote in the House was required.","actionTimeStamp":"Thu, 13 Jun 2024 17:32:11 -0400"},{"index":3,"header":"--","actionItem":"Pursuant to clause 6(h) of rule XVIII, the Committee rose.","actionTimeStamp":"Thu, 13 Jun 2024 17:31:34 -0400"},{"index":4,"header":"--","actionItem":"On agreeing to the Norman amendment; Failed by recorded vote: (Roll no. 266).","actionTimeStamp":"Thu, 13 Jun 2024 17:31:10 -0400"},{"index":5,"header":"--","actionItem":"On agreeing to the Grothman amendment; Agreed to by recorded vote: (Roll no. 265).","actionTimeStamp":"Thu, 13 Jun 2024 17:23:29 -0400"},{"index":6,"header":"--","actionItem":"On agreeing to the Gaetz amendment; Failed by recorded vote: (Roll no. 264).","actionTimeStamp":"Thu, 13 Jun 2024 17:19:53 -0400"},{"index":7,"header":"--","actionItem":"On agreeing to the Van Duyne amendment; Agreed to by recorded vote: (Roll no. 263).","actionTimeStamp":"Thu, 13 Jun 2024 17:16:34 -0400"},{"index":8,"header":"--","actionItem":"On agreeing to the Rosendale amendment; Agreed to by recorded vote: (Roll no. 262).","actionTimeStamp":"Thu, 13 Jun 2024 17:12:16 -0400"},{"index":9,"header":"--","actionItem":"On agreeing to the Greene (GA) amendment; Failed by recorded vote: (Roll no. 261).","actionTimeStamp":"Thu, 13 Jun 2024 17:08:26 -0400"},{"index":10,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Thu, 13 Jun 2024 16:31:45 -0400"},{"index":11,"header":"--","actionItem":"Considered as unfinished business. H.R. 8070 — \"To authorize appropriations for fiscal year 2025 for military activities of the Department of Defense, for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\"","actionTimeStamp":"Thu, 13 Jun 2024 16:31:16 -0400"},{"index":12,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of June 13.","actionTimeStamp":"Thu, 13 Jun 2024 16:31:15 -0400"},{"index":13,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is subject to the call of the Chair.","actionTimeStamp":"Thu, 13 Jun 2024 16:04:30 -0400"},{"index":14,"header":"--","actionItem":"Committee of the Whole House on the state of the Union rises leaving H.R. 8070 as unfinished business.","actionTimeStamp":"Thu, 13 Jun 2024 16:04:15 -0400"},{"index":15,"header":"--","actionItem":"On motion that the committee rise Agreed to by voice vote.","actionTimeStamp":"Thu, 13 Jun 2024 16:04:11 -0400"},{"index":16,"header":"--","actionItem":"Mr. Rogers (AL) moved that the committee rise.","actionTimeStamp":"Thu, 13 Jun 2024 16:04:10 -0400"},{"index":17,"header":"--","actionItem":"On agreeing to the Luna amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 13 Jun 2024 16:04:02 -0400"},{"index":18,"header":"UNANIMOUS CONSENT REQUEST","actionItem":"Mr. Smith (WA) asked unanimous consent that the request for a recorded vote on amendment No. 47 be withdrawn to the end and that the amendment stand disposed of by the earlier voice vote theron. Agreed to without objection.","actionTimeStamp":"Thu, 13 Jun 2024 16:04:00 -0400"},{"index":19,"header":"--","actionItem":"On agreeing to the Rogers (AL) amendments; Agreed to by voice vote.","actionTimeStamp":"Thu, 13 Jun 2024 16:03:52 -0400"},{"index":20,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1287, the Committee of the Whole proceeded with 40 minutes of debate on the Rogers (AL) amendment en bloc No. 3.","actionTimeStamp":"Thu, 13 Jun 2024 16:02:38 -0400"},{"index":21,"header":"--","actionItem":"Amendments en bloc  offered by Mr. Rogers (AL),  comprised of the following amendments printed in Part B of House Report 118-551 as en bloc No. 3: Nos. 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 229, 230, 231, 232, 233, and 234.","actionTimeStamp":"Thu, 13 Jun 2024 16:02:33 -0400"},{"index":22,"header":"--","actionItem":"On agreeing to the Rogers (AL) amendments; Agreed to by voice vote.","actionTimeStamp":"Thu, 13 Jun 2024 16:01:06 -0400"},{"index":23,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1287, the Committee of the Whole proceeded with 40 minutes of debate on the Rogers (AL) amendment en bloc No. 2.","actionTimeStamp":"Thu, 13 Jun 2024 15:41:27 -0400"},{"index":24,"header":"--","actionItem":"Amendments en bloc  offered by Mr. Rogers (AL),  comprised of the following amendments printed in Part B of House Report 118-551 as en bloc No. 2: Nos. 4, 9, 10, 18, 38, 39, 57, 58, 61, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, and 176.","actionTimeStamp":"Thu, 13 Jun 2024 15:41:18 -0400"},{"index":25,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Van Duyne amendment No. 55, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Ms. Van Duyne demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jun 2024 15:39:23 -0400"},{"index":26,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1287, the Committee of the Whole proceeded with 10 minutes of debate on the Van Duyne amendment No. 55.","actionTimeStamp":"Thu, 13 Jun 2024 15:27:18 -0400"},{"index":27,"header":"--","actionItem":"An amendment, offered by Ms. Van Duyne,  numbered 55 printed in Part B of House Report 118-551 to prohibit the Secretary of Defense from paying for or reimbursing expenses relating to abortion services.","actionTimeStamp":"Thu, 13 Jun 2024 15:27:16 -0400"},{"index":28,"header":"--","actionItem":"On agreeing to the Brecheen amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 13 Jun 2024 15:27:03 -0400"},{"index":29,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1287, the Committee of the Whole proceeded with 10 minutes of debate on the Brecheen amendment No. 54.","actionTimeStamp":"Thu, 13 Jun 2024 15:19:31 -0400"},{"index":30,"header":"--","actionItem":"An amendment, offered by Mr. Brecheen,  numbered 54 printed in Part B of House Report 118-551 to prohibit funding in this Act for drag shows, drag queen story hours, and similar events.","actionTimeStamp":"Thu, 13 Jun 2024 15:19:27 -0400"},{"index":31,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Norman amendment No. 53, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Smith (WA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jun 2024 15:18:36 -0400"},{"index":32,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1287, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 53.","actionTimeStamp":"Thu, 13 Jun 2024 15:07:24 -0400"},{"index":33,"header":"--","actionItem":"An amendment, offered by Mr. Norman,  numbered 53 printed in Part B of House Report 118-551 to prohibit the provision of gender transition procedures, including surgery or medication, through the Exceptional Family Medical Program.","actionTimeStamp":"Thu, 13 Jun 2024 15:07:22 -0400"},{"index":34,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Rosendale amendment No. 52, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Smith (WA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jun 2024 15:06:55 -0400"},{"index":35,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1287, the Committee of the Whole proceeded with 10 minutes of debate on the Rosendale amendment No. 52.","actionTimeStamp":"Thu, 13 Jun 2024 14:55:31 -0400"},{"index":36,"header":"--","actionItem":"An amendment, offered by Mr. Rosendale,  numbered 52 printed in Part B of House Report 118-551 to prohibit TRICARE from covering and the Department of Defense from furnishing gender transition surgeries and gender hormone treatments for individuals that identify as transgender.","actionTimeStamp":"Thu, 13 Jun 2024 14:55:29 -0400"},{"index":37,"header":"--","actionItem":"On agreeing to the Ogles amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 13 Jun 2024 14:55:16 -0400"},{"index":38,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1287, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 51.","actionTimeStamp":"Thu, 13 Jun 2024 14:50:05 -0400"},{"index":39,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 51 printed in Part B of House Report 118-551 to prohibit mask mandates to prevent the spread of COVID-19 on a military installation in the United States.","actionTimeStamp":"Thu, 13 Jun 2024 14:50:03 -0400"},{"index":40,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Waltz amendment No. 50, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Smith (WA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jun 2024 14:49:34 -0400"},{"index":41,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1287, the Committee of the Whole proceeded with 10 minutes of debate on the Waltz amendment No. 50.","actionTimeStamp":"Thu, 13 Jun 2024 14:38:26 -0400"},{"index":42,"header":"--","actionItem":"An amendment, offered by Mr. Waltz,  numbered 50 printed in Part B of House Report 118-551 to create sex-neutral physical fitness standards for combat MOS' and to add 2 additional combat MOSs.","actionTimeStamp":"Thu, 13 Jun 2024 14:38:22 -0400"},{"index":43,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Mills amendment No. 49, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Smith (WA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jun 2024 14:37:22 -0400"},{"index":44,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1287, the Committee of the Whole proceeded with 10 minutes of debate on the Mills amendment No. 49.","actionTimeStamp":"Thu, 13 Jun 2024 14:26:34 -0400"},{"index":45,"header":"--","actionItem":"An amendment, offered by Mr. Mills,  numbered 49 printed in Part B of House Report 118-551 to strike an exemption that allows military chain of command or senior civilian leadership to approve the display of unapproved flags at military installations.","actionTimeStamp":"Thu, 13 Jun 2024 14:26:32 -0400"},{"index":46,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Boebert amendment No. 48, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Tokuda demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jun 2024 14:26:07 -0400"},{"index":47,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1287, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 48.","actionTimeStamp":"Thu, 13 Jun 2024 14:14:51 -0400"},{"index":48,"header":"--","actionItem":"An amendment, offered by Ms. Boebert,  numbered 48 printed in Part B of House Report 118-551 to prohibit federal funding for the Countering Extremist Activity Working Group or implement any recommendations from the group.","actionTimeStamp":"Thu, 13 Jun 2024 14:14:49 -0400"},{"index":49,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Luna amendment No. 47, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Smith (WA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jun 2024 14:14:24 -0400"},{"index":50,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1287, the Committee of the Whole proceeded with 10 minutes of debate on the Luna amendment No. 47.","actionTimeStamp":"Thu, 13 Jun 2024 14:02:43 -0400"},{"index":51,"header":"--","actionItem":"An amendment, offered by Mrs. Luna,  numbered 47 printed in Part B of House Report 118-551 to prohibit the promotion of critical race theory and associated race-based theories.","actionTimeStamp":"Thu, 13 Jun 2024 14:02:40 -0400"},{"index":52,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Steube amendment No. 46, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Smith (WA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jun 2024 14:02:09 -0400"},{"index":53,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1287, the Committee of the Whole proceeded with 10 minutes of debate on the Steube amendment No. 46.","actionTimeStamp":"Thu, 13 Jun 2024 13:51:29 -0400"},{"index":54,"header":"--","actionItem":"An amendment, offered by Mr. Steube,  numbered 46 printed in Part B of House Report 118-551 to prohibit the Department of Defense Education Activity from purchasing, displaying, or maintaining material that promotes gender ideology or pornographic content.","actionTimeStamp":"Thu, 13 Jun 2024 13:51:02 -0400"},{"index":55,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Williams (TX) amendment No. 45, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Smith (WA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jun 2024 13:50:27 -0400"},{"index":56,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1287, the Committee of the Whole proceeded with 10 minutes of debate on the Williams (TX) amendment No. 45.","actionTimeStamp":"Thu, 13 Jun 2024 13:38:35 -0400"},{"index":57,"header":"--","actionItem":"An amendment, offered by Mr. Williams (TX),  numbered 45 printed in Part B of House Report 118-551 to prohibit funding of companies who function to demonetize domestic entities based on their lawful speech.","actionTimeStamp":"Thu, 13 Jun 2024 13:38:08 -0400"},{"index":58,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Clyde amendment No. 44, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. McClellan demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jun 2024 13:37:44 -0400"},{"index":59,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1287, the Committee of the Whole proceeded with 10 minutes of debate on the Clyde amendment No. 44.","actionTimeStamp":"Thu, 13 Jun 2024 13:26:27 -0400"},{"index":60,"header":"--","actionItem":"An amendment, offered by Mr. Clyde,  numbered 44 printed in Part B of House Report 118-551 to relocate the Reconciliation Memorial, also known as the Reconciliation Monument, to its original location in Arlington National Cemetery.","actionTimeStamp":"Thu, 13 Jun 2024 13:26:05 -0400"},{"index":61,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Higgins (LA) amendment No. 43, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. McClellan demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jun 2024 13:25:44 -0400"},{"index":62,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1287, the Committee of the Whole proceeded with 10 minutes of debate on the Higgins (LA) amendment No. 43.","actionTimeStamp":"Thu, 13 Jun 2024 13:14:09 -0400"},{"index":63,"header":"--","actionItem":"An amendment, offered by Mr. Higgins (LA),  numbered 43 printed in Part B of House Report 118-551 to eliminate the position of Chief Diversity Officer of the Department of Defense and prohibit the establishment of any substantially similar position.","actionTimeStamp":"Thu, 13 Jun 2024 13:13:44 -0400"},{"index":64,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Norman amendment No. 42, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. McClellan demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jun 2024 13:13:21 -0400"},{"index":65,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1287, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 42.","actionTimeStamp":"Thu, 13 Jun 2024 13:00:59 -0400"},{"index":66,"header":"--","actionItem":"An amendment, offered by Mr. Norman,  numbered 42 printed in Part B of House Report 118-551 to eliminate any offices of Diversity, Equity, and Inclusion within the Armed Forces and Department of Defense along with the personnel in said offices.","actionTimeStamp":"Thu, 13 Jun 2024 13:00:39 -0400"},{"index":67,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Grothman amendment No. 41, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. McClellan demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jun 2024 13:00:11 -0400"},{"index":68,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1287, the Committee of the Whole proceeded with 10 minutes of debate on the Grothman amendment No. 41.","actionTimeStamp":"Thu, 13 Jun 2024 12:51:28 -0400"},{"index":69,"header":"--","actionItem":"An amendment, offered by Mr. Grothman,  numbered 41 printed in Part B of House Report 118-551 to establish a permanent hiring freeze for diversity, equity, and inclusion jobs in the Department of Defense.","actionTimeStamp":"Thu, 13 Jun 2024 12:50:57 -0400"},{"index":70,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Gaetz amendment No. 40, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Mr. Gaetz demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jun 2024 12:50:37 -0400"},{"index":71,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1287, the Committee of the Whole proceeded with 10 minutes of debate on the Gaetz amendment No. 40.","actionTimeStamp":"Thu, 13 Jun 2024 12:40:18 -0400"},{"index":72,"header":"--","actionItem":"An amendment, offered by Mr. Gaetz,  numbered 40 printed in Part B of House Report 118-551 to prohibit the transfer of cluster munitions.","actionTimeStamp":"Thu, 13 Jun 2024 12:39:51 -0400"},{"index":73,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Greene (GA) amendment No. 37, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Ms. Greene (GA) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 13 Jun 2024 12:39:18 -0400"},{"index":74,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 1287, the Committee of the Whole proceeded with 10 minutes of debate on the Greene (GA) amendment No. 37.","actionTimeStamp":"Thu, 13 Jun 2024 12:27:03 -0400"},{"index":75,"header":"--","actionItem":"An amendment, offered by Ms. Greene (GA),  numbered 37 printed in Part B of House Report 118-551 to provide that none of the funds made available by this Act may be used for assistance to Ukraine.","actionTimeStamp":"Thu, 13 Jun 2024 12:26:34 -0400"},{"index":76,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Thu, 13 Jun 2024 12:25:27 -0400"},{"index":77,"header":"--","actionItem":"Considered as unfinished business. H.R. 8070 — \"To authorize appropriations for fiscal year 2025 for military activities of the Department of Defense, for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\"","actionTimeStamp":"Thu, 13 Jun 2024 12:25:08 -0400"},{"index":78,"header":"The Speaker laid before the House a message from the President transmitting a notification stating that the national emergency with respect to Belarus that was declared in Executive Order 13405 of June 16, 2006, which was expanded in scope in Executive Order 14038 of August 9, 2021, is to continue in effect beyond June 16, 2024.","actionItem":"referred to the Committee on Foreign Affairs and ordered to be printed (H. Doc. 118-148).","actionTimeStamp":"Thu, 13 Jun 2024 12:23:35 -0400"},{"index":79,"header":"The Speaker laid before the House a message from the President transmitting a notification stating that the national emergency with respect to the Western Balkans that was declared in Executive Order 13219 of June 26, 2001, under which additional steps were taken in Executive Order 13304 of May 28, 2003, and which was expanded in scope in Executive Order 14033 of June 8, 2021, is to continue in effect beyond June 26, 2024.","actionItem":"referred to the Committee on Foreign Affairs and ordered to be printed (H. Doc. 118-147).","actionTimeStamp":"Thu, 13 Jun 2024 12:21:46 -0400"},{"index":80,"header":"The Speaker laid before the House a message from the President transmitting a notification stating that the national emergency with respect to North Korea that was declared in Executive Order 13466 of June 26, 2008, expanded in scope in Executive Order 13551 of August 30, 2010, addressed further in Executive Order 13570 of April 18, 2011, further expanded in scope in Executive Order 13687 of January 2, 2015, and under which additonal steps were taken in Executive Order 13722 of March 15, 2016, and Executive Order 13810 of September 20, 2017, is to continue in effect beyond June 26, 2024.","actionItem":"referred to the Committee on Foreign Affairs and ordered to be printed (H. Doc. 118-146).","actionTimeStamp":"Thu, 13 Jun 2024 12:20:21 -0400"},{"index":81,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair would be limited to 15 per side of the aisle.","actionTimeStamp":"Thu, 13 Jun 2024 12:02:34 -0400"},{"index":82,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Wenstrup to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 13 Jun 2024 12:02:13 -0400"},{"index":83,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Thu, 13 Jun 2024 12:02:10 -0400"},{"index":84,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Thu, 13 Jun 2024 12:00:17 -0400"},{"index":85,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of June 13.","actionTimeStamp":"Thu, 13 Jun 2024 12:00:00 -0400"},{"index":86,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Thu, 13 Jun 2024 11:25:52 -0400"},{"index":87,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Thu, 13 Jun 2024 10:02:39 -0400"},{"index":88,"header":"--","actionItem":"The Speaker designated the Honorable Jefferson Van Drew to act as Speaker pro tempore for today.","actionTimeStamp":"Thu, 13 Jun 2024 10:02:20 -0400"},{"index":89,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 13 Jun 2024 10:00:00 -0400"}]}