{"retrieved-date":"2025-4-8","actions-date":"Tue, 08 Apr 2025 13:13:50 -0400","actions-title":"House Floor Proceedings","actions-count":15,"actions-list":[{"index":1,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is subject to the call of the Chair.","actionTimeStamp":"Tue, 08 Apr 2025 13:13:50 -0400"},{"index":2,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on H. Res. 294, the Chair put the question on ordering the previous question and by voice vote announced that the ayes had prevailed. Mr. McGovern demanded the yeas and nays and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Tue, 08 Apr 2025 13:13:30 -0400"},{"index":3,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 294.","actionTimeStamp":"Tue, 08 Apr 2025 12:14:30 -0400"},{"index":4,"header":"--","actionItem":"Considered as privileged matter. H. Res. 294 — \"Providing for consideration of the joint resolution (S.J. Res. 18) disapproving the rule submitted by the Bureau of Consumer Financial Protection relating to \"Overdraft Lending: Very Large Financial Institutions\"; providing for consideration of the joint resolution (S.J. Res. 28) disapproving the rule submitted by the Bureau of Consumer Financial Protection relating to \"Defining Larger Participants of a Market for General-Use Digital Consumer Payment Applications\"; providing for consideration of the bill (H.R. 1526) to amend title 28, United States Code, to limit the authority of district courts to provide injunctive relief, and for other purposes; providing for consideration of the bill (H.R. 22) to amend the National Voter Registration Act of 1993 to require proof of United States citizenship to register an individual to vote in elections for Federal office, and for other purposes; and for other purposes.\"","actionTimeStamp":"Tue, 08 Apr 2025 12:11:17 -0400"},{"index":5,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches which by direction of the Chair, would be limited to 15 per side of the aisle.","actionTimeStamp":"Tue, 08 Apr 2025 12:04:42 -0400"},{"index":6,"header":"NOTIFICATION OF INTENT TO OFFER MOTION TO DISCHARGE","actionItem":"Ms. Pettersen notified the House of her intent to offer a motion to discharge the Committee on Rules pursuant to clause 2(c) of rule XV. The Chair announced that the House will entertain the gentlewoman's motion within two legislative days.","actionTimeStamp":"Tue, 08 Apr 2025 12:03:00 -0400"},{"index":7,"header":"--","actionItem":"The House received a message from the Senate. The Senate agreed to S. Res. 159.","actionTimeStamp":"Tue, 08 Apr 2025 12:02:50 -0400"},{"index":8,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Ms. Jacobs to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Tue, 08 Apr 2025 12:02:25 -0400"},{"index":9,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Tue, 08 Apr 2025 12:02:23 -0400"},{"index":10,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Tue, 08 Apr 2025 12:01:07 -0400"},{"index":11,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of April 8.","actionTimeStamp":"Tue, 08 Apr 2025 12:00:00 -0400"},{"index":12,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Tue, 08 Apr 2025 10:55:05 -0400"},{"index":13,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Tue, 08 Apr 2025 10:00:48 -0400"},{"index":14,"header":"--","actionItem":"The Speaker designated the Honorable Marlin A. Stutzman to act as Speaker pro tempore for today.","actionTimeStamp":"Tue, 08 Apr 2025 10:00:31 -0400"},{"index":15,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Tue, 08 Apr 2025 10:00:00 -0400"}]}