{"retrieved-date":"2025-2-27","actions-date":"Tuesday, February 25, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, February 25)","actionItem":"S.J.Res. 11 (Sen. Kennedy):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Bureau of Ocean Energy Management relating to \"Protection of Marine Archaeological Resources\".\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 54 - 42. Record Vote Number: 91 \n\n\n        -- Measure laid before Senate by motion.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 54 - 44. Record Vote Number: 92 \n\n\n\n S.Res. 96 (Sen. Collins):\n        A resolution designating the week of February 24 through February 28, 2025, as \"Public Schools Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 97 (Sen. Ricketts):\n        A resolution honoring the life of Nebraska community leader Howard L. Hawks.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, February 25)","actionItem":"PN11-10:\n        Linda McMahon, of Connecticut, to be Secretary of Education\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Yea-Nay Vote. 51 - 47. Record Vote Number: 93 \n\n\n        -- Cloture motion presented in Senate.\n\n\n PN12-12:\n        Daniel Driscoll, of North Carolina, to be Secretary of the Army\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 66 - 28. Record Vote Number: 90","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Kennedy, at  7:32 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}