{"retrieved-date":"2023-10-27","actions-date":"Thursday, October 26, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, October 26)","actionItem":"H.R. 4366 (Rep. Carter):\n        A bill making appropriations for military construction, the Department of Veterans Affairs, and related agencies for the fiscal year ending September 30, 2024, and for other purposes.\n\n        -- Considered by Senate.\n \n\n S.Amdt. 1092 (Sen. Murray):\n        In the nature of a substitute.\n\n        --Considered by Senate.\n\n\n S.Amdt. 1182 (Sen. Braun):\n        To prohibit earmarks.\n\n        --Amendment SA 1182 proposed by Senator Braun to Amendment SA 1092.\n\n        --Amendment SA 1182 not agreed to in Senate by Yea-Nay Vote. 35 - 62. Record Vote Number: \n\n\n\n\n S.J.Res. 42 (Sen. Marshall):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Food and Nutrition Service relating to \"Application of Bostock v. Clayton County to Program Discrimination Complaint Processing-Policy Update\".\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Failed of passage in Senate by Yea-Nay Vote. 47 - 50. Record Vote Number: 272 \n\n\n\n S.Res. 418 (Sen. Hawley):\n        A resolution condemning Hamas and antisemitic student activities on college campuses in the United States.\n\n        -- Senate Committee on Foreign Relations discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 435 (Sen. Ernst):\n        A resolution recognizing the week of October 30 through November 4, 2023, as \"National Veterans Small Business Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 436 (Sen. Welch):\n        A resolution expressing support for the designation of the week of October 24, 2023, to October 31, 2023, as \"BatWeek\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 437 (Sen. Blackburn):\n        A resolution condemning antisemitism at institutions of higher education in the United States and encouraging college and university leaders, administrators, and faculty to speak out against antisemitism.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 438 (Sen. Ossoff):\n        A resolution congratulating Coco Gauff for her inspiring victory at this year's US Open Tennis Championships.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 439 (Sen. Smith):\n        A resolution supporting afterschool programs and Lights On Afterschool, a national celebration of afterschool programs held on October 26, 2023.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, October 26)","actionItem":"PN452:\n        Matthew James Maddox, of Maryland, to be United States District Judge for the District of Maryland\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- By unanimous consent agreement, debate 10/30/2023.\n\n\n PN1062:\n        Jacob J. Lew, of New York, to be Ambassador to the State of Israel\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  3:15 p.m., the Senate adjourned, under its order of today, until  3 p.m. on Monday, October 30, 2023.","actionTimeStamp":"--"}]}