{"retrieved-date":"2024-12-19","actions-date":"Tuesday, December 17, 2024","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, December 17)","actionItem":"H.R. 663 (Rep. Gallego):\n        A bill to amend the Indian Child Protection and Family Violence Prevention Act.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n H.R. 1607 (Rep. Schweikert):\n        A bill to clarify jurisdiction with respect to certain Bureau of Reclamation pumped storage development, and for other purposes.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 1727 (Rep. Trone):\n        A bill to amend the Chesapeake and Ohio Canal Development Act to extend the Chesapeake and Ohio Canal National Historical Park Commission.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 2468 (Rep. Owens):\n        A bill to require the Secretary of the Interior to convey to the State of Utah certain Federal land under the administrative jurisdiction of the Bureau of Land Management within the boundaries of Camp Williams, Utah, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 3324 (Rep. Huffman):\n        A bill to extend the authority to collect Shasta-Trinity Marina fees through fiscal year 2029.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 4094 (Rep. Curtis):\n        A bill to amend the Central Utah Project Completion Act to authorize expenditures for the conduct of certain water conservation measures in the Great Salt Lake basin, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 5009 (Rep. Joyce):\n        A bill to reauthorize wildlife habitat and conservation programs, and for other purposes.\n\n        -- Considered by Senate (Message from the House considered).\n \n\n S.Amdt. 3317 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate (Message from the House Considered).\n\n\n S.Amdt. 3318 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate (Message from the House Considered).\n\n\n\n\n H.R. 6826 (Rep. Mfume):\n        A bill to designate the visitor and education center at Fort McHenry National Monument and Historic Shrine as the Paul S. Sarbanes Visitor and Education Center.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6843 (Rep. Scalise):\n        A bill to expand the boundaries of the Atchafalaya National Heritage Area to include Lafourche Parish, Louisiana.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7332 (Rep. Maloy):\n        A bill to require the Secretary of the Interior and the Secretary of Agriculture to convey certain Federal land to the State of Utah for inclusion in certain State parks, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 9566 (Rep. Langworthy):\n        A bill to require governmentwide source code sharing, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 1097 (Sen. Padilla):\n        A bill to establish the Cesar E. Chavez and the Farmworker Movement National Historical Park in the States of California and Arizona, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 1144 (Sen. Cortez Masto):\n        A bill to establish a grant program to provide assistance to local law enforcement agencies, and for other purposes.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3342 (Sen. Cortez Masto):\n        In the nature of a substitute.\n\n        --Amendment SA 3342 proposed by Senator Schumer for Senator Cortez Masto.\n\n        --Amendment SA 3342 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 1277 (Sen. McConnell):\n        A bill to modify the boundary of the Mammoth Cave National Park in the State of Kentucky, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 1299 (Sen. Cornyn):\n        A bill to amend title 38, United States Code, to require the Secretary of Veterans Affairs to periodically review the automatic maximum coverage under Servicemembers' Group Life Insurance program and the Veterans' Group Life Insurance program, and for other purposes.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3341 (Sen. Cornyn):\n        In the nature of a substitute.\n\n        --Amendment SA 3341 proposed by Senator Schumer for Senator Cornyn.\n\n        --Amendment SA 3341 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 3022 (Sen. Cortez Masto):\n        A bill to amend the Indian Health Care Improvement Act to allow Indian Health Service scholarship and loan recipients to fulfill service obligations through half-time clinical practice, and for other purposes.\n\n        -- Passed Senate with an amendment by Voice Vote.\n\n\n S. 3502 (Sen. Reed):\n        A bill to amend the Fair Credit Reporting Act to prevent consumer reporting agencies from furnishing consumer reports under certain circumstances, and for other purposes.\n\n        -- Senate Committee on Banking, Housing, and Urban Affairs discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3339 (Sen. Reed):\n        In the nature of a substitute.\n\n        --Amendment SA 3339 proposed by Senator Schumer for Senator Reed.\n\n        --Amendment SA 3339 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 3543 (Sen. Lankford):\n        A bill to establish the Historic Greenwood District-Black Wall Street National Monument in the State of Oklahoma, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 4181 (Sen. Peters):\n        A bill to require the development of a workforce plan for the Federal Emergency Management Agency.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute as amended agreed to by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3340 (Sen. Peters):\n        To require the Administrator of the Federal Emergency Management Agency to develop strategies for identifying, addressing, preventing, and mitigating discriminatory actions or decisions based on political affiliation.\n\n        --Amendment SA 3340 proposed by Senator Schumer for Senator Peters.\n\n        --Amendment SA 3340 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 4654 (Sen. Peters):\n        A bill to amend the Robert T. Stafford Disaster Relief and Emergency Assistance Act to allow Indian tribal governments to directly request fire management assistance declarations and grants, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 5005 (Sen. Padilla):\n        A bill to authorize additional funding for the San Joaquin River Restoration Settlement Act.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 5130 (Sen. Cantwell):\n        A bill to amend the Omnibus Crime Control and Safe Streets Act of 1968 to enhance the Comprehensive Opioid Abuse Grant Program, and for other purposes.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 5398 (Sen. Hassan):\n        A bill to authorize sentencing enhancements for certain criminal offenses directed by or coordinated with foreign governments.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n S. 5575 (Sen. Manchin):\n        A bill to designate the Patsye Crites Forest.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.\n\n\n S.Res. 928 (Sen. Ricketts):\n        A resolution honoring the life of Nebraska community leader John Edmund Gottschalk.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 932 (Sen. Moran):\n        A resolution designating the month of October 2024 as \"National Military Toxic Exposures Awareness Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Recess","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  7:40 p.m., the Senate recessed, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}