{"retrieved-date":"2024-9-11","actions-date":"Monday, September 9, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Thursday, September 5, 2024,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Thursday, September 5, 2024, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, September 9)","actionItem":"H.Con.Res. 126 (Rep. McClain):\n        A concurrent resolution authorizing the use of the rotunda of the Capitol for a ceremony to award posthumously a Congressional Gold Medal in commemoration to the servicemembers who perished in Afghanistan on August 26, 2021, during the evacuation of citizens of the United States and Afghan allies at Hamid Karzai International Airport.\n\n        -- Received in the Senate, considered, and agreed to without amendment by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Monday, September  9)","actionItem":"PN1748:\n        Adam B. Abelson, of Maryland, to be United States District Judge for the District of Maryland\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 40. Record Vote Number: 231 \n\n\n\n PN1807:\n        Mary Kay Lanthier, of Vermont, to be United States District Judge for the District of Vermont\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN1826:\n        Laura Margarete Provinzino, of Minnesota, to be United States District Judge for the District of Minnesota\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  6:56 p.m, the Presiding Officer (Mr. Heinrich in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}