{"retrieved-date":"2023-12-1","actions-date":"Wednesday, November 29, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, November 29)","actionItem":"S. 1278 (Sen. Stabenow):\n        A bill to designate the Federal building located at 985 Michigan Avenue in Detroit, Michigan, as the \"Rosa Parks Federal Building\", and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 2644 (Sen. Cornyn):\n        A bill to establish standards for trauma kits purchased using funds provided under the Edward Byrne Memorial Justice Assistance Grant Program.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 479 (Sen. Manchin):\n        A resolution designating November 2023 as \"National Homeless Children and Youth Awareness Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, November 29)","actionItem":"PN32:\n        Ann Marie Yastishock, of Pennsylvania, to be Ambassador to the Independent State of Papua New Guinea, and to serve concurrently and without additional compensation as Ambassador to the Solomon Islands and Ambassador to the Republic of Vanuatu\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN309:\n        Heather Roach Variava, of Iowa, to be Ambassador to the Lao People's Democratic Republic\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN374:\n        Vernelle Trim FitzPatrick, of Virginia, to be Ambassador to the Gabonese Republic\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN444:\n        Kara C. McDonald, of Virginia, to be Ambassador to the Republic of Lithuania\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1022:\n        Micah W.J. Smith, of Hawaii, to be United States District Judge for the District of Hawaii\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 57 - 42. Record Vote Number: 319 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 57 - 41. Record Vote Number: 320 \n\n\n\n PN1023:\n        Jamel Semper, of New Jersey, to be United States District Judge for the District of New Jersey\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 54 - 44. Record Vote Number: 321 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 54 - 44. Record Vote Number: 322 \n\n\n\n PN1053:\n        Shanlyn A.S. Park, of Hawaii, to be United States District Judge for the District of Hawaii\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 44. Record Vote Number: 323 \n\n\n        -- By unanimous consent agreement, debate 11/30/2023.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  7:58 p.m, the Presiding Officer (Ms. Hassan in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}