{"retrieved-date":"2025-5-2","actions-date":"Wednesday, April 30, 2025","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, April 30)","actionItem":"H.J.Res. 42 (Rep. Clyde):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Department of Energy relating to \"Energy Conservation Program for Appliance Standards: Certification Requirements, Labeling Requirements, and Enforcement Provisions for Certain Consumer Products and Commercial Equipment\".\n\n        -- Considered by Senate.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 52 - 46. Record Vote Number: 223 \n\n\n\n H.J.Res. 75 (Rep. Goldman):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Office of Energy Efficiency and Renewable Energy, Department of Energy relating to \"Energy Conservation Program: Energy Conservation Standards for Commercial Refrigerators, Freezers, and Refrigerator-Freezers\".\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 52 - 46. Record Vote Number: 224 \n\n\n        -- Measure laid before Senate by motion.\n\n\n H.Con.Res. 9 (Rep. Perry):\n        A concurrent resolution authorizing the use of the Capitol Grounds for the National Peace Officers Memorial Service and the National Honor Guard and Pipe Band Exhibition.\n\n        -- Resolution agreed to in Senate without amendment by Unanimous Consent.\n\n\n S. 616 (Sen. Kennedy):\n        A bill to amend title 36, United States Code, to revise the Federal charter for the Foundation of the Federal Bar Association.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.J.Res. 31 (Sen. Curtis):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Environmental Protection Agency relating to \"Review of Final Rule Reclassification of Major Sources as Area Sources Under Section 112 of the Clean Air Act\".\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 52 - 40. Record Vote Number: 227 \n\n\n        -- Measure laid before Senate by motion.\n\n\n S.J.Res. 49 (Sen. Wyden):\n        A joint resolution terminating the national emergency declared to impose global tariffs.\n\n        -- Senate Committee on Finance discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Failed of passage in Senate by Yea-Nay Vote. 49 - 49. Record Vote Number: 225 \n\n\n        -- Motion by Senator Thune to reconsider the vote by which S.J. Res. 49 failed of passage (Record Vote No. 225) made in Senate.\n\n        -- Motion to table the motion to reconsider the vote by which S.J. Res. 49 failed of passage (Record Vote No. 225) agreed to in Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 226 \n\n\n\n S.Res. 191 (Sen. Murray):\n        A resolution supporting the designation of April 2025 as the \"Month of the Military Child\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 192 (Sen. Markey):\n        A resolution designating April 30, 2025, as \"National Assistive Technology Awareness Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 193 (Sen. Reed):\n        A resolution designating April 2025 as \"Financial Literacy Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  9:34 p.m, the Presiding Officer (Mr. Ricketts in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}