{"retrieved-date":"2025-5-1","actions-date":"Tuesday, April 29, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday,the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, April 29)","actionItem":"H.J.Res. 42 (Rep. Clyde):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Department of Energy relating to \"Energy Conservation Program for Appliance Standards: Certification Requirements, Labeling Requirements, and Enforcement Provisions for Certain Consumer Products and Commercial Equipment\".\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 52 - 46. Record Vote Number: 222 \n\n\n        -- Measure laid before Senate by motion.\n\n\n S. 307 (Sen. Blackburn):\n        A bill to address sexual harassment and sexual assault of Bureau of Prisons staff in prisons, and for other purposes.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 184 (Sen. Cornyn):\n        A resolution expressing support for the designation of April 2025 as \"National Child Abuse Prevention Month\", and the goals and ideals of National Child Abuse Prevention Month.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 185 (Sen. Grassley):\n        A resolution designating the week of April 21 through April 25, 2025, as \"National Home Visiting Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 186 (Sen. Grassley):\n        A resolution supporting the mission and goals of National Fentanyl Awareness Day in 2025, including increasing individual and public awareness of the impact of fake or counterfeit fentanyl pills onfamilies and young people.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 187 (Sen. Risch):\n        A resolution celebrating the 153rd anniversary of Arbor Day.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, April 29)","actionItem":"PN20:\n        Frank Bisignano, of New Jersey, to be Commissionerof Social Security Administration for the term expiring January 19, 2031\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN24-5:\n        Warren Stephens, of Arkansas, to be Ambassador to the United Kingdom of Great Britain and Northern Ireland\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 59 - 39. Record Vote Number: 215 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 59 - 39. Record Vote Number: 217 \n\n\n\n PN26-3:\n        Thomas Barrack, of Colorado, to be Ambassador to the Republic of Turkey\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 62 - 36. Record Vote Number: 218 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 60 - 36. Record Vote Number: 219 \n\n\n\n PN26-18:\n        Tilman Fertitta, of Texas, to be Ambassador to theItalian Republic, and to serve concurrently and without additional compensation as Ambassador to the Republic of San Marino\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 84 - 13. Record Vote Number: 220 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 83 - 14. Record Vote Number: 221 \n\n\n\n PN54-5:\n        David Perdue, of Georgia, to be Ambassador to the People's Republic of China\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 67 - 29. Record Vote Number: 215","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at 12:02 a.m, the Presiding Officer (Mr. Moreno in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}