{"retrieved-date":"2026-2-11","actions-date":"Wed, 11 Feb 2026 12:20:01 -0500","actions-title":"House Floor Proceedings","actions-count":10,"actions-list":[{"index":1,"header":"On ordering the previous question Roll Call 61","actionItem":"Yea and Nay vote pending.","actionTimeStamp":"Wed, 11 Feb 2026 12:20:01 -0500"},{"index":2,"header":"--","actionItem":"On agreeing to the Roy amendment; Agreed to without objection.","actionTimeStamp":"Wed, 11 Feb 2026 12:19:28 -0500"},{"index":3,"header":"--","actionItem":"An amendment, offered by Mr. Roy,  to make a technical correction to S. 1383.","actionTimeStamp":"Wed, 11 Feb 2026 12:18:32 -0500"},{"index":4,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 1057.","actionTimeStamp":"Wed, 11 Feb 2026 11:09:39 -0500"},{"index":5,"header":"--","actionItem":"Considered as privileged matter. H. Res. 1057 — \"Providing for consideration of the bill (S. 1383) to establish the Veterans Advisory Committee on Equal Access, and for other purposes; providing for consideration of the bill (H.R. 2189) to modernize Federal firearms laws to account for advancements in technology and less-than-lethal weapons, and for other purposes; providing for consideration of the bill (H.R. 261) to amend the National Marine Sanctuaries Act to prohibit requiring an authorization for the installation, continued presence, operation, maintenance, repair, or recovery of undersea fiber optic cables in a national marine sanctuary if such activities have previously been authorized by a Federal or State agency; providing for consideration of the bill (H.R. 3617) to amend the Department of Energy Organization Act to secure the supply of critical energy resources, including critical minerals and other materials, and for other purposes; and waiving a requirement of clause 6(a) of rule XIII with respect to consideration of certain resolutions reported from the Committee on Rules.\"","actionTimeStamp":"Wed, 11 Feb 2026 11:05:04 -0500"},{"index":6,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. McGovern to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 11 Feb 2026 11:04:14 -0500"},{"index":7,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 11 Feb 2026 11:04:10 -0500"},{"index":8,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Wed, 11 Feb 2026 11:02:29 -0500"},{"index":9,"header":"--","actionItem":"The Speaker designated the Honorable Gabe Evans to act as Speaker pro tempore for today.","actionTimeStamp":"Wed, 11 Feb 2026 11:02:07 -0500"},{"index":10,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 11 Feb 2026 11:00:00 -0500"}]}