{"retrieved-date":"2025-12-11","actions-date":"Tuesday, December 9, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, December  9)","actionItem":"S. 414 (Sen. Sullivan):\n        A bill to require covered digital advertising platforms to report their public service advertisements.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 1437 (Sen. Hickenlooper):\n        A bill to require the Administrator of the National Aeronautics and Space Administration to establish a program to identify, evaluate, acquire, and disseminate commercial Earth remote sensing data and imagery in order to satisfy the scientific, operational, and educational requirements of the Administration, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 3385 (Sen. Schumer):\n        A bill to amend the Internal Revenue Code of 1986 to extend the enhancement of the health care premium tax credit.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.\n\n\n S. 3386 (Sen. Crapo):\n        A bill to provide a health savings account contribution to certain enrollees, to reduce health care costs, and for other purposes.\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Cloture motion on the motion to proceed to the measure presented in Senate.\n\n        -- Motion to proceed to consideration of measure withdrawn in Senate.\n\n\n S.Res. 483 (Sen. Welch):\n        A resolution honoring the extraordinary life, leadership, and legacy of Dr. Jane Goodall.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 537 (Sen. Capito):\n        A resolution honoring the service and sacrifice of United States Army Specialist Sarah Beckstrom and United States Air Force Staff Sergeant Andrew Wolfe, who were tragically shot in Washington, D.C., in a targeted assault against United States service members on November 26, 2025.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 538 (Sen. Alsobrooks):\n        A resolution designating November 2025 as \"National Homeless Children and Youth Awareness Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 539 (Sen. Gallego):\n        A resolution recognizing the 80th anniversary of the commencement of continuous operations of Stars and Stripes in the Pacific and the invaluable service of the Stars and Stripes as the \"hometown newspaper\" for members of the Armed Forces, civilian employees, and family members stationed around the world.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, December  9)","actionItem":"PN466-1:\n        Robert P. Chamberlin, of Mississippi, to be United States District Judge for the Northern District of Mississippi\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 46. Record Vote Number: 636 \n\n\n\n PN466-5:\n        James D. Maxwell II, of Mississippi, to be United States District Judge for the Northern District of Mississippi\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 49 - 46. Record Vote Number: 639 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 46. Record Vote Number: 640 \n\n\n\n PN615-1:\n        William J. Crain, of Louisiana, to be United States District Judge for the Eastern District of Louisiana\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 46. Record Vote Number: 637 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 49 - 46. Record Vote Number: 638","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Barrasso, at 6:16 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}