{"retrieved-date":"2023-10-25","actions-date":"Wed, 25 Oct 2023 15:32:30 -0400","actions-title":"House Floor Proceedings","actions-count":30,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 771.","actionTimeStamp":"Wed, 25 Oct 2023 15:32:30 -0400"},{"index":2,"header":"--","actionItem":"Considered under suspension of the rules.","actionTimeStamp":"Wed, 25 Oct 2023 15:32:25 -0400"},{"index":3,"header":"ORDER OF PROCEDURE","actionItem":"Mr. McCaul asked unanimous consent that debate be extended by 10 minutes on each side. Agreed to without objection.","actionTimeStamp":"Wed, 25 Oct 2023 15:31:55 -0400"},{"index":4,"header":"--","actionItem":"Mr. McCaul moved to suspend the rules and agree to the resolution. H. Res. 771 — \"Standing with Israel as it defends itself against the barbaric war launched by Hamas and other terrorists.\"","actionTimeStamp":"Wed, 25 Oct 2023 15:31:45 -0400"},{"index":5,"header":"--","actionItem":"The Speaker announced that votes on suspensions, if ordered, will be postponed until a time to be announced.","actionTimeStamp":"Wed, 25 Oct 2023 15:31:44 -0400"},{"index":6,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of October 25.","actionTimeStamp":"Wed, 25 Oct 2023 15:31:43 -0400"},{"index":7,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is subject to the call of the Chair.","actionTimeStamp":"Wed, 25 Oct 2023 14:49:12 -0400"},{"index":8,"header":"SPEAKER PRO TEMPORE","actionItem":"The Speaker appointed the Honorable Patrick McHenry, the Honorable Adrian Smith (NE), the Honorable Andy Harris, the Honorable Guy Reschenthaler, the Honorable Rob Wittman, the Honorable Ben Cline, the Honorable Richard Hudson, and the Honorable John Joyce (PA) to act as Speaker pro tempore to sign enrolled bills and joint resolutions through the remainder of the One Hundred Eighteenth Congress.","actionTimeStamp":"Wed, 25 Oct 2023 14:49:10 -0400"},{"index":9,"header":"--","actionItem":"The House received a communication from The Honorable Mike Johnson (LA), Speaker. Pursuant to H. Con. Res. 1, clause 12 of rule I, and any concurrent resolutions of the current Congress as may contemplate his designation of Members to exercise similar authority, the Speaker notified the Acting Clerk of his designation of Representative Steve Scalise of Louisiana to exercise any authority regarding assembly, reassembly, convening, or reconvening of the House. In the event of the death or inability of that designee, the alternate Members of the House listed in the letter bearing the date of October 25, 2023, placed with the Acting Clerk are designated, in turn, for the same purposes.","actionTimeStamp":"Wed, 25 Oct 2023 14:48:55 -0400"},{"index":10,"header":"--","actionItem":"The Chair announced that the Speaker has delivered to the Acting Clerk a letter dated October 25, 2023, listing Members in the order in which each shall act as Speaker pro tempore under clause 8(b)(3) of rule 1.","actionTimeStamp":"Wed, 25 Oct 2023 14:48:25 -0400"},{"index":11,"header":"--","actionItem":"The Chair announced that the Speaker's announced policies with respect to particular aspects of the legislative process placed in the Record on January 9, 2023, will continue in effect for the remainder of the 118th Congress.","actionTimeStamp":"Wed, 25 Oct 2023 14:48:07 -0400"},{"index":12,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Wed, 25 Oct 2023 14:47:17 -0400"},{"index":13,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Wed, 25 Oct 2023 14:47:10 -0400"},{"index":14,"header":"--","actionItem":"Considered as privileged matter. H. Res. 811 — \"Authorizing the Clerk to inform the President of the election of the Speaker.\"","actionTimeStamp":"Wed, 25 Oct 2023 14:46:39 -0400"},{"index":15,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Wed, 25 Oct 2023 14:46:36 -0400"},{"index":16,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Wed, 25 Oct 2023 14:46:31 -0400"},{"index":17,"header":"--","actionItem":"Considered as privileged matter. H. Res. 810 — \"To inform the Senate of the election of the Speaker.\"","actionTimeStamp":"Wed, 25 Oct 2023 14:45:47 -0400"},{"index":18,"header":"ADMINISTRATION OF THE OATH OF OFFICE","actionItem":"The Dean of the House administered the Oath of Office to the Speaker-elect.","actionTimeStamp":"Wed, 25 Oct 2023 14:43:16 -0400"},{"index":19,"header":"ADDRESS BY THE SPEAKER-ELECT","actionItem":"The Speaker-elect addressed the House prior to taking the Oath of Office which will be administered by the Dean of the House, Representative Harold Rogers, Kentucky.","actionTimeStamp":"Wed, 25 Oct 2023 14:23:34 -0400"},{"index":20,"header":"--","actionItem":"The Speaker-elect was escorted into the Chamber by the Escort Committee and introduced by Representative Jeffries, Democratic Leader, before assuming the Chair.","actionTimeStamp":"Wed, 25 Oct 2023 14:10:38 -0400"},{"index":21,"header":"COMMITTEE TO ESCORT THE SPEAKER-ELECT","actionItem":"The Speaker appointed a Committee of Members to escort the Speaker-elect into the Chamber and to the Chair.","actionTimeStamp":"Wed, 25 Oct 2023 13:54:34 -0400"},{"index":22,"header":"Roll call 527","actionItem":"Election of the Speaker. Mr. Johnson (LA) 220 and Mr. Jeffries 209 (Roll no. 527). Mr. Johnson (LA) was elected Speaker.","actionTimeStamp":"Wed, 25 Oct 2023 13:53:59 -0400"},{"index":23,"header":"NOMINATIONS FOR OFFICE OF SPEAKER","actionItem":"The Honorable Elise Stefanik, by direction of the Republican Conference, nominated the Honorable Mike Johnson, a Member from the State of Louisiana. The Honorable Pete Aguilar, by direction of the Democratic Caucus, nominated the Honorable Hakeem Jeffries, a Member from the State of New York. No other nominations were put forward.","actionTimeStamp":"Wed, 25 Oct 2023 12:52:49 -0400"},{"index":24,"header":"ORDER OF BUSINESS-ELECTION OF THE SPEAKER","actionItem":"The Chair announced that the floor was open to receive nominations for the Office of the Speaker of the U.S. House of Representatives.","actionTimeStamp":"Wed, 25 Oct 2023 12:52:20 -0400"},{"index":25,"header":"--","actionItem":"Call of the House Quorum responded: 429 present (Roll no. 526).","actionTimeStamp":"Wed, 25 Oct 2023 12:50:29 -0400"},{"index":26,"header":"CALL OF THE HOUSE","actionItem":"Pursuant to clause 7 of rule XX, Mr. Bost moved a call of the House. The Speaker announced that under clause 7(b) of rule XX, he conferred recognition for that purpose and that without objection, a call of the House would be ordered.","actionTimeStamp":"Wed, 25 Oct 2023 12:05:05 -0400"},{"index":27,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Newhouse to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 25 Oct 2023 12:05:00 -0400"},{"index":28,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 25 Oct 2023 12:04:55 -0400"},{"index":29,"header":"--","actionItem":"Today's prayer was offered by Reverend Jeremy Leganski, Immaculate Conception Church, Elmhurst, IL.","actionTimeStamp":"Wed, 25 Oct 2023 12:03:32 -0400"},{"index":30,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 25 Oct 2023 12:00:00 -0400"}]}