{"retrieved-date":"2023-3-30","actions-date":"Thu, 30 Mar 2023 09:34:18 -0400","actions-title":"House Floor Proceedings","actions-count":16,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 260, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 32.","actionTimeStamp":"Thu, 30 Mar 2023 09:34:18 -0400"},{"index":2,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 32 printed in Part B of House Report 118-30 to add a prohibition to sec. 20209 on contributions from CCP entities.","actionTimeStamp":"Thu, 30 Mar 2023 09:33:36 -0400"},{"index":3,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Ogles amendment No. 31, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Grijalva demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 30 Mar 2023 09:31:51 -0400"},{"index":4,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 260, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 31.","actionTimeStamp":"Thu, 30 Mar 2023 09:24:05 -0400"},{"index":5,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 31 printed in Part B of House Report 118-30 to provide that any entity subject to the jurisdiction of the Government of the Peoples Republic of China, or any entity that is owned by the Government of the Peoples Republic of China may not acquire any interest with respect to lands leased for oil or gas under the Mineral Leasing Act, the Outer Continental Shelf Lands Act, and may not acquire claims subject to the General Mining Law of 1872.","actionTimeStamp":"Thu, 30 Mar 2023 09:22:58 -0400"},{"index":6,"header":"--","actionItem":"On agreeing to the Ogles amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 30 Mar 2023 09:22:41 -0400"},{"index":7,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 260, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 30.","actionTimeStamp":"Thu, 30 Mar 2023 09:13:59 -0400"},{"index":8,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 30 printed in Part B of House Report 118-30 to express the Sense of Congress that the royalty rate for onshore Federal oil and gas leases be 12.5%.","actionTimeStamp":"Thu, 30 Mar 2023 09:12:59 -0400"},{"index":9,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Thu, 30 Mar 2023 09:12:03 -0400"},{"index":10,"header":"--","actionItem":"Considered as unfinished business. H.R. 1 — \"To lower energy costs by increasing American energy production, exports, infrastructure, and critical minerals processing, by promoting transparency, accountability, permitting, and production of American resources, and by improving water quality certification and energy projects, and for other purposes.\"","actionTimeStamp":"Thu, 30 Mar 2023 09:11:42 -0400"},{"index":11,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair, would be limited to 5 per side of the aisle.","actionTimeStamp":"Thu, 30 Mar 2023 09:02:26 -0400"},{"index":12,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Good of VA to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 30 Mar 2023 09:02:02 -0400"},{"index":13,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Thu, 30 Mar 2023 09:01:57 -0400"},{"index":14,"header":"--","actionItem":"The Speaker designated the Honorable Mike Flood to act as Speaker pro tempore for today.","actionTimeStamp":"Thu, 30 Mar 2023 09:00:16 -0400"},{"index":15,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Thu, 30 Mar 2023 09:00:00 -0400"},{"index":16,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 30 Mar 2023 09:00:00 -0400"}]}