{"retrieved-date":"2023-11-30","actions-date":"Thu, 30 Nov 2023 14:20:25 -0500","actions-title":"House Floor Proceedings","actions-count":42,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 891, the Committee of the Whole proceeded with 10 minutes of debate on the Pfluger amendment No. 9.","actionTimeStamp":"Thu, 30 Nov 2023 14:20:25 -0500"},{"index":2,"header":"--","actionItem":"An amendment, offered by Mr. Pfluger,  numbered 9 printed in Part C of House Report 118-280 to prohibit the president from exercising the waiver authority described in section 1245(d)(5) of the 2012 NDAA and sections 1244(i) and 1247(f) of the Iran Freedom and Counter-Proliferation Act of 2012.","actionTimeStamp":"Thu, 30 Nov 2023 14:20:07 -0500"},{"index":3,"header":"PROCEEDINGS POSTPONED","actionItem":"At the conclusion of debate on the Ogles amendment No. 8, the Chair put the question on agreeing to the amendment and by voice vote, announced the ayes had prevailed. Mr. Ogles demanded a recorded vote, and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 30 Nov 2023 14:19:50 -0500"},{"index":4,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 891, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 8.","actionTimeStamp":"Thu, 30 Nov 2023 14:09:10 -0500"},{"index":5,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 8 printed in Part C of House Report 118-280 to express the sense of Congress that the Houthis continue to benefit from the administration's \"failure to unequivocally condemn it.\"","actionTimeStamp":"Thu, 30 Nov 2023 14:08:56 -0500"},{"index":6,"header":"--","actionItem":"On agreeing to the Ogles amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 30 Nov 2023 14:08:33 -0500"},{"index":7,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 891, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 7.","actionTimeStamp":"Thu, 30 Nov 2023 13:55:40 -0500"},{"index":8,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 7 printed in Part C of House Report 118-280 to express a Sense of Congress that Qatar should condemn Hamas, turn over Hamas leadership to US and Israeli custody, and pledge never to facilitate the transfer of covered Iranian funds to Iran.","actionTimeStamp":"Thu, 30 Nov 2023 13:55:21 -0500"},{"index":9,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Ogles amendment No. 6, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Ogles demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 30 Nov 2023 13:55:02 -0500"},{"index":10,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 891, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 6.","actionTimeStamp":"Thu, 30 Nov 2023 13:48:59 -0500"},{"index":11,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 6 printed in Part C of House Report 118-280 to prohibit the use of federal funds to make any funds (as such term is defined in section 2339C(e)(1) of title 18, United States Code) available to Iran.","actionTimeStamp":"Thu, 30 Nov 2023 13:48:45 -0500"},{"index":12,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Ogles amendment No. 5, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Ogles demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 30 Nov 2023 13:48:24 -0500"},{"index":13,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 891, the Committee of the Whole proceeded with 10 minutes of debate on the Ogles amendment No. 5.","actionTimeStamp":"Thu, 30 Nov 2023 13:43:42 -0500"},{"index":14,"header":"--","actionItem":"An amendment, offered by Mr. Ogles,  numbered 5 printed in Part C of House Report 118-280 to express a Sense of Congress that all US allies in the Middle East should publicly and unequivocally condemn the antisemitism displayed by Iranian-backed terror groups, including Hamas.","actionTimeStamp":"Thu, 30 Nov 2023 13:43:26 -0500"},{"index":15,"header":"--","actionItem":"On agreeing to the Norman amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 30 Nov 2023 13:43:04 -0500"},{"index":16,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 891, the Committee of the Whole proceeded with 10 minutes of debate on the Norman amendment No. 4.","actionTimeStamp":"Thu, 30 Nov 2023 13:38:05 -0500"},{"index":17,"header":"--","actionItem":"An amendment, offered by Mr. Norman,  numbered 4 printed in Part C of House Report 118-280 to require a 45-day waiting period between Presidential certification and removal of sanctions to provide an opportunity for congressional oversight.","actionTimeStamp":"Thu, 30 Nov 2023 13:37:42 -0500"},{"index":18,"header":"--","actionItem":"On agreeing to the Gottheimer amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 30 Nov 2023 13:37:25 -0500"},{"index":19,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 891, the Committee of the Whole proceeded with 10 minutes of debate on the Gottheimer amendment No. 3.","actionTimeStamp":"Thu, 30 Nov 2023 13:31:57 -0500"},{"index":20,"header":"--","actionItem":"An amendment, offered by Mr. Gottheimer,  numbered 3 printed in Part C of House Report 118-280 to correct the number of hostages being held by Hamas.","actionTimeStamp":"Thu, 30 Nov 2023 13:31:40 -0500"},{"index":21,"header":"--","actionItem":"On agreeing to the Cherfilus-McCormick amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 30 Nov 2023 13:31:18 -0500"},{"index":22,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 891, the Committee of the Whole proceeded with 10 minutes of debate on the Cherfilus-McCormick amendment No. 2.","actionTimeStamp":"Thu, 30 Nov 2023 13:27:08 -0500"},{"index":23,"header":"--","actionItem":"An amendment, offered by Mrs. Cherfilus-McCormick,  numbered 2 printed in Part C of House Report 118-280 to add a Sense of Congress that the Iranian regime should receive no additional funds but that basic humanitarian assistance for the people of Iran is important.","actionTimeStamp":"Thu, 30 Nov 2023 13:26:53 -0500"},{"index":24,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Fitzpatrick amendment No. 1, the Chair put the question on agreeing to the amendment and by voice vote announced that the ayes had prevailed. Mr. Fitzpatrick demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 30 Nov 2023 13:26:38 -0500"},{"index":25,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 891, the Committee of the Whole proceeded with 10 minutes of debate on the Fitzpatrick amendment No. 1.","actionTimeStamp":"Thu, 30 Nov 2023 13:23:45 -0500"},{"index":26,"header":"--","actionItem":"An amendment, offered by Mr. Fitzpatrick,  numbered 1 printed in Part C of House Report 118-280 to add findings that condemn Hamas and Iran-backed terror groups for using \"human shields\" and that only the unconditional surrender of Hamas and other Iran-backed terror groups will save innocent civilian lives.","actionTimeStamp":"Thu, 30 Nov 2023 13:23:35 -0500"},{"index":27,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 5961.","actionTimeStamp":"Thu, 30 Nov 2023 12:25:30 -0500"},{"index":28,"header":"--","actionItem":"The Speaker designated the Honorable Julia Letlow to act as Chairwoman of the Committee.","actionTimeStamp":"Thu, 30 Nov 2023 12:24:23 -0500"},{"index":29,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 891 and Rule XVIII.","actionTimeStamp":"Thu, 30 Nov 2023 12:24:22 -0500"},{"index":30,"header":"--","actionItem":"Rule provides for consideration of H.R. 5283, H.R. 5961 and S.J. Res. 32. The resolution provides for consideration of H.R. 5283 and H.R. 5961 under a structured rule and S. J. Res. 32 under a closed rule. Rule provides for one hour of general debate on each measure with one motion to recommit on H.R. 5283 and H.R. 5961 and one motion to commit on S. J. Res. 32.","actionTimeStamp":"Thu, 30 Nov 2023 12:24:00 -0500"},{"index":31,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 891. H.R. 5961 — \"To freeze certain Iranian funds involved in the 2023 hostage deal between the United States and Iran, and for other purposes.\"","actionTimeStamp":"Thu, 30 Nov 2023 12:23:55 -0500"},{"index":32,"header":"--","actionItem":"The House received a communication from Shri Thanedar, Member of Congress. Pursuant to Rule VIII of the Rules of the House of Representatives, Mr. Thanedar notified the House that he had been served with a third-party subpoena to testify in litigation before the 36th District Court for the State of Michigan and that after consultation with the Office of General Counsel, he had determined that compliance with the subpoena is inconsistent with the rights and privileges of the House.","actionTimeStamp":"Thu, 30 Nov 2023 12:23:11 -0500"},{"index":33,"header":"NOTIFICATION OF INTENT TO OFFER RESOLUTION","actionItem":"Mr. Santos notified the House of his intent to offer a privileged resolution pursuant to clause 2(a)(1) of rule IX. The Chair announced that a determination will be made at the time designated for consideration of the resolution.","actionTimeStamp":"Thu, 30 Nov 2023 12:20:34 -0500"},{"index":34,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair would be limited to 15 per side of the aisle.","actionTimeStamp":"Thu, 30 Nov 2023 12:04:19 -0500"},{"index":35,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Thompson of PA to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 30 Nov 2023 12:03:59 -0500"},{"index":36,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Thu, 30 Nov 2023 12:03:56 -0500"},{"index":37,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Thu, 30 Nov 2023 12:02:12 -0500"},{"index":38,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of November 30.","actionTimeStamp":"Thu, 30 Nov 2023 12:00:00 -0500"},{"index":39,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Thu, 30 Nov 2023 11:38:54 -0500"},{"index":40,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Thu, 30 Nov 2023 10:02:58 -0500"},{"index":41,"header":"--","actionItem":"The Speaker designated the Honorable Marcus J. Molinaro to act as Speaker pro tempore for today.","actionTimeStamp":"Thu, 30 Nov 2023 10:02:21 -0500"},{"index":42,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 30 Nov 2023 10:00:00 -0500"}]}