{"retrieved-date":"2024-12-20","actions-date":"Thursday, December 19, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, December 19)","actionItem":"H.R. 82 (Rep. Graves):\n        A bill to amend title II of the Social Security Act to repeal the Government pension offset and windfall elimination provisions.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 73 - 23. Record Vote Number: 328 \n\n\n        -- Measure laid before Senate by motion.\n\n\n H.R. 1555 (Rep. McClintock):\n        A bill to designate the facility of the United States Postal Service located at 2300 Sylvan Avenue in Modesto, California, as the \"Corporal Michael D. Anderson Jr. Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Cloture motion on the motion to proceed to the measure rendered moot in Senate.\n\n\n H.R. 1823 (Rep. Bilirakis):\n        A bill to designate the facility of the United States Postal Service located at 207 East Fort Dade Avenue in Brooksville, Florida, as the \"Specialist Justin Dean Coleman Memorial Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 3354 (Rep. Wexton):\n        A bill to designate the facility of the United States Postal Service located at 220 North Hatcher Avenue in Purcellville, Virginia, as the \"Secretary of State Madeleine Albright Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 5867 (Rep. Mills):\n        A bill to designate the facility of the United States Postal Service located at 109 Live Oaks Boulevard in Casselberry, Florida, as the \"Colonel Joseph William Kittinger II Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6116 (Rep. Frankel):\n        A bill to designate the facility of the United States Postal Service located at 14280 South Military Trail in Delray Beach, Florida, as the \"Benjamin Berell Ferencz Post Office Building\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6162 (Rep. Moore):\n        A bill to designate the facility of the United States Postal Service located at 379 North Oates Street in Dothan, Alabama, as the \"LaBruce 'Bruce' Tidwell Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6188 (Rep. Fry):\n        A bill to designate the facility of the United States Postal Service located at 420 Highway 17 North in Surfside Beach, South Carolina, as the \"Nancy Yount Childs Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6244 (Rep. Gonzalez):\n        A bill to designate the facility of the United States Postal Service located at 1535 East Los Ebanos Boulevard in Brownsville, Texas, as the \"1st Lieutenant Andres Zermeno Post Office Building\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6492 (Rep. Westerman):\n        A bill to improve recreation opportunities on, and facilitate greater access to, Federal public land, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6633 (Rep. Luna):\n        A bill to designate the facility of the United States Postal Service located at 9355 113th Street in Seminole, Florida, as the \"Army SSG Ryan Christian Knauss Memorial Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6750 (Rep. Davis):\n        A bill to designate the facility of the United States Postal Service located at 501 Mercer Street Southwest in Wilson, North Carolina, as the \"Milton F. Fitch, Sr. Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6810 (Rep. Franklin):\n        A bill to designate the facility of the United States Postal Service located at 518 North Ridgewood Drive in Sebring, Florida, as the \"U.S. Army Air Corps Major Thomas B. McGuire Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6983 (Rep. Scott):\n        A bill to designate the facility of the United States Postal Service located at 15 South Valdosta Road in Lakeland, Georgia, as the \"Nell Patten Roquemore Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7158 (Rep. Carbajal):\n        A bill to designate the facility of the United States Postal Service located at 201 East Battles Road in Santa Maria, California, as the \"Larry Lavagnino Post Office Building\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7180 (Rep. Westerman):\n        A bill to designate the facility of the United States Postal Service located at 80 1st Street in Kingsland, Arkansas, as the \"Kingsland 'Johnny Cash' Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7365 (Rep. Gosar):\n        A bill to provide PreCheck to certain severely injured or disabled veterans, and for other purposes.\n\n        -- Senate Committee on Commerce, Science, and Transportation discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7385 (Rep. McClellan):\n        A bill to designate the facility of the United States Postal Service located at 29 Franklin Street in Petersburg, Virginia, as the \"John Mercer Langston Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7417 (Rep. Kelly):\n        A bill to designate the facility of the United States Postal Service located at 135 West Spring Street in Titusville, Pennsylvania, as the \"Edwin L. Drake Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7507 (Rep. Smith):\n        A bill to designate the facility of the United States Postal Service located at 203 East 6th Street in Lexington, Nebraska, as the \"Bill Barrett Post Office Building\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7508 (Rep. Spanberger):\n        A bill to designate the facility of the United States Postal Service located at 1285 Emancipation Highway in Fredericksburg, Virginia, as the \"Gladys P. Todd Post Office\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7606 (Rep. Van Drew):\n        A bill to designate the facility of the United States Postal Service located at 1087 Route 47 South in Rio Grande, New Jersey, as the \"Carlton H. Hand Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7607 (Rep. Van Drew):\n        A bill to designate the facility of the United States Postal Service located at Block 1025, Lots 18 & 19, Northeast Corner of US Route 9 South and Main Street in the Township of Middle, County of Cape May, New Jersey, as the \"George Henry White Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7893 (Rep. Sewell):\n        A bill to designate the facility of the United States Postal Service located at 306 Pickens Street in Marion, Alabama, as the \"Albert Turner, Sr. Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7938 (Rep. Bentz):\n        A bill to amend the Klamath Basin Water Supply Enhancement Act of 2000 to provide the Secretary of the Interior with certain authorities with respect to projects affecting the Klamath Basin watershed, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 8057 (Rep. Steel):\n        A bill to designate the facility of the United States Postal Service located at 9317 Bolsa Avenue in Westminster, California, as the \"Little Saigon Vietnam War Veterans Memorial Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 8641 (Rep. Ruiz):\n        A bill to designate the facility of the United States Postal Service located at 401 Main Street in Brawley, California, as the \"Walter Francis Ulloa Memorial Post Office Building\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 8666 (Rep. Maloy):\n        A bill to amend title 28, United States Code, to authorize holding court for the Central Division of Utah in Moab and Monticello.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n H.R. 8717 (Rep. Owens):\n        A bill to designate the facility of the United States Postal Service located at 20 West Main Street in Santaquin, Utah, as the \"SGT Bill Hooser Post Office Building\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 8841 (Rep. Fischbach):\n        A bill to designate the facility of the United States Postal Service located at 114 Center Street East in Roseau, Minnesota, as the \"Floyd B. Olson Post Office\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 8868 (Rep. Pappas):\n        A bill to designate the facility of the United States Postal Service located at 609 Portsmouth Avenue in Greenland, New Hampshire, as the \"Chief Michael Maloney Post Office Building\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 8909 (Rep. Tokuda):\n        A bill to designate the facility of the United States Postal Service located at 82-6110 Mamalahoa Highway in Captain Cook, Hawaii, as the \"Army 1st Lt. John Kuulei Kauhaihao Post Office Building\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 8919 (Rep. Ferguson):\n        A bill to designate the facility of the United States Postal Service located at 151 Highway 74 South in Peachtree City, Georgia, as the \"SFC Shawn McCloskey Post Office\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 8976 (Rep. Bost):\n        A bill to designate the facility of the United States Postal Service located at 20 West White Street in Millstadt, Illinois, as the \"Corporal Matthew A. Wyatt Post Office\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 9285 (Rep. Scholten):\n        A bill to designate the facility of the United States Postal Service located at 3913 Leland Avenue Northwest in Comstock Park, Michigan, as the \"Captain Miguel Justin Nava Post Office\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 9322 (Rep. Sykes):\n        A bill to designate the facility of the United States Postal Service located at 675 Wolf Ledges Parkway in Akron, Ohio, as the \"Judge James R. Williams Post Office Building\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 9421 (Rep. Perez):\n        A bill to designate the facility of the United States Postal Service located at 108 North Main Street in Bucoda, Washington, as the \"Mayor Rob Gordon Post Office\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 9487 (Rep. Steil):\n        A bill to amend the Legislative Reorganization Act of 1970 to authorize the Legislative Counsel of the House of Representatives to designate more than one of the attorneys of the Office of the Legislative Counsel as a Deputy Legislative Counsel, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 9544 (Rep. Mfume):\n        A bill to designate the facility of the United States Postal Service located at 340 South Loudon Avenue in Baltimore, Maryland, as the \"United States Representative Elijah E. Cummings Post Office Building\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 9549 (Rep. Bonamici):\n        A bill to designate the facility of the United States Postal Service located at 125 South 1st Avenue in Hillsboro, Oregon, as the \"Elizabeth Furse Post Office Building\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 9580 (Rep. Ross):\n        A bill to designate the facility of the United States Postal Service located at 2777 Brentwood Road in Raleigh, North Carolina, as the \"Millie Dunn Veasey Post Office\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 9592 (Rep. Higgins):\n        A bill to amend title 44, United States Code, to modernize the Federal Register, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 9600 (Rep. Bishop):\n        A bill to designate the facility of the United States Postal Service located at 119 Main Street in Plains, Georgia, as the \"Jimmy and Rosalynn Carter Post Office\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 9775 (Rep. Spartz):\n        A bill to designate the facility of the United States Postal Service located at 119 North Anderson Street in Elwood, Indiana, as the \"Officer Noah Jacob Shahnavaz Post Office Building\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 10065 (Rep. Cloud):\n        A bill to designate the facility of the United States Postal Service located at 802 North Tancahua Street in Corpus Christi, Texas, as the \"Captain Robert E. 'Bob' Batterson Post Office\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 623 (Sen. Murkowski):\n        A bill to amend the Alaska Native Claims Settlement Act to exclude certain payments to aged, blind, or disabled Alaska Natives or descendants of Alaska Natives from being used to determine eligibility for certain programs, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 2020 (Sen. Merkley):\n        A bill to amend the Oregon Resource Conservation Act of 1996 to reauthorize the Deschutes River Conservancy Working Group, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 2160 (Sen. Risch):\n        A bill to amend the Omnibus Public Land Management Act of 2009 to authorize certain extraordinary operation and maintenance work for urban canals of concern.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 2742 (Sen. Gillibrand):\n        A bill to establish the Fort Ontario National Monument in the State of New York as a unit of the National Park System, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S. 2784 (Sen. Brown):\n        A bill to amend the Dayton Aviation Heritage Preservation Act of 1992 to adjust the boundary of the Dayton Aviation Heritage National Historical Park, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 3617 (Sen. Murkowski):\n        A bill to provide equitable treatment for the people of the Village Corporation established for the Native Village of Saxman, Alaska, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 3790 (Sen. Sullivan):\n        A bill to extend the Alaska Native Vietnam era veterans land allotment program, and for other purposes.\n\n        -- Passed Senate with an amendment and an amendment to the Title by Unanimous Consent.\n\n\n S. 4404 (Sen. Cramer):\n        A bill to designate the facility of the United States Postal Service located at 840 Front Street in Casselton, North Dakota, as the \"Commander Delbert Austin Olson Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 4451 (Sen. Padilla):\n        A bill to require the Secretary of the Interior to enter into an agreement with the National Academy of Sciences to carry out a study on reservation systems for Federal land.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 4511 (Sen. Lee):\n        A bill to provide for the crediting of funds received by the National Guard Bureau as reimbursement from States.\n\n        -- Senate Committee on Armed Services discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n \n\n S.Amdt. 3345 (Sen. Lee):\n        In the nature of a substitute.\n\n        --Amendment SA 3345 proposed by Senator Lee.\n\n        --Amendment SA 3345 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 4607 (Sen. Hawley):\n        A bill to designate the America's National Churchill Museum National Historic Landmark, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S. 4634 (Sen. Crapo):\n        A bill to designate the facility of the United States Postal Service located at 154 First Avenue East in Jerome, Idaho, as the \"Representative Maxine Bell Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 4640 (Sen. Ossoff):\n        A bill to strengthen trafficking victim assistance grant funding.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3350 (Sen. Ossoff):\n        In the nature of substitute.\n\n        --Amendment SA 3350 proposed by Senator Bennet for Senator Ossoff.\n\n        --Amendment SA 3350 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 4803 (Sen. Klobuchar):\n        A bill to designate the facility of the United States Postal Service located at 31143 State Highway 65 in Pengilly, Minnesota, as the \"First Lieutenant Richard Arne Koski Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 4851 (Sen. Padilla):\n        A bill to adjust the boundaries of the Golden Gate National Recreation Area to include the Scarper Ridge property.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 4974 (Sen. Murkowski):\n        A bill to amend the John D. Dingell, Jr. Conservation, Management, and Recreation Act to reauthorize the National Volcano Early Warning and Monitoring System, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 5062 (Sen. Blackburn):\n        A bill to address sexual harassment and sexual assault of Bureau of Prisons staff in prisons, and for other purposes.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3349 (Sen. Blackburn):\n        In the nature of a substitute.\n\n        --Amendment SA 3349 proposed by Senator Bennet for Senator Blackburn.\n\n        --Amendment SA 3349 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 936 (Sen. Padilla):\n        A resolution congratulating the Los Angeles Galaxy for winning the 2024 Major League Soccer Cup.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 937 (Sen. Schumer):\n        A resolution to authorize testimony and representation in United States v. Warnagiris.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, December 19)","actionItem":"PN1414-2:\n        Col. Ralph J. Rizzo, Jr., in the Marine Corps, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1534-2:\n        Benjamin J. Spector, in the Coast Guard, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1995:\n        Maj. Gen. Gregory J. Brady, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2049:\n        Maj. Gen. Johnny K. Davis, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2051:\n        242 nominations in the Air Force beginning with Justin S. Alberico and ending with Jonathan A. Zannis\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2052:\n        98 nominations in the Air Force beginning with Stephen M. Addington and ending with Joshua J. Wolfram\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2053:\n        73 nominations in the Air Force beginning with Lee Edmond Akers and ending with Michael Gray Yttri\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2054:\n        92 nominations in the Air Force beginning with Phillip N. Alvarez and ending with Stanley Y. Wong\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2055:\n        11 nominations in the Air Force beginning with Eric Starr Buss and ending with Jonathan M. Walker\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2056:\n        27 nominations in the Air Force beginning with Stephen V. S. Alexander and ending with Yesun Yoon\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2130:\n        Alexander B. Currie, in the Coast Guard, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2131:\n        Holly A. Bergman, in the Coast Guard, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2132:\n        Jillian H. Beecher, in the Coast Guard, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2135:\n        27 nominations in the Air Force beginning with Lakisha N. Albertie and ending with Keri L. Young\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2137:\n        16 nominations in the Air Force beginning with John C. Batka and ending with Richard Y. K. Yoo\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2170:\n        18 nominations in the Navy beginning with Capt. Walter H. Allman III and ending with Capt. Thomas J. Zerr\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2172:\n        3 nominations in the Navy beginning with Capt. Andrew M. Biehn and ending with Capt. Brian A. Metcalf\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2187:\n        Keith A. Schultz, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2188:\n        Francis X. Parr III, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2228:\n        7 nominations in the Coast Guard beginning with Thomas E. Adams and ending with Marie L. Sevin\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2229:\n        Jesse Collins, in the Coast Guard, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2230:\n        209 nominations in the Coast Guard beginning with Jason A. Acuna and ending with David J. Zwirblis\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2231:\n        70 nominations in the Coast Guard beginning with Ryan G. Angelo and ending with Jeffrey S. Zamarin\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2246:\n        11 nominations in the Marine Corps beginning with Col. Timothy S. Brady, Jr. and ending with Col. Jeremy S. Winters\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2247:\n        3 nominations in the Navy beginning with Rear Adm. (lh) John E. Dougherty IV and ending with Rear Adm. (lh) Douglas L. Williams\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2248:\n        Rear Adm. (lh) Thomas M. Henderschedt, in the Navy, to be Rear Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2249:\n        14 nominations in the Navy beginning with Rear Adm. (lh) Christopher D. Alexander and ending with Rear Adm. (lh) Michael S. Wosje\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2250:\n        Jay E. Butterfield, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2251:\n        2 nominations in the Air Force beginning with Thomas A. Hutton and ending with Robert D. Mcallister\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2252:\n        2 nominations in the Air Force beginning with Robert L. Bell and ending with Daniel J. Brown\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2253:\n        Gabriel R. Bultz, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2254:\n        114 nominations in the Army beginning with Cora L. Allen and ending with 0003434384\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2255:\n        Rafael J. Kaplan, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2256:\n        78 nominations in the Navy beginning with Christopher D. Caraway and ending with Bradford M. Winkelman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2257:\n        Erik C. Hedval, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2258:\n        Kenneth N. Wooten, in the Space Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2259:\n        Brenda L. Beegle, in the Space Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2267:\n        Maj. Gen. Luke C. G. Cropsey, in the Air Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2268:\n        Maj. Gen. Mark B. Pye, in the Air Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2269:\n        Col. Matthew C. Brown, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2271:\n        Col. Tonri C. Brown, in the Army, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2275:\n        Keith C. Braddy, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2281:\n        Lt. Gen. Curtis A. Buzzard, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2287:\n        Maj. Gen. Brett G. Sylvia, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Recess","actionItem":"By unanimous consent, on the request of Mr. Bennet, at  8:18 p.m., the Senate recessed, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}