{"retrieved-date":"2022-12-14","actions-date":"Tuesday, December 13, 2022","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, December 13)","actionItem":"H.R. 7776 (Rep. DeFazio):\n        A bill to provide for improvements to the rivers and harbors of the United States, to provide for the conservation and development of water and related resources, and for other purposes.\n\n        -- Message on House action received in Senate and at desk: House amendment to Senate amendment.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Motion by Senator Schumer to concur in the House amendment to the Senate amendment to H.R. 7776 made in Senate.\n\n        -- Motion by Senator Schumer to concur in the House amendment to the Senate amendment to H.R. 7776 with an amendment (SA 6513) made in Senate.\n\n        -- Motion by Senator Schumer to refer to Senate Committee on Armed Services the House message to accompany H.R. 7776 with instructions to report back forthwith with the following amendment (SA 6516) made in Senate.\n \n\n S.Amdt. 6513 (Sen. Manchin):\n        To provide for American energy security by improving the permitting process.\n\n        --Amendment SA 6513 proposed by Senator Schumer for Senator Manchin.\n\n\n S.Amdt. 6515 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 6515 proposed by Senator Schumer to Amendment SA 6513.\n\n\n S.Amdt. 6516 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 6516 proposed by Senator Schumer.\n\n\n S.Amdt. 6517 (Sen. Schumer):\n        To modify the effective date.\n\n        --Amendment SA 6517 proposed by Senator Schumer to Amendment SA 6516 (the instructions of the motion to refer).\n\n\n S.Amdt. 6518 (Sen. Schumer):\n        To modify the effective date.\n\n        --Amendment SA 6518 proposed by Senator Schumer to Amendment SA 6517.\n\n\n\n\n S. 198 (Sen. Rosen):\n        A bill to require the Federal Communications Commission to incorporate data on maternal health outcomes into its broadband health maps.\n\n        -- Senate agreed to the House amendment to S. 198 by Unanimous Consent.\n\n\n S. 1466 (Sen. Merkley):\n        A bill to authorize the Director of the United States Geological Survey to establish a regional program to assess, monitor , and benefit the hydrology of saline lakes in the Great Basin and the migratory birds and other wildlife dependent on those habitats, and for other purposes.\n\n        -- Message on House action received in Senate and at desk: House amendment to Senate bill.\n\n\n S. 4926 (Sen. Cornyn):\n        A bill to amend chapter 33 of title 28, United States Code, to require appropriate use of multidisciplinary teams for investigations of child sexual exploitation or abuse, the production of child sexual abuse material, or child trafficking conducted by the Federal Bureau of Investigation.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6519 (Sen. Cornyn):\n        In the nature of a substitute.\n\n        --Amendment SA 6519 proposed by Senator Schumer for Senator Cornyn.\n\n        --Amendment SA 6519 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 5006 (Sen. Kaine):\n        A bill to designate the month of September as African Diaspora Heritage Month.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 869 (Sen. Wyden):\n        A resolution commending and congratulating the Portland Thorns Football Club on winning the 2022 National Women's Soccer League championship.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 870 (Sen. Blumenthal):\n        A resolution honoring the life and the legacy of Secretary Ash Carter.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, December 13)","actionItem":"PN1055:\n        Michael Battle, of Georgia, to be Ambassador to the United Republic of Tanzania\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1815:\n        Jay Curtis Shambaugh, of Maryland, to be an Under Secretary of the Treasury\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 70 - 27. Record Vote Number: 389 \n\n\n\n PN1816:\n        William H. Duncan, of Texas, to be Ambassador to the Republic of El Salvador\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1958:\n        Carol Spahn, of Maryland, to be Director of the Peace Corps\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1960:\n        Rachna Sachdeva Korhonen, of New Jersey, to be Ambassador to the Republic of Mali\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2134:\n        Heide B. Fulton, of West Virginia, to be Ambassador to the Oriental Republic of Uruguay\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2249:\n        Catherine J.K. Sandoval, of California, to be a Member of Chemical Safety and Hazard Investigation Board for a term of five years\n\n        -- Senate Committee on Environment and Public Works discharged by Unanimous Consent.\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2252:\n        Robert J. Faucher, of Arizona, to be Ambassador to the Republic of Suriname\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2253:\n        Kenneth Merten, of Virginia, to be Ambassador to the Republic of Bulgaria\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2257:\n        Julie D. Fisher, of Tennessee, to be Ambassador to the Republic of Cyprus\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2258:\n        Christopher T. Robinson, of Maryland, to be Ambassador to the Republic of Latvia\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2261:\n        Dana M. Douglas, of Louisiana, to be United States Circuit Judge for the Fifth Circuit\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 65 - 31. Record Vote Number: 388 \n\n\n\n PN2309:\n        Manuel P. Micaller, Jr., of California, to be Ambassador to the Republic of Tajikistan\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2310:\n        Kristina A. Kvien, of California, to be Ambassador to the Republic of Armenia\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2311:\n        Henry V. Jardine, of Virginia, to be Ambassador to the Republic of Mauritius, and to serve concurrently and without additional compensation as Ambassador to the Republic of Seychelles\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2402:\n        Stephen A. Owens, of Arizona, to be Chairperson of the Chemical Safety and Hazard Investigation Board for a term of five years\n\n        -- Senate Committee on Environment and Public Works discharged by Unanimous Consent.\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2455:\n        Bijan Sabet, of Massachusetts, to be Ambassador to the Czech Republic\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2592:\n        George P. Kent, of Massachusetts, to be Ambassador to the Republic of Estonia\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  8:23 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}