{"retrieved-date":"2025-9-11","actions-date":"Wednesday, September 10, 2025","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, September 10)","actionItem":"S. 93 (Sen. Sullivan):\n        A bill to amend the Harmful Algal Bloom and Hypoxia Research and Control Act of 1998 to address harmful algal blooms, and for other purposes.\n\n        -- Passed Senate without amendment and an amendment to the Title by Unanimous Consent.\n\n\n S. 306 (Sen. Cantwell):\n        A bill to establish and maintain a coordinated program within the National Oceanic and Atmospheric Administration that improves wildfire, fire weather, fire risk, and wildfire smoke related forecasting, detection, modeling, observations, and service delivery, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 725 (Sen. Klobuchar):\n        A bill to direct the Federal Communications Commission to issue reports after activation of the Disaster Information Reporting System and to make improvements to network outage reporting, to categorize public safety telecommunicators as a protective service occupation under the Standard Occupational Classification system, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 759 (Sen. Cruz):\n        A bill to provide for standardization, publication, and accessibility of data relating to public outdoor recreational use of Federal waterways, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 2296 (Sen. Wicker):\n        An original bill to authorize appropriations for fiscal year 2026 for military activities of the Department of Defense, for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\n\n        -- Considered by Senate.\n\n        -- Motion by Senator Thune to recommit to Senate Committee on Armed Services with instructions to report back forthwith with the following amendment (SA 3866) made in Senate.\n \n\n S.Amdt. 3427 (Sen. Ernst):\n        To require the Comptroller General of the United States to conduct a study on casualty assistance and long-term care programs.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3748 (Sen. Wicker):\n        In the nature of a substitute.\n\n        --Considered by Senate.\n\n\n S.Amdt. 3849 (Sen. Schumer):\n        To direct the Attorney General to make publicly available documents related to Jeffrey Epstein.\n\n        --Amendment SA 3849 proposed by Senator Schumer to language proposed to be stricken by amendment no. 3748.\n\n        --Cloture motion on SA 3849 presented in Senate.\n\n        --Motion to table amendment SA 3849 agreed to in Senate by Yea-Nay Vote. 51 - 49. Record Vote Number: \n\n        --Cloture motion on SA 3849 rendered moot in Senate.\n\n\n S.Amdt. 3854 (Sen. Schatz):\n        To add an effective date.\n\n        --Amendment SA 3854 proposed by Senator Schatz to Amendment SA 3849.\n\n        --SA 3854 fell when SA 3849 tabled.\n\n\n S.Amdt. 3863 (Sen. Thune):\n        To improve the bill.\n\n        --Amendment SA 3863 proposed by Senator Thune to Amendment SA 3427.\n\n\n S.Amdt. 3864 (Sen. Thune):\n        To improve the bill.\n\n        --Amendment SA 3864 proposed by Senator Thune to Amendment SA 3748 to language proposed to be stricken by amendment no. 3748.\n\n\n S.Amdt. 3865 (Sen. Thune):\n        To improve the bill.\n\n        --Amendment SA 3865 proposed by Senator Thune to Amendment SA 3864.\n\n\n S.Amdt. 3866 (Sen. Thune):\n        To improve the bill.\n\n        --Amendment SA 3866 proposed by Senator Thune.\n\n\n S.Amdt. 3867 (Sen. Thune):\n        To improve the bill.\n\n        --Amendment SA 3867 proposed by Senator Thune to Amendment SA 3866 (the instructions of the motion to recommit).\n\n\n S.Amdt. 3868 (Sen. Thune):\n        To improve the bill.\n\n        --Amendment SA 3868 proposed by Senator Thune to Amendment SA 3867.\n\n\n\n\n S.Res. 383 (Sen. Blumenthal):\n        A resolution commemorating the 80th anniversary of the conclusion of World War II with the surrender of Imperial Japan and honoring veterans of both the Pacific and European theaters.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  6:37 p.m, the Presiding Officer (Mr. Justice in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}