{"retrieved-date":"2024-8-2","actions-date":"Tue, 30 Jul 2024 13:04:40 -0400","actions-title":"House Floor Proceedings","actions-count":9,"actions-list":[{"index":1,"header":"--","actionItem":"The Speaker announced that the House do now adjourn pursuant to section 3(z) of H. Res. 5. The next meeting is scheduled for 11:00 a.m. on August 2, 2024.","actionTimeStamp":"Tue, 30 Jul 2024 13:04:40 -0400"},{"index":2,"header":"Task Force on the Attempted Assassination of Donald J. Trump","actionItem":"Pursuant to section 1(b)(1) of House Resolution 1367, 118th Congress, and the order of the House of January 9, 2023, the Speaker appointed the following members of the House to the Task Force on the Attempted Assassination of Donald J. Trump: Mr. Kelly of Pennsylvania, Mr. Joyce of Ohio, Mr. Higgins of Louisiana, Mr. Green of Tennessee, Mr. Waltz, Mr. Fallon, Ms. Lee of Florida, Mr. Crow, Mr. Correa, Ms. Dean of Pennsylvania, Ms. Houlahan, Mr. Ivey and Mr. Moskowitz.","actionTimeStamp":"Tue, 30 Jul 2024 13:03:58 -0400"},{"index":3,"header":"--","actionItem":"The House received a communication from the Honorable Jim Jordan, Chairman, House Judiciary Committee. Pursuant to Section 4(b) of House Resolution 917, Mr. Jordan notified the House that the Committee on the Judiciary has commenced litigation against Merrick Garland, in his official capacity as Attorney General of the United States, to enforce a duly authorized, issued, and served congressional subpoena. The Committee filed the civil action, Committee on the Judiciary, U.S. House of Representatives v. Garland, No. 1:24-cv-01911, in the U.S. District Court for the District of Columbia on July 1, 2024.","actionTimeStamp":"Tue, 30 Jul 2024 13:03:38 -0400"},{"index":4,"header":"--","actionItem":"The House received a message from the Acting Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Representatives, the Acting Clerk notified the House that he had received the following message from the Secretary of the Senate on July 30, 2024, at 9:53 a.m.: That the Senate passed S. 3574 and S. 4610.","actionTimeStamp":"Tue, 30 Jul 2024 13:02:44 -0400"},{"index":5,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair led the House in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Tue, 30 Jul 2024 13:02:13 -0400"},{"index":6,"header":"SPEAKER'S APPROVAL OF THE JOURNAL","actionItem":"Pursuant to section 3(z) of H. Res. 5, the Journal of the last day's proceedings was approved.","actionTimeStamp":"Tue, 30 Jul 2024 13:02:01 -0400"},{"index":7,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Tue, 30 Jul 2024 13:00:52 -0400"},{"index":8,"header":"--","actionItem":"The Speaker designated the Honorable H. Morgan Griffith to act as Speaker pro tempore for today.","actionTimeStamp":"Tue, 30 Jul 2024 13:00:26 -0400"},{"index":9,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Tue, 30 Jul 2024 13:00:00 -0400"}]}