{"retrieved-date":"2025-2-21","actions-date":"Thursday, February 20, 2025","actions-title":"Recent Floor Activity","actions-count":8,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday,the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, February 20)","actionItem":"S.Con.Res. 7 (Sen. Graham):\n        An original concurrent resolution setting forth the congressional budget for the United States Government for fiscal year 2025 and setting forth the appropriate budgetary levels for fiscal years 2026 through 2034.\n\n        -- Considered by Senate.\n\n        -- Resolution agreed to in Senate with amendments by Yea-Nay Vote. 52 - 48. Record Vote Number: 87 \n\n \n\n S.Amdt. 130 (Sen. Warner):\n        To create a point of order against any reconciliation bill that would not decrease the cost of housing for American families.\n\n        --Amendment SA 130 proposed by Senator Warner.\n\n        --Point of order that the amendment violates section 305(b)(2) of the CBA raised in Senate with respect to amendment SA 130.\n\n        --Motion to waive all applicable budgetary discipline with respect to amendment SA 130 rejected in Senate by Yea-Nay Vote. 47 - 53. Record Vote Number: \n\n        --Amendment SA 130 ruled out of order by the chair.\n\n\n S.Amdt. 276 (Sen. Baldwin):\n        To create a point of order against legislation that would take away health care from seniors, including those receiving care in nursing homes, through cuts to the Medicaid program.\n\n        --Amendment SA 276 proposed by Senator Baldwin.\n\n        --Point of order that the amendment violates section 305(b)(2) of the CBA raised in Senate with respect to amendment SA 276.\n\n        --Motion to waive all applicable budgetary discipline with respect to amendment SA 276 rejected in Senate by Yea-Nay Vote. 48 - 52. Record Vote Number: \n\n        --Amendment SA 276 ruled out of order by the chair.\n\n\n S.Amdt. 316 (Sen. Schiff):\n        To establish a deficit-neutral reserve fund relating to supporting Federal wildland firefighters and associated personnel.\n\n        --Amendment SA 316 proposed by Senator Schiff.\n\n        --Amendment SA 316 not agreed to in Senate by Yea-Nay Vote. 48 - 52. Record Vote Number: \n\n\n S.Amdt. 407 (Sen. Ossoff):\n        To establish a deficit-neutral reserve fund relating to protecting access to maternal and pediatric health care throughMedicaid.\n\n        --Amendment SA 407 proposed by Senator Ossoff.\n\n        --Amendment SA 407 not agreed to in Senate by Yea-Nay Vote. 49 - 51. Record Vote Number: \n\n\n S.Amdt. 454 (Sen. Schumer):\n        To prevent unwarranted tax cuts for the ultra-rich.\n\n        --Amendment SA 454 proposed by Senator Schumer.\n\n        --Point of order that the amendment violates section 305(b)(2) of the CBA raised in Senate with respect to amendment SA 454.\n\n        --Motion to waive all applicable budgetary discipline with respect to amendment SA 454 rejected in Senate by Yea-Nay Vote. 47 - 52. Record Vote Number: \n\n        --Amendment SA 454 ruled out of order by the chair.\n\n\n S.Amdt. 473 (Sen. Merkley):\n        To establish a deficit-neutral reserve fund relating to the impacts of hedge fund ownership of single-family homes and rent prices.\n\n        --Amendment SA 473 proposed by Senator Merkley.\n\n        --Amendment SA 473 not agreed to in Senate by Yea-Nay Vote. 48 - 52. Record Vote Number: \n\n\n S.Amdt. 494 (Sen. Klobuchar):\n        To stop tax cuts for the ultra-rich while familiesstruggle to put food on the table.\n\n        --Amendment SA 494 proposed by Senator Klobuchar.\n\n        --Point of order that the amendment violates section 305(b)(2) of the CBA raised in Senate with respect to amendment SA 494.\n\n        --Motion to waive all applicable budgetary discipline with respect to amendment SA 494 rejected in Senate by Yea-Nay Vote. 48 - 52. Record Vote Number: \n\n        --Amendment SA 494 ruled out of order by the chair.\n\n\n S.Amdt. 540 (Sen. Bennet):\n        To establish a deficit-neutral reserve fund relating to reinstating the fired Federal employees at the Forest Service, National Park Service, United States Fish and Wildlife Service, and Bureau of Land Management.\n\n        --Amendment SA 540 proposed by Senator Bennet.\n\n        --Amendment SA 540 not agreed to in Senate by Yea-Nay Vote. 48 - 52. Record Vote Number: \n\n\n S.Amdt. 776 (Sen. Schumer):\n        To prevent tax cuts for the wealthy if a single dollar of Medicaid funding is cut.\n\n        --Amendment SA 776 proposed by Senator Schumer.\n\n        --Point of order that the amendment violates section 305(b)(2) of the CBA raised in Senate with respect to amendment SA 776.\n\n        --Motion to waive all applicable budgetary discipline with respect to amendment SA 776 rejected in Senate by Yea-Nay Vote. 49 - 51. Record Vote Number: \n\n        --Amendment SA 776 ruled out of order by the chair.\n\n\n S.Amdt. 878 (Sen. Murray):\n        To strike the reconciliation instructions and create a reserve fund to implement a bipartisan, multi-year agreement to provide up to $171,000,000,000 in discretionary funding for defense and up to $171,000,000,000 in discretionary funding for other programs, accounts, and activities to address border, veterans, farmers, food and nutrition, disaster relief, and other needs.\n\n        --Amendment SA 878 proposed by Senator Murray.\n\n        --Amendment SA 878 not agreed to in Senate by Yea-Nay Vote. 47 - 53. Record Vote Number: \n\n\n S.Amdt. 925 (Sen. Hickenlooper):\n        To create a point of order against legislation that would raise energy costs for Americans, including higher monthly electricity bills, building material expenses, and transportation costs.\n\n        --Amendment SA 925 proposed by Senator Hickenlooper.\n\n        --Point of order that the amendment violates section 305(b)(2) of the CBA raised in Senate with respect to amendment SA 925.\n\n        --Motion to waive all applicable budgetary discipline with respect to amendment SA 925 rejected in Senate by Yea-Nay Vote. 47 - 53. Record Vote Number: \n\n        --Amendment SA 925 ruled out of order by the chair.\n\n\n S.Amdt. 1029 (Sen. Sullivan):\n        To establish a deficit-neutral reserve fund relating to protecting Medicare and Medicaid.\n\n        --Amendment SA 1029 proposed by Senator Sullivan.\n\n        --Amendment SA 1029 agreed to in Senate by Yea-Nay Vote. 51 - 49. Record Vote Number: \n\n\n S.Amdt. 1156 (Sen. Wyden):\n        To prevent millions of Americans from being kickedoff their health coverage, suffering needlessly, getting sicker, and dying sooner.\n\n        --Amendment SA 1156 proposed by Senator Wyden.\n\n        --Point of order that the amendment violates section 305(b)(2) of the CBA raised in Senate with respect to amendment SA 1156.\n\n        --Motion to waive all applicable budgetary discipline with respect to amendment SA 1156 rejected in Senate by Yea-Nay Vote. 47 - 53. Record Vote Number: \n\n        --Amendment SA 1156 ruled out of order by the chair.","actionTimeStamp":"--"},{"index":5,"header":"Legislative Business (Friday, February 21)","actionItem":"S.Res. 87 (Sen. Durbin):\n        A resolution designating February 2025 as \"American Heart Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 88 (Sen. Grassley):\n        A resolution designating March 7, 2025, as \"National Speech and Debate Education Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 89 (Sen. Young):\n        A resolution expressing support for the designation of February 15 through February 22, 2025, as \"National FFA Week\", recognizing the important role of the National FFA Organization in developing the next generation of leaders who will change the world, and celebrating the 90th anniversary of New Farmers of America and the 75th anniversary of the Future Farmers of America Federal charter.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Con.Res. 7 (Sen. Graham):\n        An original concurrent resolution setting forth the congressional budget for the United States Government for fiscal year 2025 and setting forth the appropriate budgetary levels for fiscal years 2026 through 2034.\n\n        -- Considered by Senate.\n\n        -- Resolution agreed to in Senate with amendments by Yea-Nay Vote. 52 - 48. Record Vote Number: 87 \n\n \n\n S.Amdt. 101 (Sen. Heinrich):\n        To establish a deficit-neutral reserve fund relating to funding for grants awarded by the Office on Violence Against Women.\n\n        --Amendment SA 101 proposed by Senator Heinrich.\n\n        --Amendment SA 101 not agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 172 (Sen. Reed):\n        To create a point of order against legislation that would reduce Medicare and Medicaid benefits for Americans.\n\n        --Amendment SA 172 proposed by Senator Reed.\n\n        --Point of order that the amendment violates section 305(b)(2) of the CBA raised in Senate with respect to amendment SA 172.\n\n        --Motion to waive all applicable budgetary discipline with respect to amendment SA 172 rejected in Senate by Yea-Nay Vote. 49 - 51. Record Vote Number: \n\n        --Amendment SA 172 ruled out of order by the chair.\n\n\n S.Amdt. 198 (Sen. King):\n        To modify the provision relating to the general reserve fund.\n\n        --Amendment SA 198 proposed by Senator King.\n\n        --Amendment SA 198 not agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 233 (Sen. Van Hollen):\n        To create a point of order against legislation that would cut funding from the school lunch or school breakfast programs.\n\n        --Amendment SA 233 proposed by Senator Van Hollen.\n\n        --Point of order that the amendment violates section 305(b)(2) of the CBA raised in Senate with respect to amendment SA 233.\n\n        --Motion to waive all applicable budgetary discipline with respect to amendment SA 233 rejected in Senate by Yea-Nay Vote. 49 - 51. Record Vote Number: \n\n        --Amendment SA 233 ruled out of order by the chair.\n\n\n S.Amdt. 276 (Sen. Baldwin):\n        To create a point of order against legislation that would take away health care from seniors, including those receiving care in nursing homes, through cuts to the Medicaid program.\n\n        --Amendment SA 276 proposed by Senator Baldwin.\n\n        --Point of order that the amendment violates section 305(b)(2) of the CBA raised in Senate with respect to amendment SA 276.\n\n        --Motion to waive all applicable budgetary discipline with respect to amendment SA 276 rejected in Senate by Yea-Nay Vote. 48 - 52. Record Vote Number: \n\n        --Amendment SA 276 ruled out of order by the chair.\n\n\n S.Amdt. 299 (Sen. Reed):\n        To ensure continued United States support for the Government of Ukraine to stand firm against aggression by the Government ofRussia in Europe.\n\n        --Amendment SA 299 proposed by Senator Reed.\n\n        --Amendment SA 299 not agreed to in Senate by Yea-Nay Vote. 47 - 53. Record Vote Number: \n\n\n S.Amdt. 311 (Sen. Blunt Rochester):\n        To establish a deficit-neutral reserve fund relating to preventing the indiscriminate termination of Federal employees who protect the health or safety of Americans, which may include scientists, emergency preparedness staff, frontline health care workers, drug or medical device reviewers, or other employees at the Department of Health and Human Services.\n\n        --Amendment SA 311 proposed by Senator Blunt Rochester.\n\n        --Amendment SA 311 not agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 436 (Sen. Shaheen):\n        To establish a deficit-neutral reserve fund relating to preserving and extending vital tax credits enacted under the Patient Protection and Affordable Care Act, which make heath care accessible and affordable and that have led to the lowest uninsured rate inour Nation's history.\n\n        --Amendment SA 436 proposed by Senator Shaheen.\n\n        --Amendment SA 436 not agreed to in Senate by Yea-Nay Vote. 48 - 52. Record Vote Number: \n\n\n S.Amdt. 659 (Sen. Blumenthal):\n        To ensure full and uninterrupted funding for Department of Veterans Affairs health care and benefits provided by the Sergeant First Class Heath Robinson Honoring our Promise to Address Comprehensive Toxics Act of 2022 (Public Law 117-168), also known as the \"PACT Act\", preventing any cuts or delays.\n\n        --Amendment SA 659 proposed by Senator Blumenthal.\n\n        --Amendment SA 659 not agreed to in Senate by Yea-Nay Vote. 47 - 52. Record Vote Number: \n\n\n S.Amdt. 664 (Sen. Slotkin):\n        To establish a deficit-neutral reserve fund relating to preventing reductions in funding and staffing necessary to respond to, control, and prevent avian flu.\n\n        --Amendment SA 664 proposed by Senator Slotkin.\n\n        --Amendment SA 664 not agreed to in Senate by Yea-Nay Vote. 47 - 53. Record Vote Number: \n\n\n S.Amdt. 699 (Sen. Lujan):\n        To establish a deficit-neutral reserve fund relating to supporting police, which may include initiatives that provide funding directly to law enforcement agencies to hire or rehire additional career law enforcement officers in an effort to increase their community policing capacity and crime prevention efforts.\n\n        --Amendment SA 699 proposed by Senator Lujan.\n\n        --Amendment SA 699 not agreed to in Senate by Yea-Nay Vote. 48 - 52. Record Vote Number: \n\n\n S.Amdt. 734 (Sen. Warren):\n        To modify the provision relating to the general reserve fund.\n\n        --Amendment SA 734 proposed by Senator Warren.\n\n        --Amendment SA 734 not agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 880 (Sen. Murray):\n        To establish a deficit-neutral reserve fund relating to reversing the Trump Administration's indiscriminate cut to biomedical research and the lifesaving work supported by the National Institutes of Health at research institutions across the country.\n\n        --Amendment SA 880 proposed by Senator Murray.\n\n        --Amendment SA 880 not agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 911 (Sen. Markey):\n        To establish a deficit-neutral reserve fund relating to increasing funding for research on Alzheimer's disease and related dementias.\n\n        --Amendment SA 911 proposed by Senator Markey.\n\n        --Amendment SA 911 not agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 922 (Sen. Lee):\n        To establish a deficit-neutral reserve fund relating to Congress continuing its work to rein in the administrative state by supporting legislation that prevents Federal agencies from finalizing major rules without congressional approval, strengthens the Article 1 law-making powers of Congress, cuts spending resulting from costly regulations, reduces inflation, and unleashes economic growth.\n\n        --Amendment SA 922 proposed by Senator Lee.\n\n        --Amendment SA 922 agreed to in Senate by Yea-Nay Vote. 53 - 47. Record Vote Number: \n\n\n S.Amdt. 957 (Sen. Lujan):\n        To strike reconciliation instructions requiring damaging cuts to programs critical to rural Americans and food assistance for American families.\n\n        --Amendment SA 957 proposed by Senator Lujan.\n\n        --Amendment SA 957 not agreed to in Senate by Yea-Nay Vote. 47 - 53. Record Vote Number: \n\n\n S.Amdt. 971 (Sen. Duckworth):\n        To establish a deficit-neutral reserve fund relating to protecting access to fertility services, and eliminating barriers for families in need of high-quality, affordable fertility services by expanding nationwide coverage for in vitro fertilization.\n\n        --Amendment SA 971 proposed by Senator Duckworth.\n\n        --Amendment SA 971 not agreed to in Senate by Yea-Nay Vote. 49 - 51. Record Vote Number: \n\n\n S.Amdt. 984 (Sen. Kelly):\n        To modify the provision relating to the general reserve fund.\n\n        --Amendment SA 984 proposed by Senator Kelly.\n\n        --Amendment SA 984 not agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 999 (Sen. Paul):\n        To require an adequate amount of deficit reductionas part of reconciliation.\n\n        --Amendment SA 999 proposed by Senator Paul.\n\n        --Amendment SA 999 not agreed to in Senate by Yea-Nay Vote. 24 - 76. Record Vote Number: \n\n\n S.Amdt. 1207 (Sen. Merkley):\n        To establish a deficit-neutral reserve fund relating to ending price gouging on prescription drugs.\n\n        --Amendment SA 1207 proposed by Senator Merkley.\n\n        --Amendment SA 1207 not agreed to in Senate by Yea-Nay Vote. 49 - 51. Record Vote Number: \n\n\n S.Amdt. 1223 (Sen. Coons):\n        To protect Americans' privacy from unauthorized access by DOGE.\n\n        --Amendment SA 1223 proposed by Senator Coons.\n\n        --Amendment SA 1223 not agreed to in Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Executive Business (Thursday, February 20)","actionItem":"PN12-35:\n        Kashyap Patel, of Nevada, to be Director of the Federal Bureau of Investigation for a term of ten years\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 47. Record Vote Number: 60 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 49. Record Vote Number: 61","actionTimeStamp":"--"},{"index":7,"header":"Executive Business (Friday, February 21)","actionItem":"PN11-17:\n        Jamieson Greer, of Maryland, to be United States Trade Representative, with the rank of Ambassador\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN12-12:\n        Daniel Driscoll, of North Carolina, to be Secretary of the Army\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, debate 2/24/2025.","actionTimeStamp":"--"},{"index":8,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  4:51 a.m., the Senate adjourned, under its order of today, until  3 p.m. on Monday, February 24, 2025.","actionTimeStamp":"--"}]}