{"retrieved-date":"2023-2-8","actions-date":"Thursday, February 2, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, February  2)","actionItem":"H.Con.Res. 11 (Rep. Scalise):\n        A concurrent resolution providing for a joint session of Congress to receive a message from the President.\n\n        -- Resolution agreed to in Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S.Res. 27 (Sen. Peters):\n        A resolution designating February 1, 2023, as \"Blue Star Mother's Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 28 (Sen. Cantwell):\n        A resolution commemorating the 20-year anniversary of the loss of Space Shuttle Columbia.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 29 (Sen. Tester):\n        A resolution designating the week beginning February 5, 2023, as \"National Tribal Colleges and Universities Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 30 (Sen. Schumer):\n        A resolution to constitute the majority party's membership on certain committees for the One Hundred Eighteenth Congress, or until their successors are chosen.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.\n\n\n S.Res. 31 (Sen. McConnell):\n        A resolution to constitute the minority party's membership on certain committees for the One Hundred Eighteenth Congress, or until their successors are chosen.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, February  2)","actionItem":"PN61:\n        Joseph Lee Falk, of Florida, to be a Member of the Board of Directors of the United States Institute of Peace for a term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 60 - 37. Record Vote Number: 5 \n\n\n\n PN88:\n        DeAndrea Gist Benjamin, of South Carolina, to be United States Circuit Judge for the Fourth Circuit\n\n        -- Reported by Senator Durbin, Committee on the Judiciary, without printed report.\n\n        -- Placed on Senate Executive Calendar. Calendar No. 3.\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- By unanimous consent agreement, debate 2/7/2023.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  4:02 p.m., the Senate adjourned, under its order of today, until 11 a.m. tomorrow.","actionTimeStamp":"--"}]}