{"retrieved-date":"2022-12-8","actions-date":"Tuesday, December 6, 2022","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, December  6)","actionItem":"H.R. 228 (Rep. LaMalfa):\n        A bill to designate the facility of the United States Postal Service located at 2141 Ferry Street in Anderson, California, as the \"Norma Comnick Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 263 (Rep. Quigley):\n        A bill to amend the Lacey Act Amendments of 1981 to clarify provisions enacted by the Captive Wildlife Safety Act, to further the conservation of certain wildlife species, and for other purposes.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n H.R. 700 (Rep. Foster):\n        A bill to designate the facility of the United States Postal Service located at 303 East Mississippi Avenue in Elwood, Illinois, as the \"Lawrence M. 'Larry' Walsh Sr. Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 3175 (Rep. Palazzo):\n        A bill to designate the facility of the United States Postal Service located at 135 Main Street in Biloxi, Mississippi, as the \"Robert S. McKeithen Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 5481 (Rep. Foxx):\n        To name the Department of Veterans Affairs community-based outpatient clinic in Forest City,   North Carolina, as the \"Master Sergeant Jerry K. Crump VA Clinic\".\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6614 (Rep. Tlaib):\n        A bill to designate the facility of the United States Postal Service located at 4744 Grand River Avenue in Detroit, Michigan, as the \"Rosa Louise McCauley Parks Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6722 (Rep. McNerney):\n        A bill to designate the Department of Veterans Affairs community-based outpatient clinic in French Camp, California, as the \"Richard A. Pittman VA Clinic\".\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6863 (Rep. Cohen):\n        A bill to designate the medical center of the Department of Veterans Affairs in Memphis, Tennessee, as the \"Lt. Col. Luke Weathers, Jr. VA Medical Center\".\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7077 (Rep. Torres):\n        A bill to require the United States Fire Administration to conduct on-site investigations of major fires, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6505 (Sen. Peters):\n        In the nature of a substitute.\n\n        --Amendment SA 6505 proposed by Senator Hassan for Senator Peters.\n\n        --Amendment SA 6505 agreed to in Senate by Unanimous Consent.\n\n\n\n\n H.R. 7903 (Rep. Stevens):\n        To designate the Department of Veterans Affairs community-based outpatient clinic located in Canton, Michigan, as the \"Major General Oliver W. Dillard VA Clinic\".\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7925 (Rep. Ruiz):\n        To designate the Department of Veterans Affairs community-based outpatient clinic located in Palm Desert, California, as the \"Sy Kaplan VA Clinic\".\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 198 (Sen. Rosen):\n        A bill to require the Federal Communications Commission to incorporate data on maternal health outcomes into its broadband health maps.\n\n        -- Message on House action received in Senate and at desk: House amendment to Senate bill.\n\n\n S. 2607 (Sen. Padilla):\n        A bill to award a Congressional Gold Medal to the former hostages of the Iran Hostage Crisis of 1979-1981, highlighting their resilience throughout the unprecedented ordeal that they lived through and the national unity it produced, marking 4 decades since their 444 days in captivity, and recognizing their sacrifice to the United States.\n\n        -- Senate Committee on Banking, Housing, and Urban Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 2773 (Sen. Leahy):\n        A bill to amend the Leahy-Smith America Invents Act to address satellite offices of the United States Patent and Trademark Office, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 3198 (Sen. Smith):\n        A bill to direct the Securities and Exchange Commission to revise any rules necessary to enable issuers of index-linked annuities to register on a form tailored specifically to registered index-linked annuities, and for other purposes.\n\n        -- Senate Committee on Banking, Housing, and Urban Affairs discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6506 (Sen. Smith):\n        In the nature of a substitute.\n\n        --Amendment SA 6506 proposed by Senator Hassan for Senator Smith.\n\n        --Amendment SA 6506 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 3903 (Sen. Lankford):\n        A bill to require the Commissioner of U.S. Customs and Border Protection to establish procedures for conducting maintenance projects at ports of entry at which the Office of Field Operations conducts certain enforcement and facilitation activities.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 5016 (Sen. Murkowski):\n        A bill to designate the medical center of the Department of Veterans Affairs located in Anchorage, Alaska, as the \"Colonel Mary Louise Rasmuson Campus of the Alaska VA Healthcare System\", and for other purposes.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 859 (Sen. Collins):\n        A resolution designating December 17, 2022, as \"National Wreaths Across America Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 860 (Sen. Cornyn):\n        A resolution expressing support for the designation of the week of November 14 through November 18, 2022, as \"National Family Service Learning Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 861 (Sen. Scott, of FL):\n        A resolution remembering the December 6, 2019, terrorist attack at Naval Air Station Pensacola and commemorating those who lost their lives, and those who were injured, in the line of duty.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, December  6)","actionItem":"PN2057:\n        David C. Davis, of Illinois, to be United States Marshal for the Southern District of Illinois for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2208:\n        Chrissie C. Latimore, of South Carolina, to be United States Marshal for the District of South Carolina for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2314:\n        Frances Kay Behm, of Michigan, to be United States District Judge for the Eastern District of Michigan\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 47 - 46. Record Vote Number: 374 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 49 - 47. Record Vote Number: 376 \n\n\n\n PN2365:\n        Kelley Brisbon Hodge, of Pennsylvania, to be United States District Judge for the Eastern District of Pennsylvania\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 43. Record Vote Number: 375 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 44. Record Vote Number: 377 \n\n\n\n PN2367:\n        Mia Roberts Perez, of Pennsylvania, to be United States District Judge for the Eastern District of Pennsylvania\n\n        -- Cloture motion withdrawn by unanimous consent in Senate.\n\n        -- By unanimous consent agreement, vote 12/7/2022.\n\n\n PN2368:\n        John Frank Murphy, of Pennsylvania, to be United States District Judge for the Eastern District of Pennsylvania\n\n        -- Cloture motion withdrawn by unanimous consent in Senate.\n\n        -- By unanimous consent agreement, vote 12/7/2022.\n\n\n PN2450:\n        Juan Eduardo Sanchez, of Texas, to be Federal Cochairperson of the Southwest Border Regional Commission\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2494:\n        Terry J. Burgin, of North Carolina, to be United States Marshal for the Western District of North Carolina for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2495:\n        Glenn M. McNeill, Jr., of North Carolina, to be United States Marshal for the Eastern District of North Carolina for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2639:\n        Roger B. Handberg, of Florida, to be United States Attorney for the Middle District of Florida for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2640:\n        Markenzy Lapointe, of Florida, to be United States Attorney for the Southern District of Florida for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2641:\n        McLain J. Schneider, of North Dakota, to be United States Attorney for the District of North Dakota for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2695:\n        Jaime E. Esparza, of Texas, to be United States Attorney for the Western District of Texas for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2696:\n        Alamdar S. Hamdani, of Texas, to be United States Attorney for the Southern District of Texas for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2697:\n        Peter D. Leary, of Georgia, to be United States Attorney for the Middle District of Georgia for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2698:\n        Leigha Simonton, of Texas, to be United States Attorney for the Northern District of Texas for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Ms. Hassan, at  7:04 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}