{"retrieved-date":"2023-12-13","actions-date":"Tuesday, December 12, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, December 12)","actionItem":"H.R. 2670 (Rep. Rogers):\n        A bill to authorize appropriations for fiscal year 2024 for military activities of the Department of Defense and for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\n\n        -- Conference report considered in Senate.\n\n        -- Motion to table the motion to recommit the conference report to accompany H.R. 2670 to the committee on conference with instructions rejected in Senate by Yea-Nay Vote. 23 - 76. Record Vote Number: 340 \n\n\n        -- Cloture on the conference report to accompany H.R. 2670 invoked in Senate by Yea-Nay Vote. 85 - 15. Record Vote Number: 341 \n\n\n        -- Motion by Senator Schumer to recommit the conference report to accompany H.R. 2670 to the committee on conference with instructions fell when cloture was invoked on the conference report to accompany H.R. 2670.\n \n\n S.Amdt. 1373 (Sen. Schumer):\n        To modify the effective date.\n\n        --Motion to table amendment SA 1373 rejected in Senate by Yea-Nay Vote. 47 - 53. Record Vote Number: \n\n        --SA 1373 (to the instructions of the motion to recommit) fell when cloture invoked on the conference report to accompany H.R. 2670.\n\n\n S.Amdt. 1374 (Sen. Schumer):\n        To modify the effective date.\n\n        --SA 1374 fell when SA 1373 fell.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, December 12)","actionItem":"PN876:\n        Harry Coker, Jr., of Kansas, to be National Cyber Director\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 59 - 40. Record Vote Number: 337 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 59 - 40. Record Vote Number: 338","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Reed, at  6:30 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}