{"retrieved-date":"2023-3-23","actions-date":"Thu, 23 Mar 2023 17:24:46 -0400","actions-title":"House Floor Proceedings","actions-count":57,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"Pursuant to the provisions of section 4 of H. Res. 199 the House proceeded with one hour of debate on the question of passage of H.J. Res. 30, objections of the President to the contrary notwithstanding.","actionTimeStamp":"Thu, 23 Mar 2023 17:24:46 -0400"},{"index":2,"header":"--","actionItem":"The Chair laid before the House the veto message from the President.","actionTimeStamp":"Thu, 23 Mar 2023 17:24:36 -0400"},{"index":3,"header":"UNFINISHED BUSINESS","actionItem":"The Chair announced the unfinished business was on passage of H.J. Res. 30, the objections of the President to the contrary notwithstanding.","actionTimeStamp":"Thu, 23 Mar 2023 17:23:38 -0400"},{"index":4,"header":"--","actionItem":"Committee of the Whole House on the state of the Union rises leaving H.R. 5 as unfinished business.","actionTimeStamp":"Thu, 23 Mar 2023 17:23:25 -0400"},{"index":5,"header":"--","actionItem":"On motion that the Committee rise Agreed to by voice vote.","actionTimeStamp":"Thu, 23 Mar 2023 17:23:13 -0400"},{"index":6,"header":"--","actionItem":"Ms. Foxx moved that the Committee rise.","actionTimeStamp":"Thu, 23 Mar 2023 17:22:52 -0400"},{"index":7,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Fitzpatrick Amendment No. 8, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Ms. Foxx demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 23 Mar 2023 17:21:38 -0400"},{"index":8,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 241, the Committee of the Whole proceeded with 10 minutes of debate on the Fitzpatrick Amendment No. 8.","actionTimeStamp":"Thu, 23 Mar 2023 17:20:51 -0400"},{"index":9,"header":"--","actionItem":"An amendment, offered by Mr. Fitzpatrick, to amend the bill to require the Comptroller General of the United States (GAO) to submit a report to Congress on the cost of the requirements of H.R. 5 to SEAs, LEAs, and elementary and secondary schools and requires the report to also analyze and evaluate the impact of H.R. 5 on protecting parents' rights in the education of the children.","actionTimeStamp":"Thu, 23 Mar 2023 17:20:11 -0400"},{"index":10,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Davidson Amendment No. 7, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Ms. Foxx demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 23 Mar 2023 17:19:06 -0400"},{"index":11,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 241, the Committee of the Whole proceeded with 10 minutes of debate on the Davidson (OH) amendment No. 7.","actionTimeStamp":"Thu, 23 Mar 2023 17:15:02 -0400"},{"index":12,"header":"--","actionItem":"An amendment, offered by Mr. Davidson,  numbered 7 printed in House Report 118-12 to prohibit federal funds unter Title I and Title II from going to a local educational agency unless they hold an open enrollment period.","actionTimeStamp":"Thu, 23 Mar 2023 17:14:38 -0400"},{"index":13,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Crane amendment No. 6, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Ms. Foxx demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 23 Mar 2023 17:14:09 -0400"},{"index":14,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 241, the Committee of the Whole proceeded with 10 minutes of debate on the Crane amendment No. 6.","actionTimeStamp":"Thu, 23 Mar 2023 17:07:46 -0400"},{"index":15,"header":"--","actionItem":"An amendment, offered by Mr. Crane,  numbered 6 printed in House Report 118-12 to add a private right of action for parents to hold schools accountable for not honoring the rights set forth in Title I and Title II of this bill.","actionTimeStamp":"Thu, 23 Mar 2023 17:07:24 -0400"},{"index":16,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Bonamici amendment No. 5, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Bonamici demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 23 Mar 2023 17:06:49 -0400"},{"index":17,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 241, the Committee of the Whole proceeded with 10 minutes of debate on the Bonamici amendment No. 5.","actionTimeStamp":"Thu, 23 Mar 2023 16:56:47 -0400"},{"index":18,"header":"--","actionItem":"An amendment, in the nature of a substitute offered by Ms. Bonamici,  numbered 5 printed in House Report 118-12 to strike line 1 and all that follows in H.R. 5 and replace with new text.","actionTimeStamp":"Thu, 23 Mar 2023 16:56:17 -0400"},{"index":19,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 23 Mar 2023 16:55:38 -0400"},{"index":20,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 241, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 4.","actionTimeStamp":"Thu, 23 Mar 2023 16:51:43 -0400"},{"index":21,"header":"--","actionItem":"An amendment, offered by Mrs. Boebert,  numbered 4 printed in House Report 118-12 to amend Section 104 to include Parent's Right to Know if their child's school allows a person whose biological sex is male to use restrooms or changing rooms desginated for women or girls.","actionTimeStamp":"Thu, 23 Mar 2023 16:50:02 -0400"},{"index":22,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 23 Mar 2023 16:49:22 -0400"},{"index":23,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 241, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 3.","actionTimeStamp":"Thu, 23 Mar 2023 16:43:03 -0400"},{"index":24,"header":"--","actionItem":"An amendment, offered by Mrs. Boebert,  numbered 3 printed in House Report 118-12 to amend Section 104 to include Parent's Right to Know if their child's school operates, sponsors, or facilitates athletic programs or activities to permit a person whose biological sex is male to participate in an athletic program or activity that is designated for women and girls.","actionTimeStamp":"Thu, 23 Mar 2023 16:43:00 -0400"},{"index":25,"header":"--","actionItem":"On agreeing to the Foxx amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 23 Mar 2023 16:42:27 -0400"},{"index":26,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 241, the Committee of the Whole proceeded with 10 minutes of debate on the Foxx amendment No. 2.","actionTimeStamp":"Thu, 23 Mar 2023 16:35:03 -0400"},{"index":27,"header":"--","actionItem":"An amendment, offered by Ms. Foxx,  numbered 2 printed in House Report 118-12 to align the list of rights school districts must provide notice of to actions school districts must take; amends a sense of Congress to express support for parents fundamental rights to direct the education of their children and that courts should use the strict scrutiny test to evaluate laws involving those rights.","actionTimeStamp":"Thu, 23 Mar 2023 16:34:24 -0400"},{"index":28,"header":"--","actionItem":"On agreeing to the Bacon amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 23 Mar 2023 16:33:54 -0400"},{"index":29,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 241, the Committee of the Whole proceeded with 10 minutes of debate on the Bacon amendment No. 1.","actionTimeStamp":"Thu, 23 Mar 2023 16:31:50 -0400"},{"index":30,"header":"--","actionItem":"An amendment, offered by Mr. Bacon,  numbered 1 printed in House Report 118-12 to require Local Education Agencies (LEA) to provide the parents of a child who is a student in an elementary school or secondary school the number of school counselors in that school.","actionTimeStamp":"Thu, 23 Mar 2023 16:30:09 -0400"},{"index":31,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with two hours of general debate on H.R. 5.","actionTimeStamp":"Thu, 23 Mar 2023 14:21:06 -0400"},{"index":32,"header":"--","actionItem":"The Speaker designated the Honorable Mike Flood to act as Chairman of the Committee.","actionTimeStamp":"Thu, 23 Mar 2023 14:20:55 -0400"},{"index":33,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 241 and Rule XVIII.","actionTimeStamp":"Thu, 23 Mar 2023 14:20:53 -0400"},{"index":34,"header":"--","actionItem":"Rule provides for consideration of H.R. 5 with 2 hours of general debate. Motion to recommit allowed. Measure will be considered read. Specified amendments are in order.","actionTimeStamp":"Thu, 23 Mar 2023 14:19:00 -0400"},{"index":35,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 241. H.R. 5 — \"To ensure the rights of parents are honored and protected in the Nation's public schools.\"","actionTimeStamp":"Thu, 23 Mar 2023 14:18:55 -0400"},{"index":36,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Thu, 23 Mar 2023 14:18:53 -0400"},{"index":37,"header":"On motion to suspend the rules and pass the bill Agreed to by the Yeas and Nays: (2/3 required): 388","actionItem":"33 (Roll no. 148).","actionTimeStamp":"Thu, 23 Mar 2023 14:18:52 -0400"},{"index":38,"header":"--","actionItem":"Considered as unfinished business. H.R. 406 — \"To provide for the treatment of the Association of Southeast Asian Nations as an international organization for purposes of the International Organizations Immunities Act, and for other purposes.\"","actionTimeStamp":"Thu, 23 Mar 2023 14:12:03 -0400"},{"index":39,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Thu, 23 Mar 2023 14:12:00 -0400"},{"index":40,"header":"On agreeing to the resolution Agreed to by recorded vote: 218","actionItem":"205 (Roll no. 147).","actionTimeStamp":"Thu, 23 Mar 2023 14:11:59 -0400"},{"index":41,"header":"On ordering the previous question Agreed to by the Yeas and Nays: 219","actionItem":"204 (Roll no. 146).","actionTimeStamp":"Thu, 23 Mar 2023 14:04:44 -0400"},{"index":42,"header":"--","actionItem":"Considered as unfinished business. H. Res. 241 — \"Providing for consideration of the bill (H.R. 5) to ensure the rights of parents are honored and protected in the Nation's public schools.\"","actionTimeStamp":"Thu, 23 Mar 2023 13:31:47 -0400"},{"index":43,"header":"UNFINISHED BUSINESS","actionItem":"The Chair announced that the unfinished business was on the question of ordering the previous question on H. Res. 241, on agreeing to H. Res. 241, if ordered, and on the motion to suspend the rules and pass H.R. 406, which had been debated earlier and on which further proceedings had been postponed.","actionTimeStamp":"Thu, 23 Mar 2023 13:31:16 -0400"},{"index":44,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of March 23.","actionTimeStamp":"Thu, 23 Mar 2023 13:30:43 -0400"},{"index":45,"header":"--","actionItem":"The Speaker announced that the House do now recess for a period of less than 15 minutes.","actionTimeStamp":"Thu, 23 Mar 2023 13:20:05 -0400"},{"index":46,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on H. Res. 241, the Chair put the question on ordering the previous question on the resolution and by voice vote, announced that the ayes had prevailed. Ms. Scanlon demanded the yeas and nays and the Chair postponed further proceedings on ordering the previous question until a time to be announced.","actionTimeStamp":"Thu, 23 Mar 2023 13:20:00 -0400"},{"index":47,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 241.","actionTimeStamp":"Thu, 23 Mar 2023 12:25:04 -0400"},{"index":48,"header":"--","actionItem":"Considered as privileged matter. H. Res. 241 — \"Providing for consideration of the bill (H.R. 5) to ensure the rights of parents are honored and protected in the Nation's public schools.\"","actionTimeStamp":"Thu, 23 Mar 2023 12:22:42 -0400"},{"index":49,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches which by direction of the Chair, would be limited to 15 per side of the aisle.","actionTimeStamp":"Thu, 23 Mar 2023 12:02:16 -0400"},{"index":50,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Ms. Ross to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 23 Mar 2023 12:01:59 -0400"},{"index":51,"header":"--","actionItem":"The Speaker announced approval of the Journal. Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Thu, 23 Mar 2023 12:01:49 -0400"},{"index":52,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Thu, 23 Mar 2023 12:00:08 -0400"},{"index":53,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of March 23.","actionTimeStamp":"Thu, 23 Mar 2023 12:00:01 -0400"},{"index":54,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Thu, 23 Mar 2023 10:26:11 -0400"},{"index":55,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Thu, 23 Mar 2023 10:00:33 -0400"},{"index":56,"header":"--","actionItem":"The Speaker designated the Honorable Jerry L. Carl to act as Speaker pro tempore for today.","actionTimeStamp":"Thu, 23 Mar 2023 10:00:19 -0400"},{"index":57,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 23 Mar 2023 10:00:00 -0400"}]}