{"retrieved-date":"2023-1-11","actions-date":"Wed, 11 Jan 2023 16:00:45 -0500","actions-title":"House Floor Proceedings","actions-count":28,"actions-list":[{"index":1,"header":"On motion to recommit Roll Call 28","actionItem":"Yea and Nay vote pending.","actionTimeStamp":"Wed, 11 Jan 2023 16:00:45 -0500"},{"index":2,"header":"--","actionItem":"Considered as unfinished business. H.R. 26 — \"To amend title 18, United States Code, to prohibit a health care practitioner from failing to exercise the proper degree of care in the case of a child who survives an abortion or attempted abortion.\"","actionTimeStamp":"Wed, 11 Jan 2023 16:00:10 -0500"},{"index":3,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of January 11.","actionTimeStamp":"Wed, 11 Jan 2023 16:00:00 -0500"},{"index":4,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is subject to the call of the Chair.","actionTimeStamp":"Wed, 11 Jan 2023 15:00:45 -0500"},{"index":5,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on H.R. 26, the Chair put the question on passage of the motion to recommit and by voice vote, announced that the nays had prevailed. Ms. DeGette demanded the yeas and nays and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 11 Jan 2023 15:00:34 -0500"},{"index":6,"header":"--","actionItem":"The previous question on the motion to recommit was ordered pursuant to clause 2(b) of rule XIX.","actionTimeStamp":"Wed, 11 Jan 2023 14:59:51 -0500"},{"index":7,"header":"--","actionItem":"Ms. DeGette moved to recommit to the Committee on the Judiciary.","actionTimeStamp":"Wed, 11 Jan 2023 14:59:39 -0500"},{"index":8,"header":"--","actionItem":"The previous question was ordered pursuant to the rule.","actionTimeStamp":"Wed, 11 Jan 2023 14:59:06 -0500"},{"index":9,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H.R. 26.","actionTimeStamp":"Wed, 11 Jan 2023 13:41:33 -0500"},{"index":10,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 5. H.R. 26 — \"To amend title 18, United States Code, to prohibit a health care practitioner from failing to exercise the proper degree of care in the case of a child who survives an abortion or attempted abortion.\"","actionTimeStamp":"Wed, 11 Jan 2023 13:41:21 -0500"},{"index":11,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on H. Con. Res. 3, the Chair put the question on agreeing to the resolution and by voice vote, announced that the ayes had prevailed. Mr. Nadler demanded the yeas and nays and the Chair postponed further proceedings on agreeing to the resolution until a time to be announced.","actionTimeStamp":"Wed, 11 Jan 2023 13:40:36 -0500"},{"index":12,"header":"--","actionItem":"The previous question was ordered pursuant to the rule.","actionTimeStamp":"Wed, 11 Jan 2023 13:40:16 -0500"},{"index":13,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Con. Res. 3.","actionTimeStamp":"Wed, 11 Jan 2023 12:36:40 -0500"},{"index":14,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 5. H. Con. Res. 3 — \"Expressing the sense of Congress condemning the recent attacks on pro-life facilities, groups, and churches.\"","actionTimeStamp":"Wed, 11 Jan 2023 12:36:29 -0500"},{"index":15,"header":"--","actionItem":"The House received a communication from Monet Straub, Deputy District Director, Congressman LaTurner. Pursuant to Rule VIII of the Rules of the United States House of Representatives, Ms. Straub notified the House that she had been served with a subpoena for testimony issued by the United States Federal Court, District of Kansas, sitting at Topeka and that after consultation with counsel, she had determined compliance with the subpoena was consistent with the rights and privileges of the House.","actionTimeStamp":"Wed, 11 Jan 2023 12:35:51 -0500"},{"index":16,"header":"--","actionItem":"The House received a communication from Jacob Conard, District Director, Congressman LaTurner. Pursuant to Rule VIII of the Rules of the United States House of Representatives, Mr. Conard notified the House that he had been served with a subpoena for testimony issued by the United States Federal Court, District of Kansas, sitting at Topeka and that after consultation with counsel, he had determined compliance with the subpoena was consistent with the rights and privileges of the House.","actionTimeStamp":"Wed, 11 Jan 2023 12:35:18 -0500"},{"index":17,"header":"--","actionItem":"The House received a communication from Allen Askew, Military Liaison, Congressman LaTurner. Pursuant to Rule VIII of the Rules of the United States House of Representatives, Mr. Askew notified the House that he had been served with a subpoena for testimony issued by the United States Federal Court, District of Kansas, sitting at Topeka and that after consultation with counsel, he had determined compliance with the subpoena was consistent with the rights and privileges of the House.","actionTimeStamp":"Wed, 11 Jan 2023 12:34:46 -0500"},{"index":18,"header":"--","actionItem":"The House received a communication from Braden Dreiling, Chief of Staff, Congressman LaTurner. Pursuant to Rule VIII of the Rules of the United States House of Representatives, Mr. Dreling notified the House that he had been served with a subpoena for testimony issued by the United States Federal Court, District of Kansas, sitting at Topeka and that after consultation with counsel, he had determined compliance with the subpoena was consistent with the rights and privileges of the House.","actionTimeStamp":"Wed, 11 Jan 2023 12:34:13 -0500"},{"index":19,"header":"--","actionItem":"The House received a communication from The Honorable Jacob LaTurner. Pursuant to Rule VIII of the Rules of the United States House of Representatives, Mr. LaTurner notified the House that he had been served with a subpoena for testimony issued by the United States Federal Court, District of Kansas, sitting at Topeka and that after consultation with counsel, he had determined compliance with the subpoena was consistent with the rights and privileges of the House.","actionTimeStamp":"Wed, 11 Jan 2023 12:33:55 -0500"},{"index":20,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches which by direction of the Chair, would be limited to 15 per side of the aisle.","actionTimeStamp":"Wed, 11 Jan 2023 12:01:56 -0500"},{"index":21,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mrs. Sykes to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 11 Jan 2023 12:01:37 -0500"},{"index":22,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 11 Jan 2023 12:01:35 -0500"},{"index":23,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Wed, 11 Jan 2023 12:00:03 -0500"},{"index":24,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of January 11.","actionTimeStamp":"Wed, 11 Jan 2023 12:00:00 -0500"},{"index":25,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Wed, 11 Jan 2023 11:20:54 -0500"},{"index":26,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Wed, 11 Jan 2023 10:00:28 -0500"},{"index":27,"header":"--","actionItem":"The Speaker designated the Honorable Mike Bost to act as Speaker pro tempore for today.","actionTimeStamp":"Wed, 11 Jan 2023 10:00:07 -0500"},{"index":28,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 11 Jan 2023 10:00:00 -0500"}]}