{"retrieved-date":"2025-9-8","actions-date":"Thursday, September 4, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, September  4)","actionItem":"S. 2296 (Sen. Wicker):\n        An original bill to authorize appropriations for fiscal year 2026 for military activities of the Department of Defense, for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 83 - 13. Record Vote Number: 503 \n\n\n        -- Measure laid before Senate by motion.\n \n\n S.Amdt. 3427 (Sen. Ernst):\n        To require the Comptroller General of the United States to conduct a study on casualty assistance and long-term care projects.\n\n        --Amendment SA 3427 proposed by Senator Wicker for Senator Ernst to Amendment SA 3748.\n\n\n S.Amdt. 3748 (Sen. Wicker):\n        In the nature of a substitute.\n\n        --Amendment SA 3748 proposed by Senator Wicker.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, September  4)","actionItem":"PN129-10:\n        Robert Law, of the District of Columbia, to be Under Secretary for Strategy, Policy, and Plans, Department of Homeland Security\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN150-4:\n        Maria A. Lanahan, of Missouri, to be United States District Judge for the Eastern District of Missouri\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 45. Record Vote Number: 501 \n\n\n\n PN346-1:\n        Edward L. Artau, of Florida, to be United States District Judge for the Southern District of Florida\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 46. Record Vote Number: 502 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate and vote 9/8/2025.\n\n\n PN346-3:\n        Kyle Christopher Dudek, of Florida, to be United States District Judge for the Middle District of Florida\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Budd, at  3:59 p.m., the Senate adjourned, under its order of today, until  3 p.m. on Monday, September 8, 2025.","actionTimeStamp":"--"}]}