{"retrieved-date":"2024-12-19","actions-date":"Wednesday, December 18, 2024","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, December 18)","actionItem":"H.R. 82 (Rep. Graves):\n        A bill to amend title II of the Social Security Act to repeal the Government pension offset and windfall elimination provisions.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Cloture on the motion to proceed to the measure invoked in Senate by Yea-Nay Vote. 73 - 27. Record Vote Number: 326 \n\n\n\n H.R. 4385 (Rep. Neguse):\n        A bill to extend authorization of the Reclamation States Emergency Drought Relief Act of 1991.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n H.R. 5009 (Rep. Joyce):\n        A bill to reauthorize wildlife habitat and conservation programs, and for other purposes.\n\n        -- Considered by Senate.\n\n        -- Motion by Senator Schumer to concur in the House amendment to the Senate amendment to H.R. 5009 with an amendment (SA 3317) withdrawn by unanimous consent in Senate.\n\n        -- Senate agreed to the House amendment to the Senate amendment to H.R. 5009 by Yea-Nay Vote. 85 - 14. Record Vote Number: 325 \n\n\n        -- Message on Senate action sent to the House.\n \n\n S.Amdt. 3317 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate.\n\n        --Proposed amendment SA 3317 withdrawn in Senate.\n\n\n S.Amdt. 3318 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate.\n\n        --SA 3318 fell when SA SA 3317 withdrawn.\n\n\n\n\n H.R. 5443 (Rep. Lee):\n        A bill to establish a policy regarding appraisal and valuation services for real property for a transaction over which the Secretary of the Interior has jurisdiction, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 5770 (Rep. Neguse):\n        A bill to reauthorize certain United States Geological Survey water data enhancement programs.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n H.R. 6062 (Rep. Radewagen):\n        A bill to restore the ability of the people of American Samoa to approve amendments to the territorial constitution based on majority rule in a democratic act of self-determination, as authorized pursuant to an Act of Congress delegating administration of Federal territorial law in the territory to the President, and to the Secretary of the Interior under Executive Order 10264, dated June 29, 1951, under which the Constitution of American Samoa was approved and may be amended without requirement for further congressional action, subject to the authority of Congress under the Territorial Clause in article IV, section 3, clause 2 of the United States Constitution.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 432 (Sen. Welch):\n        A bill to amend the Wild and Scenic Rivers Act to designate the Nulhegan River and Paul Stream in the State of Vermont for potential addition to the national wild and scenic rivers system, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 608 (Sen. Markey):\n        A bill to amend the Wild and Scenic Rivers Act to direct the Secretary of the Interior to conduct a study of the Deerfield River for potential addition to the national wild and scenic rivers system, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 709 (Sen. Peters):\n        A bill to improve performance and accountability in the Federal Government, and for other purposes.\n\n        -- Senate agreed to the House Amendment to S. 709 by Voice Vote.\n\n\n S. 961 (Sen. Markey):\n        A bill to redesignate the Salem Maritime National Historic Site in Salem, Massachusetts, as the \"Salem Maritime National Historic Park\", and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 1059 (Sen. Cornyn):\n        A bill to adjust the boundary of Big Bend National Park in the State of Texas, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 1088 (Sen. Hoeven):\n        A bill to authorize the relinquishment and in lieu selection of land and minerals in the State of North Dakota, to restore land and minerals to Indian Tribes within the State of North Dakota, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 1760 (Sen. Cortez Masto):\n        A bill to amend the Apex Project, Nevada Land Transfer and Authorization Act of 1989 to include the city of North Las Vegas, Nevada, and the Apex Industrial Park Owners Association, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 2018 (Sen. Barrasso):\n        A bill to require the Secretary of the Interior to conduct an assessment to identify locations in National Parks in which there is the greatest need for broadband internet access service and areas in National Parks in which there is the greatest need for cellular service, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 2042 (Sen. Cortez Masto):\n        A bill to amend the Sloan Canyon National Conservation Area Act to adjust the boundary of the Sloan Canyon National Conservation Area, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 2151 (Sen. Lee):\n        A bill to amend the Southwest Forest Health and Wildlife Prevention Act of 2004 to require the establishment of an additional Institute under that Act.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 2615 (Sen. Murkowski):\n        A bill to amend the Alaska Native Claims Settlement Act to provide that Village Corporations shall not be required to convey land in trust to the State of Alaska for the establishment of Municipal Corporations, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 2620 (Sen. Van Hollen):\n        A bill to establish the Chesapeake National Recreation Area as a unit of the National Park System, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 3123 (Sen. Barrasso):\n        A bill to provide for the standardization, consolidation, and publication of data relating to public outdoor recreational use of Federal waterways among Federal land and water management agencies, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 3373 (Sen. Daines):\n        A bill to require the Federal Energy Regulatory Commission to extend the time period during which licensees are required to commence construction of certain hydropower projects.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n \n\n S.Amdt. 3343 (Sen. Daines):\n        In the nature of a substitute.\n\n        --Amendment SA 3343 proposed by Senator Hickenlooper for Senator Daines.\n\n        --Amendment SA 3343 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 3791 (Sen. Carper):\n        A bill to reauthorize the America's Conservation Enhancement Act, and for other purposes.\n\n        -- Senate agreed to the House Amendment to S. 3791 by Voice Vote.\n\n\n S. 4129 (Sen. Hoeven):\n        A bill to contribute funds and artifacts to the Theodore Roosevelt Presidential Library in Medora, North Dakota.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 4209 (Sen. King):\n        A bill to provide greater regional access to the Katahdin Woods and Waters National Monument in the State of Maine, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 4367 (Sen. Carper):\n        A bill to provide for improvements to the rivers and harbors of the United States, to provide for the conservation and development of water and related resources, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Motion by Senator Carper to concur in the House Amendment to S. 4367 made in Senate.\n\n        -- Senate agreed, under the order of 12/12/2024, having achieved 60 votes in the affirmative, to the House amendment to S. 4367 by Yea-Nay Vote. 97 - 1. Record Vote Number: 327 \n\n\n\n S. 4576 (Sen. Hickenlooper):\n        A bill to amend the Energy and Water Development and Related Agencies Appropriations Act, 2015, to reauthorize the Colorado River System conservation pilot program.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S. 4994 (Sen. Wicker):\n        A bill to modify the boundary of the Vicksburg National Military Park in the State of Mississippi, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 5000 (Sen. Lee):\n        A bill to provide for a memorandum of understanding to address the impacts of a certain record of decision on the Upper Colorado River Basin Fund.\n\n        -- Passed Senate with an amendment and an amendment to the Title by Unanimous Consent.\n\n\n S. 5125 (Sen. Barrasso):\n        A bill to provide for certain improvements to the housing and workforce programs of Federal land management agencies, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 5136 (Sen. Blumenthal):\n        A bill to require the Secretary of the Interior to conduct a study of Plum Island.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3344 (Sen. Blumenthal):\n        In the nature of a substitute.\n\n        --Amendment SA 3344 proposed by Senator Blumenthal.\n\n        --Amendment SA 3344 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 5595 (Sen. Smith):\n        A bill to amend the Act of June 22, 1948.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.\n\n\n S.Res. 895 (Sen. Bennet):\n        A resolution recognizing the second commemoration of the anti-LGBTQ+ attack that occurred on November 19-20, 2022, at Club Q, an LGBTQ+ bar in Colorado Springs, Colorado.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 934 (Sen. Klobuchar):\n        A resolution amending the broadcasting and recording procedures of the Senate.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Voice Vote.\n\n\n S.Con.Res. 44 (Sen. Reed):\n        A concurrent resolution directing the Clerk of the House of Representatives to make a correction in the enrollment of the bill H.R. 5009.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S.Con.Res. 46 (Sen. Carper):\n        A concurrent resolution providing for corrections in the enrollment of S. 4367.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Recess","actionItem":"By unanimous consent, on the request of Mr. Booker, at  8:38 p.m., the Senate recessed, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}