{"retrieved-date":"2023-5-18","actions-date":"Thu, 18 May 2023 10:06:29 -0400","actions-title":"House Floor Proceedings","actions-count":10,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"The House proceeded with 10 minutes of debate on the D'Esposito Amendment No. 1.","actionTimeStamp":"Thu, 18 May 2023 10:06:29 -0400"},{"index":2,"header":"--","actionItem":"An amendment, offered by Mr. D'Esposito,  numbered 1 printed in Part C of House Report 118-59 to recognize the important work that local law enforcement personnel do every day and states that officers should have certain rights during investigations into alleged misconduct such as legal resources and counsel. Encourages states across the nation to adopt their own Bill of Rights to protect our local law enforcement and denounces calls to defund the police.","actionTimeStamp":"Thu, 18 May 2023 10:06:08 -0400"},{"index":3,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Con. Res. 40.","actionTimeStamp":"Thu, 18 May 2023 09:15:03 -0400"},{"index":4,"header":"--","actionItem":"Rule provides for consideration of H.R. 2494, H.R. 3091 and H. Con. Res. 40. The resolution provides for consideration of H.R. 2494 under a structured rule with one hour of general debate; H.R. 3091 under a structured rule with one hour of general debate; and H. Con. Res. 40 under a structured rule with one hour of general debate. The resolution provides for a motion to recommit on H.R. 2494 and H.R. 3091.","actionTimeStamp":"Thu, 18 May 2023 09:14:27 -0400"},{"index":5,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 398. H. Con. Res. 40 — \"Expressing support for local law enforcement officers and condemning efforts to defund or dismantle local law enforcement agencies.\"","actionTimeStamp":"Thu, 18 May 2023 09:14:22 -0400"},{"index":6,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair, would be limited to five per side of the aisle.","actionTimeStamp":"Thu, 18 May 2023 09:01:45 -0400"},{"index":7,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Alford to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 18 May 2023 09:01:27 -0400"},{"index":8,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Thu, 18 May 2023 09:01:23 -0400"},{"index":9,"header":"--","actionItem":"Today's prayer was offered by Pastor Craig Pridgen, Truth Bethel Baptist Church, Niagara Falls, New York.","actionTimeStamp":"Thu, 18 May 2023 09:00:07 -0400"},{"index":10,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 18 May 2023 09:00:00 -0400"}]}