{"retrieved-date":"2022-12-1","actions-date":"Wednesday, November 30, 2022","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, November 30)","actionItem":"H.R. 2220 (Rep. Guest):\n        A bill to amend title 40, United States Code, to modify the treatment of certain bargain-price options to purchase at less than fair market value, and for other purposes.\n\n        -- Senate Committee on Environment and Public Works discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.Con.Res. 118 (Rep. Pelosi):\n        A concurrent resolution authorizing the use of the rotunda of the Capitol for a ceremony to present Congressional Gold Medals to the United States Capitol Police and others who protected the Capitol on January 6, 2021.\n\n        -- Received in the Senate, considered, and agreed to without amendment by Unanimous Consent.\n\n\n S. 1466 (Sen. Merkley):\n        A bill to authorize the Director of the United States Geological Survey to establish a regional program to assess, monitor , and benefit the hydrology of saline lakes in the Great Basin and the migratory birds and other wildlife dependent on those habitats, and for other purposes.\n\n        -- Senate Committee on Environment and Public Works discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 3846 (Sen. Cornyn):\n        A bill to reauthorize the Justice and Mental Health Collaboration Program, and for other purposes.\n\n        -- Message on House action received in Senate and at desk: House amendment to Senate bill.\n\n\n S. 4017 (Sen. Blackburn):\n        A bill to designate the United States courthouse located at 111 South Highland Avenue in Jackson, Tennessee, as the \"James D. Todd United States Courthouse\", and for other purposes.\n\n        -- Senate Committee on Environment and Public Works discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 4337 (Sen. Lankford):\n        A bill to amend title 5, United States Code, to authorize the appointment of spouses of members of the Armed Forces who are on active duty, disabled, or deceased to positions in which the spouses will work remotely.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 5060 (Sen. Klobuchar):\n        A bill to redesignate the Federal building located at 212 Third Avenue South in Minneapolis, Minnesota, as the \"Paul D. Wellstone Federal Building\", and for other purposes.\n\n        -- Senate Committee on Environment and Public Works discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 853 (Sen. Manchin):\n        A resolution recognizing November 2022, as \"National Homeless Children and Youth Awareness Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 854 (Sen. Daines):\n        A resolution honoring the individuals fighting and the individuals who have fallen responding to wildland fires during the ongoing 2022 wildfire season.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, November 30)","actionItem":"PN1368:\n        Robert Phillip Storch, of the District of Columbia , to be Inspector General, Department of Defense\n\n        -- By unanimous consent agreement, debate and vote today.\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 92 - 3. Record Vote Number: 367 \n\n\n\n PN2034:\n        Nicholas E. Park, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2143:\n        Anne M. Nardacci, of New York, to be United States District Judge for the Northern District of New York\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 45. Record Vote Number: 364 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 44. Record Vote Number: 366 \n\n\n\n PN2264:\n        Camille L. Velez-Rive, of Puerto Rico, to be United States District Judge for the District of Puerto Rico\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 54 - 43. Record Vote Number: 363 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 55 - 42. Record Vote Number: 365 \n\n\n\n PN2593:\n        46 nominations in the Air Force beginning with Allen Seth Abrams and ending with Thomas Benjamin Williams\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2594:\n        119 nominations in the Air Force beginning with Romi R. Abouzedan and ending with Timothy J. Zerwic\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2669:\n        Rear Adm. Alvin Holsey, in the Navy, to be Vice Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2673:\n        Wilfredo P. Salada, Jr., in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2674:\n        Diego A. Rincon, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2675:\n        Luke J. Patterson, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2676:\n        2 nominations in the Navy beginning with William J. Uffmann III and ending with Geoffrey S. Raynor\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2681:\n        Lt. Gen. Thomas A. Bussiere, in the Air Force, to be General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2682:\n        Maj. Gen. DeAnna M. Burt, in the Space Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2684:\n        Christopher D. Coulson, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2685:\n        Michael A. Hyland, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2686:\n        David L. Gutierrez, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2687:\n        Jeffrey Thompson, Jr., in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2688:\n        Phillip S. Stone, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2689:\n        Meghann E. Sullivan, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2690:\n        Rama K. Mutyala, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2700:\n        4 nominations in the Air Force beginning with Col. Lisa M. Ahaesy and ending with Col. Kristof K. Sills\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2701:\n        2 nominations in the Air Force beginning with Col. Steven A. Breitfelder and ending with Col. Jason S. Christman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2702:\n        2 nominations in the Air Force beginning with Brig. Gen. Denise M. Donnell and ending with Brig. Gen. Joseph R. Harris II\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2704:\n        2 nominations in the Air Force beginning with Brig. Gen. Troy T. Daniels and ending with Brig. Gen. Terrence L. Koudelka, Jr.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2705:\n        6 nominations in the Air Force beginning with Brig. Gen. Konata A. Crumbly and ending with Brig. Gen. Bryan J. Teff\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2706:\n        11 nominations in the Air Force beginning with Col. Paul M. Bishop and ending with Col. Keith C. Wilson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2707:\n        22 nominations in the Air Force beginning with Col. Christopher G. Batterton and ending with Col. Trace N. Thomas\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2708:\n        7 nominations in the Air Force beginning with Col. Christopher A. Eason and ending with Col. Justin T. Wagner\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2709:\n        13 nominations in the Air Force beginning with Col. Kenneth A. Borchers and ending with Col. Todd E. Swass\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2710:\n        9 nominations in the Air Force beginning with Col. John A. Conley and ending with Col. Brian J. Tollefson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2712:\n        Lt. Gen. James C. Slife, in the Air Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2713:\n        Col. Christopher A. Brown, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2715:\n        Lt. Gen. Antonio A. Aguto, Jr., in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2716:\n        Col. Warren L. Wells, in the Army, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2717:\n        3 nominations in the Army beginning with Brig. Gen. William E. Crane and ending with Brig. Gen. Shawn P. Manke\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2718:\n        2 nominations in the Army beginning with Brig. Gen. Levon E. Cumpton and ending with Brig. Gen. Gregory C. Knight\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2719-1:\n        32 nominations in the Army beginning with Brig. Gen. Miguel Aguilar and ending with Brig. Gen. Richard D. Wilson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2720:\n        Brig. Gen. Farin D. Schwartz, in the Army, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2721:\n        60 nominations in the Army beginning with Col. Jerry E. Baird, Jr. and ending with Col. Richard J. Zeigler III\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2722:\n        7 nominations in the Army beginning with Col. Matthew M. Bacon and ending with Col. Sally F. Petty\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2723:\n        2 nominations in the Marine Corps beginning with Brig. Gen. John F. Kelliher III and ending with Brig. Gen. William E. Souza III\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2724:\n        2 nominations in the Marine Corps beginning with Col. Raymond L. Adams and ending with Col. John K. Jarrard\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2725:\n        Col. Kevin S. Woodard, in the Marine Corps, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2726:\n        Rear Adm. John F. Wade, in the Navy, to be Vice Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2736:\n        Maj. Gen. Christopher O. Mohan, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2737:\n        Stephanie L. M. Croyle, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2739:\n        Richard R. Burges, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2740:\n        2 nominations in the Air Force beginning with Ronald B. Bellamy and ending with Lena S. Freienmuth\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2741:\n        Michael S. Pontius, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2742:\n        164 nominations in the Air Force beginning with William James Acostatrejo and ending with John Andre Zolan\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2743:\n        Joseph T. Scholz, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2744:\n        Tracie D. Thornton, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2745:\n        Thomas L. Husted, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2746:\n        35 nominations in the Army beginning with Christopher L. Andersen and ending with Robert P. Venton\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2747:\n        James A. Silsby III, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2748:\n        Peter J. Van Howe, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2749:\n        Patricia J. Oelschlager, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2750:\n        Michael D. Valletta, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2751:\n        Matthew F. Cohen, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2752:\n        13 nominations in the Army beginning with Anece L. Baxterwhite and ending with Patrick M. Walsh\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2753:\n        William D. Ward III, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2754:\n        Bryan R. Gibby, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2755:\n        Eugene J. Gregory, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2760:\n        Eden E. Coelho, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2761:\n        Adam L. Sanders, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2762:\n        Sarah B. Snyder, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2763:\n        Erik D. Masick, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2764:\n        Jillian R. Guy, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2765:\n        Ayodele O. Lawson, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2766:\n        24 nominations in the Army beginning with Michael E. Bahm and ending with D016157\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2767:\n        Jennifer M. Farina, in the Marine Corps, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2768:\n        Thomas J. Watts II, in the Marine Corps, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2769:\n        Lashaundra S. Collins, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2770:\n        Andrew P. Gorie, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2771:\n        Daniel W. Rhodeback, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2772:\n        Kirsten N. Pecua, in the Space Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2777:\n        Duane G. McCrory, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2779:\n        Daniel P. Morgan, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2780:\n        Thomas J. Souza, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2781:\n        Jose A. Quintero, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2782:\n        Javier J. Hernandez, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2783:\n        Michael J. Arnold, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2784:\n        Paul T. Hill, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2785:\n        Taibatu E. Obasi, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2786:\n        Jenniffer M. Rajner, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2787:\n        38 nominations in the Navy beginning with Jose A. Aranda and ending with Daniel J. Wilkinson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2788:\n        Patric C. Jang, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2789:\n        Charles J. Osier, Jr., in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2790:\n        James C. Hanlon, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2791:\n        Jarrett C. Walke, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2792:\n        Amy M. Respondek, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2793:\n        Andrew S. Gibbons, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  7:38 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}