{"retrieved-date":"2025-9-4","actions-date":"Thu, 04 Sep 2025 09:46:59 -0400","actions-title":"House Floor Proceedings","actions-count":17,"actions-list":[{"index":1,"header":"On agreeing to the Perry amendment (A012) Roll Call 235","actionItem":"Recorded vote pending.","actionTimeStamp":"Thu, 04 Sep 2025 09:46:59 -0400"},{"index":2,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Schweikert amendment No. 33, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Mr. Schweikert demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 04 Sep 2025 09:45:19 -0400"},{"index":3,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 672, the Committee of the Whole proceeded with 10 minutes of debate on the Schweikert amendment No. 33.","actionTimeStamp":"Thu, 04 Sep 2025 09:38:17 -0400"},{"index":4,"header":"--","actionItem":"An amendment, offered by Mr. Schweikert,  numbered 33 printed in House Report 119-232 to revise appropriations to reduce unobligated funds from top-line accounts totaling $37,353,345,385.09.","actionTimeStamp":"Thu, 04 Sep 2025 09:37:57 -0400"},{"index":5,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Perry amendment No. 32, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Mr. Perry demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 04 Sep 2025 09:37:37 -0400"},{"index":6,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 672, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 32.","actionTimeStamp":"Thu, 04 Sep 2025 09:31:09 -0400"},{"index":7,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 32 printed in House Report 119-232 to strike all funding for the Office of Energy Efficiency and Renewable Energy.","actionTimeStamp":"Thu, 04 Sep 2025 09:30:46 -0400"},{"index":8,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Perry amendment No. 31, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Ms. Kaptur demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Thu, 04 Sep 2025 09:30:19 -0400"},{"index":9,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 672, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 31.","actionTimeStamp":"Thu, 04 Sep 2025 09:20:45 -0400"},{"index":10,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 31 printed in House Report 119-232 to reduce funding for the Great Lakes Authority and transfer to the SRA.","actionTimeStamp":"Thu, 04 Sep 2025 09:20:26 -0400"},{"index":11,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Thu, 04 Sep 2025 09:17:06 -0400"},{"index":12,"header":"--","actionItem":"Considered as unfinished business. H.R. 4553 — \"Making appropriations for energy and water development and related agencies for the fiscal year ending September 30, 2026, and for other purposes.\"","actionTimeStamp":"Thu, 04 Sep 2025 09:16:50 -0400"},{"index":13,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair would be limited to 5 per side of the aisle.","actionTimeStamp":"Thu, 04 Sep 2025 09:04:34 -0400"},{"index":14,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Shreve to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 04 Sep 2025 09:02:16 -0400"},{"index":15,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Thu, 04 Sep 2025 09:02:11 -0400"},{"index":16,"header":"--","actionItem":"Today's prayer was offered by Rev. Neil Stewart, First Presbyterian Church, Columbia, South Carolina.","actionTimeStamp":"Thu, 04 Sep 2025 09:00:35 -0400"},{"index":17,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 04 Sep 2025 09:00:00 -0400"}]}