{"retrieved-date":"2023-10-25","actions-date":"Wed, 25 Oct 2023 12:52:49 -0400","actions-title":"House Floor Proceedings","actions-count":8,"actions-list":[{"index":1,"header":"NOMINATIONS FOR OFFICE OF SPEAKER","actionItem":"The Honorable Elise Stefanik, by direction of the Republican Conference, nominated the Honorable Mike Johnson, a Member from the State of Louisiana. The Honorable Pete Aguilar, by direction of the Democratic Caucus, nominated the Honorable Hakeem Jeffries, a Member from the State of New York. No other nominations were put forward.","actionTimeStamp":"Wed, 25 Oct 2023 12:52:49 -0400"},{"index":2,"header":"ORDER OF BUSINESS-ELECTION OF THE SPEAKER","actionItem":"The Chair announced that the floor was open to receive nominations for the Office of the Speaker of the U.S. House of Representatives.","actionTimeStamp":"Wed, 25 Oct 2023 12:52:20 -0400"},{"index":3,"header":"--","actionItem":"Call of the House Quorum responded: 429 present (Roll no. 526).","actionTimeStamp":"Wed, 25 Oct 2023 12:50:29 -0400"},{"index":4,"header":"CALL OF THE HOUSE","actionItem":"Pursuant to clause 7 of rule XX, Mr. Bost moved a call of the House. The Speaker announced that under clause 7(b) of rule XX, he conferred recognition for that purpose and that without objection, a call of the House would be ordered.","actionTimeStamp":"Wed, 25 Oct 2023 12:05:05 -0400"},{"index":5,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Newhouse to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 25 Oct 2023 12:05:00 -0400"},{"index":6,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 25 Oct 2023 12:04:55 -0400"},{"index":7,"header":"--","actionItem":"Today's prayer was offered by Reverend Jeremy Leganski, Immaculate Conception Church, Elmhurst, IL.","actionTimeStamp":"Wed, 25 Oct 2023 12:03:32 -0400"},{"index":8,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 25 Oct 2023 12:00:00 -0400"}]}