{"retrieved-date":"2023-3-1","actions-date":"Wed, 01 Mar 2023 10:14:20 -0500","actions-title":"House Floor Proceedings","actions-count":23,"actions-list":[{"index":1,"header":"On agreeing to the Bost amendment (A001) Roll Call 125","actionItem":"Recorded vote pending.","actionTimeStamp":"Wed, 01 Mar 2023 10:14:20 -0500"},{"index":2,"header":"--","actionItem":"On agreeing to the Yakym amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 01 Mar 2023 10:12:39 -0500"},{"index":3,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 166, the Committee of the Whole proceeded with 10 minutes of debate on the Yakym amendment No. 15.","actionTimeStamp":"Wed, 01 Mar 2023 10:02:32 -0500"},{"index":4,"header":"--","actionItem":"An amendment, offered by Mr. Yakym,  numbered 15 printed in House Report 118-4 to require the statement estimating inflationary effects to break down the type of inflation to the CPI's major categories of Food, Energy, and All Items Less Food and Energy.","actionTimeStamp":"Wed, 01 Mar 2023 10:02:16 -0500"},{"index":5,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Roy amendment No. 14, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Raskin demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Wed, 01 Mar 2023 10:00:56 -0500"},{"index":6,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 166, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 14.","actionTimeStamp":"Wed, 01 Mar 2023 09:43:49 -0500"},{"index":7,"header":"--","actionItem":"An amendment, offered by Mr. Roy,  numbered 14 printed in House Report 118-4 to strike exceptions to the mandatory inflation forecasting requirement.","actionTimeStamp":"Wed, 01 Mar 2023 09:43:34 -0500"},{"index":8,"header":"--","actionItem":"On agreeing to the Perry amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 01 Mar 2023 09:43:17 -0500"},{"index":9,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 166, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 13.","actionTimeStamp":"Wed, 01 Mar 2023 09:31:40 -0500"},{"index":10,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 13 printed in House Report 118-4 to require a detailed description of any impact on the consumer price index.","actionTimeStamp":"Wed, 01 Mar 2023 09:31:24 -0500"},{"index":11,"header":"--","actionItem":"On agreeing to the Perry amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 01 Mar 2023 09:31:09 -0500"},{"index":12,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 166, the Committee of the Whole proceeded with 10 minutes of debate on the Perry amendment No. 12.","actionTimeStamp":"Wed, 01 Mar 2023 09:20:10 -0500"},{"index":13,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 12 printed in House Report 118-4 to apply the bill's requirements to all major Executive Orders which cause an annual gross budgetary effect of at least $1 million.","actionTimeStamp":"Wed, 01 Mar 2023 09:19:49 -0500"},{"index":14,"header":"--","actionItem":"On agreeing to the Omar amendment; Failed by voice vote.","actionTimeStamp":"Wed, 01 Mar 2023 09:19:32 -0500"},{"index":15,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 166, the Committee of the Whole proceeded with 10 minutes of debate on the Omar amendment No. 11.","actionTimeStamp":"Wed, 01 Mar 2023 09:13:20 -0500"},{"index":16,"header":"--","actionItem":"An amendment, offered by Ms. Omar,  numbered 11 printed in House Report 118-4 to require supplementary Genuine Progress Indicator (GPI) factors be considered and evaluated when assessing applicable major executive orders.","actionTimeStamp":"Wed, 01 Mar 2023 09:12:53 -0500"},{"index":17,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Wed, 01 Mar 2023 09:11:54 -0500"},{"index":18,"header":"--","actionItem":"Considered as unfinished business. H.R. 347 — \"To require the Executive Office of the President to provide an inflation estimate with respect to Executive orders with a significant effect on the annual gross budget, and for other purposes.\"","actionTimeStamp":"Wed, 01 Mar 2023 09:11:34 -0500"},{"index":19,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches which by direction of the Chair, would be limited to 5 per side of the aisle.","actionTimeStamp":"Wed, 01 Mar 2023 09:02:52 -0500"},{"index":20,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Ms. Garcia of TX to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 01 Mar 2023 09:02:37 -0500"},{"index":21,"header":"--","actionItem":"The Speaker announced approval of the Journal. Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 01 Mar 2023 09:02:19 -0500"},{"index":22,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Wed, 01 Mar 2023 09:00:33 -0500"},{"index":23,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 01 Mar 2023 09:00:00 -0500"}]}