{"retrieved-date":"2023-5-5","actions-date":"Wednesday, May 3, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, May  3)","actionItem":"H.J.Res. 39 (Rep. Posey):\n        A joint resolution disapproving the rule submitted by the Department of Commerce relating to \"Procedures Covering Suspension of Liquidation, Duties and Estimated Duties in Accord With Presidential Proclamation 10414\".\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 56 - 41. Record Vote Number: 109 \n\n\n\n S.J.Res. 9 (Sen. Marshall):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the United States Fish and Wildlife Service relating to \"Endangered and Threatened Wildlife and Plants; Lesser Prairie-Chicken; Threatened Status with Section 4(d) Rule for the Northern Distinct Population Segment and Endangered Status for the Southern Distinct Population Segment\".\n\n        -- Senate Committee on Environment and Public Works discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 50 - 48. Record Vote Number: 110 \n\n\n\n S.Res. 152 (Sen. Hirono):\n        A resolution designating April 2023 as \"National Native Plant Month\".\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 185 (Sen. Reed):\n        A resolution designating April 2023 as \"Financial Literacy Month\".\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 192 (Sen. Menendez):\n        A resolution recognizing April 30, 2023, as \"El Dia de los Ninos-Celebrating Young Americans\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 193 (Sen. Klobuchar):\n        A resolution designating April 2023 as \"Second Chance Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 194 (Sen. Daines):\n        A resolution designating May 5, 2023, as the \"National Day of Awareness for Missing and Murdered Native Women and Girls\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, May  3)","actionItem":"PN163:\n        Wesley L. Hsu, of California, to be United States District Judge for the Central District of California\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 54 - 45. Record Vote Number: 108 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 43. Record Vote Number: 111 \n\n\n\n PN180:\n        Orelia Eleta Merchant, of New York, to be United States District Judge for the Eastern District of New York\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 48. Record Vote Number: 107 \n\n\n\n PN289:\n        LaShonda A. Hunt, of Illinois, to be United States District Judge for the Northern District of Illinois\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 54 - 42. Record Vote Number: 112 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate 5/4/2023.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  8:46 p.m, the Presiding Officer (Mr. Whitehouse in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}