{"retrieved-date":"2023-11-7","actions-date":"Thursday, November 2, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, November  2)","actionItem":"H.R. 1226 (Rep. Aguilar):\n        A bill to amend title 38, United States Code, to allow for the electronic request of certain records, and for other purposes.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 499 (Sen. Cornyn):\n        A bill to amend the DNA Analysis Backlog Elimination Act of 2000 to reauthorize the Debbie Smith DNA Backlog Grant Program, and for other purposes.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Voice Vote.\n \n\n S.Amdt. 1361 (Sen. Cornyn):\n        To improve the bill.\n\n        --Amendment SA 1361 proposed by Senator Schumer for Senator Cornyn.\n\n        --Amendment SA 1361 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 656 (Sen. Fischer):\n        A bill to amend title 38, United States Code, to revise the rules for approval by the Secretary of Veterans Affairs of commercial driver education programs for purposes of veterans educational assistance, and for other purposes.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 1973 (Sen. Brown):\n        A bill to require the purchase of domestically made flags of the United States of America for use by the Federal Government.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 3222 (Sen. Klobuchar):\n        A bill to ensure the security of office space rented by Senators, and for other purposes.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.\n\n\n S.Res. 447 (Sen. Tillis):\n        A resolution expressing support for the designation of October 23, 2023, as \"Beirut Veterans Remembrance Day\" to remember the tragic terrorist bombing of the Marine Corps headquarters in Beirut, Lebanon, in 1983.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 448 (Sen. Butler):\n        A resolution supporting the goals and ideals of National Domestic Violence Awareness Month.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 449 (Sen. Cornyn):\n        A resolution supporting the goals and ideals of Red Ribbon Week during the period of October 23 through October 31, 2023.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.\n\n\n S.Con.Res. 7 (Sen. Cardin):\n        A concurrent resolution condemning Russia's unjust and arbitrary detention of Russian opposition leader Vladimir Kara-Murza who has stood up in defense of democracy, the rule of law, and free and fair elections in Russia.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute withdrawn by Unanimous Consent.\n\n        -- Resolution agreed to in Senate with an amendment and an amended preamble by Unanimous Consent.\n\n        -- The committee amendment to the preamble withdrawn by Unanimous Consent.\n \n\n S.Amdt. 1359 (Sen. Cardin):\n        In the nature of a substitute.\n\n        --Amendment SA 1359 proposed by Senator Schumer for Senator Cardin.\n\n        --Amendment SA 1359 agreed to in Senate by Unanimous Consent.\n\n\n S.Amdt. 1360 (Sen. Cardin):\n        To amend the preamble.\n\n        --Amendment SA 1360 proposed by Senator Schumer for Senator Cardin.\n\n        --Amendment SA 1360 agreed to in Senate by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, November  2)","actionItem":"PN84:\n        Kenly Kiya Kato, of California, to be United States District Judge for the Central District of California\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN172:\n        Julia E. Kobick, of Massachusetts, to be United States District Judge for the District of Massachusetts\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN174:\n        Ramon Ernesto Reyes, Jr., of New York, to be United States District Judge for the Eastern District of New York\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN238-3:\n        Zara M. Scribner, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN649:\n        Monica M. Bertagnolli, of Massachusetts, to be Director of the National Institutes of Health\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- By unanimous consent agreement, debate 11/6/2023.\n\n\n PN877:\n        Gen. David W. Allvin, in the Air Force, to be General\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 95 - 1. Record Vote Number: 288 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 95 - 1. Record Vote Number: 289 \n\n\n\n PN881:\n        Lt. Gen. Christopher J. Mahoney, in the Marine Corps, to be General\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 91 - 0. Record Vote Number: 290 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 86 - 0. Record Vote Number: 291 \n\n\n\n PN882:\n        Adm. Lisa M. Franchetti, in the Navy, to be Admiral\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 95 - 1. Record Vote Number: 286 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 95 - 1. Record Vote Number: 287 \n\n\n\n PN1055:\n        William D. Magee, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1057:\n        Christopher F. Melling, in the Marine Corps, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1058:\n        T M. Alford, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1059:\n        Dustin L. White, in the Space Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1060:\n        4 nominations in the Space Force beginning with John S. Donelson and ending with Ryan M. Wilson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1078:\n        21 nominations in the Air Force beginning with Reagan Howard Beaton and ending with Pilar G. Wennrich\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1081:\n        35 nominations in the Air Force beginning with Joseph Benjamin Ahlers and ending with Laura Ashley Wagner\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1082:\n        12 nominations in the Air Force beginning with Jeremiah L. Blackburn and ending with Thomas A. Webb\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1087:\n        6 nominations in the Army beginning with Donald T. Criswell and ending with Peter A. Williams\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1088:\n        15 nominations in the Army beginning with Joseph M. Baumann and ending with Jacob H. Youmans\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1089:\n        17 nominations in the Army beginning with David A. Brunais and ending with Jeremiah J. Oligario\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1090:\n        Erick Leon, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1091:\n        Brian C. Satterlee II, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1092:\n        Michael D. Norton, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1093:\n        7 nominations in the Army beginning with Michael A. Bryant and ending with Steven L. Williams\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1094:\n        Joshua W. Brown, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  3:59 p.m., the Senate adjourned, under its order of today, until  3 p.m. on Monday, November 6, 2023.","actionTimeStamp":"--"}]}