{"retrieved-date":"2024-8-1","actions-date":"Wednesday, July 31, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, July 31)","actionItem":"H.Con.Res. 120 (Rep. Crawford):\n        A concurrent resolution authorizing the use of Emancipation Hall in the Capitol Visitor Center for a ceremony as part of the unveiling of the statue of Johnny Cash, provided by the State of Arkansas.\n\n        -- Resolution agreed to in Senate without amendment by Unanimous Consent.\n\n\n S. 2781 (Sen. Heinrich):\n        A bill to promote remediation of abandoned hardrock mines, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute as amended agreed to by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3215 (Sen. Heinrich):\n        To improve the bill.\n\n        --Amendment SA 3215 proposed by Senator Welch for Senator Heinrich.\n\n        --Amendment SA 3215 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 750 (Sen. Klobuchar):\n        A resolution commending the Professional Women's Hockey League Minnesota for winning the inaugural Professional Women's Hockey League title on May 29, 2024.\n\n        -- Senate Committee on Commerce, Science, and Transportation discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 785 (Sen. Scott, of FL):\n        A resolution commending and congratulating the Florida Panthers on winning the 2024 Stanley Cup Final.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 786 (Sen. Blackburn):\n        A resolution congratulating the University of Tennessee, Knoxville as the College World Series winner.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 787 (Sen. Lankford):\n        A resolution congratulating the University of Oklahoma softball team for winning the 2024 Women's College World Series, the eighth national title in program history.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 788 (Sen. Braun):\n        A resolution recognizing the 50th Anniversary of Carroll County Wabash & Erie Canal, Inc.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 789 (Sen. Klobuchar):\n        A resolution commending the Minnesota State University, Mankato women's and men's basketball teams for winning the 2024 NCAA Division II Basketball National Championships.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 790 (Sen. Blumenthal):\n        A resolution commending and congratulating the University of Connecticut men's basketball team for winning the 2024 National Collegiate Athletic Association Men's Basketball Championship.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 791 (Sen. Wicker):\n        A resolution designating August 1, 2024, as \"Gold Star Children's Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 792 (Sen. Lankford):\n        A resolution designating September 2024 as \"National Child Awareness Month\" to promote awareness of charities that benefit children as well as youth-serving organizations throughout the United States and recognizing the efforts made by those charities and organizations on behalf of children and youth as critical contributions to the future of the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 793 (Sen. Grassley):\n        A resolution designating July 30, 2024, as \"National Whistleblower Appreciation Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, July 31)","actionItem":"PN1223:\n        Dorothy Camille Shea, of North Carolina, to be Deputy Representative of the United States of America to the United Nations, with the rank and status of Ambassador and the Deputy Representative of the United States of America in the Security Council of the United Nations\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 54 - 36. Record Vote Number: 228 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate 8/1/2024.\n\n\n PN1524:\n        Julie N. Marek, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1669:\n        Matthew J. Vargas, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1750:\n        Joseph Francis Saporito, Jr., of Pennsylvania, to be United States District Judge for the Middle District of Pennsylvania\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 39. Record Vote Number: 226 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 53 - 39. Record Vote Number: 227 \n\n\n\n PN1751:\n        Meredith A. Vacca, of New York, to be United States District Judge for the Western District of New York\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 43. Record Vote Number: 224 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 41. Record Vote Number: 225 \n\n\n\n PN1756:\n        Maj. Gen. John J. DeGoes, in the Air Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1758:\n        Maj. Gen. Brian S. Eifler, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1809:\n        Maj. Gen. Robert D. Harter, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1829:\n        Maj. Gen. Mark H. Landes, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1830:\n        Maj. Gen. Paul T. Stanton, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1831:\n        Maj. Gen. Matthew W. McFarlane, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1832:\n        Maj. Gen. David J. Francis, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1842:\n        Scott D. Hopkins, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1844:\n        Elizabeth B. Mathias, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1845:\n        Matthew I. Horner, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1846:\n        Joshua A. King, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1847:\n        Matthew F. Fouquier, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1848:\n        2 nominations in the Army beginning with Vegas V. Coleman and ending with Matthew A. Dugard\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1849:\n        Hannah E. Choi, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1850:\n        2 nominations in the Army beginning with Steven P. Perry, Jr. and ending with Rebecca D. White\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1851:\n        9 nominations in the Army beginning with Roy A. George and ending with Anthony J. Smithhart II\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1852:\n        Gary Levy, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1853:\n        0003824486, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1854:\n        61 nominations in the Army beginning with Jesse J. Adamson and ending with Heung S. Yoo\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1855:\n        17 nominations in the Army beginning with Matthew D. Atkins and ending with Christopher W. Wallace\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1856:\n        4 nominations in the Army beginning with Joseph T. Conley III and ending with Rodney P. Kelley\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1857:\n        Richard T. Hill, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1858:\n        Timothy J. Leone, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1859:\n        Colton T. Cash, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1860:\n        Bradley J. Marron, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1861:\n        Ramon R. Gonzalez Figueroa, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1862:\n        Ivan J. Serpaperez, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1863:\n        Adam R. Mann, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1864:\n        Cody S. Foister, in the Army, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1865:\n        291 nominations in the Army beginning with Michael L. Able and ending with Ryan J. Zimmerman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1866:\n        Juan J. Barba-Jaume, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1867:\n        Riccardo S. Hicks, Jr., in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1868:\n        Nathan K. Magare, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1869:\n        14 nominations in the Navy beginning with James E. Barclay and ending with Justus E. Steckman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1870:\n        12 nominations in the Navy beginning with Adam M. Baroni and ending with Loudon A. Westgard III\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1871:\n        5 nominations in the Navy beginning with Dennis J. Crump and ending with Matthew S. Maupin\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1872:\n        2 nominations in the Navy beginning with Joseph M. Federico and ending with Bryan J. Kauffman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1873:\n        52 nominations in the Navy beginning with Christopher M. Andrews and ending with Andrew C. Wyman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1874:\n        12 nominations in the Navy beginning with Rafal B. Banek and ending with Jamey R. Wilson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1875:\n        10 nominations in the Navy beginning with Thomas P. Byrnes and ending with Ray L. Wolcott\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1876:\n        5 nominations in the Navy beginning with Francis A. Goiran and ending with Sarah D. Thomas\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1877:\n        3 nominations in the Navy beginning with John F. Landis and ending with Ryan Murphy\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1878:\n        16 nominations in the Navy beginning with Joseph E. Allen and ending with Elliot M. Ross\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1879:\n        13 nominations in the Navy beginning with David F. Bell and ending with Joseph R. Tullis III\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1880:\n        17 nominations in the Navy beginning with Frederick J. Auth and ending with Brett M. Woodard\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1881:\n        39 nominations in the Navy beginning with Kwadwo S. Agyepong and ending with Ryan D. Zachar\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1882:\n        25 nominations in the Navy beginning with Kelly W. Agha and ending with Amy L. Younger\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1883:\n        591 nominations in the Navy beginning with Nicholas H. Abelein and ending with Timothy J. Zakriski\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1884:\n        26 nominations in the Navy beginning with Garrett L. Adams and ending with Iris P. Wood\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1885:\n        29 nominations in the Navy beginning with Brandon M. Beckler and ending with James M. Zweifel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1886:\n        13 nominations in the Navy beginning with Michael C. Becker II and ending with William N. Zinicolalapin\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1887:\n        18 nominations in the Navy beginning with James K. Brown and ending with David K. Zivnuska\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1888:\n        8 nominations in the Navy beginning with David M. Gardner and ending with Lauren M. Spaziano\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1889:\n        9 nominations in the Navy beginning with Tyler L. Branham and ending with Lee R. Thackston\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1890:\n        3 nominations in the Navy beginning with Eric A. Gardner and ending with Jeremy S. Talmadge\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1891:\n        5 nominations in the Navy beginning with Johan Baik and ending with Daniel A. Sorensen\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1892:\n        5 nominations in the Navy beginning with Richard A. Barkley and ending with Richard B. Wright\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1893:\n        12 nominations in the Navy beginning with Christopher C. Cady and ending with Roel Rosalez\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1894:\n        21 nominations in the Navy beginning with Milton G. Casasola and ending with Paul S. Young\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1895:\n        James F. Sullivan IV, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1896:\n        Christopher R. Napoli, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1897:\n        Ross C. Huddleston, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1898:\n        Lucas M. Malabad, in the Space Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1899:\n        2 nominations in the Space Force beginning with Davin Mao and ending with Daniel S. Teel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1906-1:\n        18 nominations in the Air Force beginning with Brig. Gen. Steven G. Behmer and ending with Brig. Gen. Frank R. Verdugo\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1907:\n        Col. John M. Schutte, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1908:\n        Col. Lucas J. Teel, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1909:\n        Maj. Gen. David Wilson, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1910:\n        Brig. Gen. Justin W. Osberg, in the Army, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1911:\n        Maj. Gen. Joseph A. Ryan, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1912:\n        Brig. Gen. Jonathan M. Stubbs, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1914:\n        Maj. Gen. William H. Graham, Jr., in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1915:\n        16 nominations in the Army beginning with Brig. Gen. Andree G. Carter and ending with Col. Mitchell J. Wisniewski III\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1916:\n        Maj. Gen. Kevin D. Admiral, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1917-1:\n        82 nominations in the Army beginning with Col. Brian R. Abraham and ending with Col. Roger B. Zeigler\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1918:\n        Col. Eric W. Widmar, in the Army, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1919:\n        22 nominations in the Army beginning with Brig. Gen. Troy E. Armstrong and ending with Brig. Gen. Teri D. Williams\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1921:\n        Vice Adm. Daniel W. Dwyer, in the Navy, to be Vice Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1922:\n        Vice Adm. Michael E. Boyle, in the Navy, to be Vice Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1923:\n        123 nominations in the Air Force beginning with Travis P. Abeita and ending with Eric T. Yerly\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1924:\n        38 nominations in the Air Force beginning with Andrew Kyle Baldwin and ending with Desbah Rose Yazzie\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1925:\n        71 nominations in the Air Force beginning with Elena A. Amspacher and ending with Kristina M. Zuccarelli\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1926:\n        47 nominations in the Air Force beginning with Edison I. Abeyta and ending with Mike B. Youn\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1928:\n        279 nominations in the Air Force beginning with Samory Ahmir Abdulraheem and ending with Andrew K. Zimmer\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1929:\n        547 nominations in the Air Force beginning with Neils J. Abderhalden and ending with Matthew A. Zimmer\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1930:\n        231 nominations in the Air Force beginning with Chastine R. Abueg and ending with Mason T. Workman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1931:\n        Thomas S. Randall, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1932:\n        Edwin Rodriguez, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1933:\n        Robert L. Wooten III, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1934:\n        Jason P. Haggard, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1935:\n        Mark T. Moore, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1936:\n        John A. Temme, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1937:\n        49 nominations in the Army beginning with John M. Aguilar, Jr. and ending with Eric T. Pelosi\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1938:\n        Ramon L. DeJesusmunoz, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1939:\n        Blaine C. Pitkin, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1940:\n        Kalista M. Ming, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1941:\n        Kevin S. McCormick, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1942:\n        James J. Cullen, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1943:\n        Steven C. McGhan, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1944:\n        Brenda L. Beegle, in the Space Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1945:\n        13 nominations in the Space Force beginning with Clifford V. Sulham and ending with Stephanie L. Wexler\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1962-1:\n        16 nominations in the Army beginning with Brig. Gen. Stephanie R. Ahern and ending with Brig. Gen. Jeffrey A. VanAntwerp\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1963:\n        2 nominations in the Air Force beginning with Brig. Gen. Edward H. Evans, Jr. and ending with Brig. Gen. Gent Welsh, Jr.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1964:\n        Brig. Gen. Daniel R. McDonough, in the Air Force, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1965:\n        22 nominations in the Air Force beginning with Col. Nathan P. Aysta and ending with Col. David R. Wright\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1966:\n        Col. David R. Chauvin, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1967:\n        3 nominations in the Air Force beginning with Col. John D. Blackburn and ending with Col. Michael B. Meason\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1968:\n        9 nominations in the Air Force beginning with Col. Matthew F. Blue and ending with Col. Stuart M. Solomon\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1969:\n        9 nominations in the Air Force beginning with Col. Patrick D. Chard and ending with Col. Adria P. Zuccaro\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1970:\n        10 nominations in the Air Force beginning with Brig. Gen. Michael W. Bank and ending with Brig. Gen. Kimbra L. Sterr\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1971:\n        Brig. Gen. Michael T. Venerdi, in the Air Force, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1972:\n        4 nominations in the Air Force beginning with Brig. Gen. Akshai M. Gandhi and ending with Brig. Gen. Michael D. Stohler\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1973:\n        5 nominations in the Air Force beginning with Brig. Gen. Peter G. Bailey and ending with Brig. Gen. Bryony A. Terrell\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1974:\n        5 nominations in the Air Force beginning with Brig. Gen. Kevin V. Doyle and ending with Brig. Gen. Christopher J. Sheppard\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1985:\n        Lt. Gen. John D. Lamontagne, in the Air Force, to be General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1987:\n        Maj. Gen. Michael L. Ahmann, in the Air Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1988:\n        Maj. Gen. Michael L. Downs, in the Air Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1989:\n        Maj. Gen. Evan L. Pettus, in the Air Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1990:\n        Maj. Gen. Rebecca J. Sonkiss, in the Air Force, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1991:\n        Maj. Gen. Joel B. Vowell, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1993:\n        Maj. Gen. Curtis A. Buzzard, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1994:\n        Maj. Gen. Edmond M. Brown, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1997:\n        Rear Adm. Peter A. Garvin, in the Navy, to be Vice Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN1999:\n        Dewee S. Debusk, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2000:\n        Kyle Y. Tobara, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2001:\n        4 nominations in the Army beginning with Daniel E. Ball and ending with Christopher E. Powers\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2002:\n        4 nominations in the Army beginning with Shannon D. Huntley and ending with William D. Vanpool\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2003:\n        81 nominations in the Navy beginning with Allen M. Agor and ending with Jonathan A. Yuen\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Welch, at  7:41 p.m., the Senate adjourned, under its order of today, until 11 a.m. tomorrow.","actionTimeStamp":"--"}]}