{"retrieved-date":"2024-1-25","actions-date":"Wednesday, January 24, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, January 24)","actionItem":"S. 2853 (Sen. Rosen):\n        A bill to require the Secretary of Health and Human Services and the Secretary of Labor to conduct a study and issue a report on grant programs to support the nursing workforce.\n\n        -- Senate Committee on Health, Education, Labor, and Pensions discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.J.Res. 38 (Sen. Rubio):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Federal Highway Administration relating to \"Waiver of Buy America Requirements for Electric Vehicle Chargers\".\n\n        -- Veto message received in Senate. Ordered held at the desk.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, January 24)","actionItem":"PN1130:\n        Jacquelyn D. Austin, of South Carolina, to be United States District Judge for the District of South Carolina\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 79 - 17. Record Vote Number: 18 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 80 - 17. Record Vote Number: 20 \n\n\n\n PN1242:\n        Cristal C. Brisco, of Indiana, to be United States District Judge for the Northern District of Indiana\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 68 - 29. Record Vote Number: 19 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 67 - 32. Record Vote Number: 21 \n\n\n\n PN1250:\n        Gretchen S. Lund, of Indiana, to be United States District Judge for the Northern District of Indiana\n\n        -- Cloture motion withdrawn by unanimous consent in Senate.\n\n        -- By unanimous consent agreement, debate and vote 1/25/2024.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  7:10 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}