{"retrieved-date":"2024-12-17","actions-date":"Monday, December 16, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Thursday, December 12, 2024,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Thursday, December 12, 2024, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, December 16)","actionItem":"H.R. 4467 (Rep. Brecheen):\n        A bill to direct the Under Secretary for Management of the Department of Homeland Security to assess contracts for covered services performed by contractor personnel along the United States land border with Mexico, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 5009 (Rep. Joyce):\n        A bill to reauthorize wildlife habitat and conservation programs, and for other purposes.\n\n        -- Considered by Senate (Message from the House considered).\n\n        -- Cloture on the motion to concur in the House Amendment to the Senate Amendment to H.R. 5009 invoked in Senate by Yea-Nay Vote. 83 - 12. Record Vote Number: 324 \n\n\n        -- Motion by Senator Schumer to refer to Senate Committee on Armed Services with instructions to report back forthwith with the following amendment (SA 3319) fell when cloture was invoked on the motion to concur in the House amendment to the Senate amendment to H.R. 5009 in Senate.\n \n\n S.Amdt. 3317 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate (Message from the House considered).\n\n\n S.Amdt. 3318 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate (Message from the House considered).\n\n\n S.Amdt. 3319 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate (Message from the House considered).\n\n        --SA 3319 fell when cloture invoked on the motion to concur in the House amendment to the Senate amendment to H.R. 5009.\n\n\n S.Amdt. 3320 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate (Message from the House considered).\n\n        --SA 3320 fell when SA 3319 (the instructions of the motion to refer) fell \n\n\n S.Amdt. 3321 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate (Message from the House considered).\n\n        --SA 3321 fell when SA 3320 fell.\n\n\n\n\n H.R. 7177 (Rep. Strong):\n        A bill to amend title 28, United States Code, to consolidate certain divisions in the Northern District of Alabama.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7524 (Rep. Sessions):\n        A bill to amend title 40, United States Code, to require the submission of reports on certain information technology services funds to Congress before expenditures may be made, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 8219 (Rep. Tokuda):\n        A bill to require the Secretary of the Interior to conduct a study to assess the suitability and feasibility of designating certain land as the Lahaina National Heritage Area, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 8413 (Rep. Smith):\n        A bill to provide for the conveyance of certain Federal land at Swanson Reservoir and Hugh Butler Reservoir in the State of Nebraska, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 465 (Sen. Cortez Masto):\n        A bill to require Federal law enforcement agencies to report on cases of missing or murdered Indians, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 5300 (Sen. Kaine):\n        A bill to authorize the Administrator of the National Aeronautics and Space Administration to reimburse the Town of Chincoteague, Virginia, for costs directly associated with the removal and replacement of certain drinking water wells.\n\n        -- Senate Committee on Commerce, Science, and Transportation discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 5465 (Sen. Cruz):\n        A bill to clarify where court may be held for certain district courts in Texas and California.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 5543 (Sen. Coons):\n        A bill to amend the Fair Credit Reporting Act to prohibit consumer reporting agencies from furnishing consumer reports containing adverse items of information about a consumer that resulted from that consumer being unlawfully or wrongfully detained abroad or held hostage abroad.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Monday, December 16)","actionItem":"PN2244:\n        Benjamin J. Cheeks, of California, to be United States District Judge for the Southern District of California\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN2245:\n        Serena Raquel Murillo, of California, to be United States District Judge for the Central District of California\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.","actionTimeStamp":"--"},{"index":6,"header":"Recess","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  7:16 p.m., the Senate recessed, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}