{"retrieved-date":"2023-6-23","actions-date":"Wednesday, June 21, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, June 21)","actionItem":"S.J.Res. 11 (Sen. Fischer):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Environmental Protection Agency relating to \"Control of Air Pollution From New Motor Vehicles: Heavy-Duty Engine and Vehicle Standards\".\n\n        -- Veto Message considered in Senate.\n\n        -- Failed of passage in Senate over veto by Yea-Nay Vote. 50 - 50. Record Vote Number: 167 \n\n\n\n S.Res. 261 (Sen. Cortez Masto):\n        A resolution commending and congratulating the Vegas Golden Knights on winning the 2023 Stanley Cup Final.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 262 (Sen. Klobuchar):\n        A resolution authorizing the printing of a collection of the rules of the committees of the Senate.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.\n\n\n S.Res. 263 (Sen. Cornyn):\n        A resolution commemorating June 19, 2023, as \"Juneteenth National Independence Day\" in recognition of June 19, 1865, the date on which news of the end of slavery reached the slaves in the Southwestern States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 264 (Sen. Sullivan):\n        A resolution designating June 2023 as \"National Post-Traumatic Stress Awareness Month\" and June 27, 2023, as \"National Post-Traumatic Stress Awareness Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, June 21)","actionItem":"PN82:\n        Natasha C. Merle, of New York, to be United States District Judge for the Eastern District of New York\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 50. Record Vote Number: 168 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 169 \n\n\n\n PN472:\n        90 nominations in the Army beginning with Kyle D. Aemisegger and ending with D017212\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN473:\n        19 nominations in the Army beginning with Aileen R. Cabanadalogan and ending with John F. Underwood\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN503:\n        2 nominations in the Air Force beginning with Andrew K. Berkey and ending with Brandon Woods\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN504:\n        Jacquelyn P. Smith, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN515:\n        136 nominations in the Army beginning with Harry T. Aubin and ending with D016621\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN516:\n        29 nominations in the Army beginning with Joshua A. Akers and ending with Shenice L. Williams\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN517:\n        301 nominations in the Army beginning with Alexandra M. Adams and ending with D016620\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN518:\n        61 nominations in the Army beginning with Andrea C. Baeder and ending with Peter S. Yoon\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN559:\n        206 nominations in the Navy beginning with Bryce D. Abbott and ending with Matthew A. Wright\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN560:\n        13 nominations in the Navy beginning with Edward A. Carlton and ending with Genevieve G. Ubina\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN561:\n        6 nominations in the Navy beginning with Andrea H. Cameron and ending with Warren W. Tomlinson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN562:\n        14 nominations in the Navy beginning with Mylene R. Arvizo and ending with Ashley S. Wright\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN563:\n        10 nominations in the Navy beginning with Sarah E. Abbott and ending with John A. Walsh\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN564:\n        4 nominations in the Navy beginning with Curtis Brown and ending with Gary M. Shelley\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN565:\n        3 nominations in the Navy beginning with Mark K. Corbliss and ending with Antoine D. Thornton\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN566:\n        18 nominations in the Navy beginning with Hannah L. Bealon and ending with Stanley C. Ware\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN567:\n        14 nominations in the Navy beginning with Cameron M. Balma and ending with Melinda K. Schryver\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN568:\n        2 nominations in the Navy beginning with Alan M. Brechbill and ending with David J. Tebbe\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN569:\n        4 nominations in the Navy beginning with Ross M. Anderson and ending with Roger D. Horne\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN570:\n        4 nominations in the Navy beginning with Homer F. Hensy and ending with Gregory F. Notaro\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN571:\n        5 nominations in the Navy beginning with Tommie G. Crawford and ending with Shannon P. Thompson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN572:\n        4 nominations in the Navy beginning with John E. Fage and ending with Rebecca L. Rebarich\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN573:\n        10 nominations in the Navy beginning with Gavin H. Clough and ending with Matthew G. Zublic\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN574:\n        4 nominations in the Navy beginning with Jennifer J. Landry and ending with Jonathan A. Savage\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN575:\n        14 nominations in the Navy beginning with Bradley H. Abramowitz and ending with Chelsey L. Zwicker\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN596:\n        16 nominations in the Air Force beginning with David B. Barker and ending with Jocelyn M. Whalen\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN602:\n        76 nominations in the Army beginning with Heather R. Alsupmorton and ending with Judiza L. Zelaya\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN603:\n        122 nominations in the Army beginning with Boma O. Afiesimama and ending with D016999\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN604:\n        31 nominations in the Army beginning with Jamie D. Bell and ending with Justin Zimmerman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN605:\n        13 nominations in the Army beginning with Rachel A. Acciacca and ending with Laura E. Riddle\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN606:\n        33 nominations in the Army beginning with Jamilia M. Adamshenderson and ending with John E. Wilson, Jr.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN607:\n        44 nominations in the Army beginning with Corebrians A. Abraham and ending with Christopher R. Wilson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN608:\n        10 nominations in the Army beginning with Aaron Crombie and ending with Larry A. Wyatt\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN609:\n        7 nominations in the Army beginning with Charles E. Bane and ending with Thomas R. Tucker III\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN619:\n        63 nominations in the Navy beginning with Eric J. Adler and ending with Matthew A. Williams\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN620:\n        22 nominations in the Navy beginning with Lucas R. Argobright and ending with Sarah E. Turse\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN621:\n        Patrick C. Lazzaretti, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN622:\n        3 nominations in the Navy beginning with Robert A. Paynter, Jr. and ending with Todd C. Winn\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN623:\n        6 nominations in the Navy beginning with Stanley J. Benes IV and ending with Michael Sullivan\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN624:\n        3 nominations in the Navy beginning with James P. Mcdonnell and ending with Joseph E. Walker\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN625:\n        Donna M. Chuba, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN626:\n        Anton B. Allen, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN627:\n        5 nominations in the Navy beginning with Adam M. Clampitt and ending with Gustavo Perez\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN628:\n        3 nominations in the Navy beginning with Christopher P. Cook and ending with Matthew E. Hobbs\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN629:\n        2 nominations in the Navy beginning with Demetrio A. Camua III and ending with Arthur C. Fong\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN630:\n        Loren C. Hoelscher, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN631:\n        3 nominations in the Navy beginning with Matthew T. Chatigny and ending with Kevin C. Lien\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN632:\n        3 nominations in the Navy beginning with Joshua C. Gettle and ending with Gerardo Torres\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN633:\n        8 nominations in the Navy beginning with John J. Bridges and ending with Mark H. Overstreet\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN634:\n        Ryan H. Metzler, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN643:\n        Thomas A. Summers, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN653:\n        Daniel J. Wittmer, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN654:\n        Marina F. Perez, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN655:\n        Nicholas J. Norton, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN656:\n        Artreese R. Adams, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN657:\n        Warren N. Washington, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN658:\n        Jacob W. Cavender, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN659:\n        Justin M. Fowler, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN660:\n        Jason P. Pancoe, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN661:\n        Benjamin F. Iverson, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN662:\n        Dustin B. Kosar, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN663:\n        20 nominations in the Navy beginning with Dennis L. Avery and ending with Brian D. Wuestewald\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN664:\n        10 nominations in the Navy beginning with Khristiannoe C. Caindoy and ending with Dimitry P. Vincent\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN665:\n        3 nominations in the Navy beginning with Matthew D. Gleason and ending with Emily Y. Royse\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN666:\n        Jacob S. Tharp, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN692:\n        265 nominations in the Air Force beginning with Stephen David Albert and ending with Jamie Taylor Zimmermann\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN693:\n        135 nominations in the Air Force beginning with Robert D. Allen and ending with Nicolas H. Zimmerman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN694:\n        600 nominations in the Air Force beginning with Christopher K. Adams and ending with Raymond P. Zhang\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN695:\n        74 nominations in the Air Force beginning with Nicholas F. Aliotta and ending with Jason J. Zummo\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN697:\n        52 nominations in the Air Force beginning with Andrew D. Ahn and ending with Oyunchimeg Young\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN698:\n        14 nominations in the Air Force beginning with Sarah E. Abel and ending with Michelle E. Wyche\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN699:\n        20 nominations in the Air Force beginning with Michael J. Alfaro and ending with Sara M. Wilson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN700:\n        Candice L. Pipes, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN701:\n        2 nominations in the Air Force beginning with Michael A. Growden and ending with Hsienliang R. Tseng\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN702:\n        Mark G. Kappelmann, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN703:\n        Leah H. Georgieva, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN704:\n        Nicholas R. Yetman, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN705:\n        Kevin L. Montgomery, Jr., in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN706:\n        9 nominations in the Army beginning with David J. Bedells and ending with Michael D. Zultak\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN707:\n        3 nominations in the Army beginning with Molly E. Keith and ending with Dallas D. Mcmullen\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN709:\n        Steven E. Anderson, in the Marine Corps, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN710:\n        30 nominations in the Navy beginning with Christopher E. Barnes and ending with Chadwick Y. Yasuda\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN711:\n        65 nominations in the Navy beginning with Kenric T. Aban and ending with Jeffrey C. Worthley\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN712:\n        20 nominations in the Navy beginning with Michael R. Andersen and ending with Christopher L. Young\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN713:\n        11 nominations in the Navy beginning with Dominic J. Antenucci and ending with Christopher C. Swain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN714:\n        550 nominations in the Navy beginning with William H. Abbitt and ending with Thomas W. Zimmerman\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN715:\n        38 nominations in the Navy beginning with Joshua M. Anderson and ending with Alexander G. Williams\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN716:\n        25 nominations in the Navy beginning with David L. Aguilar and ending with Daniel J. Walker\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN717:\n        8 nominations in the Navy beginning with Sean A. Brophy and ending with Jesus A. Uranga, Jr.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN718:\n        16 nominations in the Navy beginning with Francis G. Coyle and ending with Daniel A. Tantillo\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN719:\n        14 nominations in the Navy beginning with Rebecca L. Anderson and ending with John L. Vincent\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN720:\n        23 nominations in the Navy beginning with Nick Avila and ending with Michael P. Wolchko\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN721:\n        11 nominations in the Navy beginning with Michael K. Beall and ending with Alanna B. Youngblood\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN722:\n        2 nominations in the Navy beginning with Forrest N. Bush and ending with Nathan J. Richardson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN723:\n        48 nominations in the Navy beginning with Scott B. Aaron and ending with Clinton M. Woods\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN724:\n        32 nominations in the Navy beginning with Jessica L. Alexander and ending with Crystal R. Warrene\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN725:\n        46 nominations in the Navy beginning with Suzanne T. Alford and ending with Eric R. Wright\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN726:\n        14 nominations in the Navy beginning with Nicholas D. Chiudioni and ending with Julian G. Wilson III\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN727:\n        16 nominations in the Navy beginning with Marvin E. Bartholomew and ending with Kirtley N. Yeiser\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN728:\n        13 nominations in the Navy beginning with Quentin Albea and ending with Edward E. Weekley, Jr.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN729:\n        15 nominations in the Navy beginning with Paul M. Allen and ending with Thomas H. Williams, Jr.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN730:\n        9 nominations in the Navy beginning with Scott P. Ader and ending with Philip R. Saulnier\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN731:\n        Erika M. Meszaros, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN732:\n        36 nominations in the Navy beginning with Mary R. Anker and ending with Brandon K. Wolf\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN733:\n        12 nominations in the Navy beginning with David W. Alexander and ending with John C. Vandyke\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN734:\n        11 nominations in the Navy beginning with Christopher S. Casne and ending with Justin D. Spinks\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN735:\n        28 nominations in the Navy beginning with Kevin L. Borkert and ending with Blake A. Whittle\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN745:\n        Craig A. Ambrose, in the Air Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN746:\n        Bibek Joshi, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN747:\n        Adrian K. Williford, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN748:\n        2 nominations in the Air Force beginning with Daniel D. Cole and ending with Edward F. Leonard\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN749:\n        14 nominations in the Army beginning with Steven D. Bryant and ending with D011339\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN750:\n        Joseph A. St Pierre II, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN751:\n        2 nominations in the Army beginning with Jeffrey A. Banks and ending with Jeffrey R. Weinstein\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN752:\n        Isaac A. Gutierrez, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN753:\n        Rick J. Mata, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN754:\n        D016094, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN755:\n        11 nominations in the Navy beginning with Theodore G. Cavoores, Jr. and ending with Christy L. Rousseau\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN756:\n        7 nominations in the Navy beginning with Andrew E. Carmichael and ending with David N. Stock\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN757:\n        7 nominations in the Navy beginning with Kirsten M. Betak and ending with Suzanne J. Wood\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN758:\n        4 nominations in the Navy beginning with Sarah E. Davis and ending with Jeffrey J. Rockwood\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN759:\n        28 nominations in the Navy beginning with Bryan T. Alvarez and ending with Jennifer J. Vogt\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN760:\n        8 nominations in the Navy beginning with Rodney M. Bonner and ending with Charles C. Thompson\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN761:\n        Julie K. Moss, in the Navy, to be Captain\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN762:\n        5 nominations in the Navy beginning with Luis E. Alderman II and ending with Melinda S. L. Zalma\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN763:\n        6 nominations in the Navy beginning with Timothy W. Gleason and ending with Cory A. Woods\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN764:\n        Robin J. Glebes, in the Space Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN765:\n        3 nominations in the Space Force beginning with Lisa T. Green and ending with Keith D. Van Dyck\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN766:\n        36 nominations in the Space Force beginning with Phoenix L. Hauser and ending with Dustin L. White\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n Treaty Doc. 112-8:\n        The Convention between the Government of the United States of America and the Government of the Republic of Chile for the Avoidance of Double Taxation and the Prevention of Fiscal Evasion with Respect to Taxes on Income and Capital, signed in Washington on February 4, 2010, with a Protocol signed the same day, as corrected by exchanges of notes effected February 25, 2011, and February 10 and 21, 2012, and a related agreement effected by exchange of notes (the \"related Agreement\") on February 4, 2010\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 97 - 2. Record Vote Number: 170 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate 6/22/2023.\n \n\n S.Amdt. 136 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 136 proposed by Senator Schumer.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Bennet, at  7:57 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}