{"retrieved-date":"2024-6-13","actions-date":"Wednesday, June 12, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, June 12)","actionItem":"S. 3984 (Sen. Cornyn):\n        A bill to amend the State Justice Institute Act of 1984 to authorize the State Justice Institute to provide awards to certain organizations to establish a State judicial threat intelligence and resource center.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 731 (Sen. Scott, of FL):\n        A resolution honoring the memory of the victims of the heinous attack at the Pulse nightclub on June 12, 2016.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, June 12)","actionItem":"PN1469:\n        Judy W. Chang, of Massachusetts, to be a Member of the Federal Energy Regulatory Commission for a term expiring June 30, 2029\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 63 - 31. Record Vote Number: 195 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate and vote 6/13/2024.\n\n\n PN1470:\n        David Rosner, of Massachusetts, to be a Member of the Federal Energy Regulatory Commission for a term expiring June 30, 2027\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 67 - 27. Record Vote Number: 192 \n\n\n\n PN1471:\n        Lindsay S. See, of West Virginia, to be a Member of the Federal Energy Regulatory Commission for a term expiring June 30, 2028\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 86 - 9. Record Vote Number: 193 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 83 - 12. Record Vote Number: 194","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Ossoff, at  6:54 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}