{"retrieved-date":"2025-9-10","actions-date":"Monday, September 8, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Thursday, September 4, 2025,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Thursday, September 4, 2025, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, September  8)","actionItem":"H.R. 452 (Rep. Stauber):\n        A bill to award 3 Congressional Gold Medals to the members of the 1980 U.S. Olympic Men's Ice Hockey Team, in recognition of their extraordinary achievement at the 1980 Winter Olympics where, being comprised of amateur collegiate players, they defeated the dominant Soviet hockey team in the historic \"Miracle on Ice\", revitalizing American morale at the height of the Cold War, inspiring generations and transforming the sport of hockey in the United States.\n\n        -- Senate Committee on Banking, Housing, and Urban Affairs discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3828 (Sen. Cramer):\n        In the nature of a substitute.\n\n        --Amendment SA 3828 proposed by Senator Moran for Senator Cramer.\n\n        --Amendment SA 3828 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 371 (Sen. Klobuchar):\n        A resolution honoring the victims and survivors of the mass shooting at the Annunciation Catholic Church and School in Minneapolis, Minnesota.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n \n\n S.Amdt. 3827 (Sen. Klobuchar):\n        To correct a capitalization error.\n\n        --Amendment SA 3827 proposed by Senator Moran for Senator Klobuchar.\n\n        --Amendment SA 3827 agreed to in Senate by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Monday, September  8)","actionItem":"PN26-32:\n        David Metcalf, of Pennsylvania, to be United States Attorney for the Eastern District of Pennsylvania for the term of four years\n\n        -- Recommitted to Senate Committee on the Judiciary on a point of order.\n\n\n PN60-7:\n        Bart McKay Davis, of Idaho, to be United States Attorney for the District of Idaho for the term of four years\n\n        -- Recommitted to Senate Committee on the Judiciary on a point of order.\n\n\n PN60-15:\n        Ronald A. Parsons, Jr., of South Dakota, to be United States Attorney for the District of South Dakota for the term of four years\n\n        -- Recommitted to Senate Committee on the Judiciary on a point of order.\n\n\n PN60-18:\n        David Charles Waterman, of Iowa, to be United States Attorney for the Southern District of Iowa for the term of four years\n\n        -- Recommitted to Senate Committee on the Judiciary on a point of order.\n\n\n PN141-3:\n        Kurt Alme, of Montana, to be United States Attorney for the District of Montana, for the term of four years\n\n        -- Recommitted to Senate Committee on the Judiciary on a point of order.\n\n\n PN141-13:\n        Nicholas Chase, of North Dakota, to be United States Attorney for the District of North Dakota for the term of four years\n\n        -- Recommitted to Senate Committee on the Judiciary on a point of order.\n\n\n PN141-31:\n        Lesley Murphy, of Nebraska, to be United States Attorney for the District of Nebraska for the term of four years\n\n        -- Recommitted to Senate Committee on the Judiciary on a point of order.\n\n\n PN141-34:\n        Daniel Rosen, of Florida, to be United States Attorney for the District of Minnesota for the term of four years\n\n        -- Recommitted to Senate Committee on the Judiciary on a point of order.\n\n\n PN141-35:\n        Erik Siebert, of Virginia, to be United States Attorney for the Eastern District of Virginia for the term of four years\n\n        -- Recommitted to Senate Committee on the Judiciary on a point of order.\n\n\n PN141-38:\n        Kurt Wall, of Louisiana, to be United States Attorney for the Middle District of Louisiana for the term of four years\n\n        -- Recommitted to Senate Committee on the Judiciary on a point of order.\n\n\n PN346-1:\n        Edward L. Artau, of Florida, to be United States District Judge for the Southern District of Florida\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 43. Record Vote Number: 504","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Moran, at  7:14 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}