{"retrieved-date":"2022-12-16","actions-date":"Wednesday, December 14, 2022","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, December 14)","actionItem":"H.R. 1917 (Rep. Fletcher):\n        A bill to modify eligibility requirements for certain hazard mitigation assistance programs, and for other purposes.\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6525 (Sen. Peters):\n        In the nature of a substitute.\n\n        --Amendment SA 6525 proposed by Senator Schumer for Senator Peters.\n\n        --Amendment SA 6525 agreed to in Senate by Unanimous Consent.\n\n\n\n\n H.R. 5343 (Rep. Rice):\n        To direct the Comptroller General of the United States to submit a report to Congress on case management personnel turnover of the Federal Emergency Management Agency, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n H.R. 5943 (Rep. Timmons):\n        To designate the outpatient clinic of the Department of Veterans Affairs in Greenville, South Carolina, as the \"Lance Corporal Dana Cornell Darnell VA Clinic\".\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 5973 (Rep. Dingell):\n        A bill to reauthorize the Great Lakes Fish and Wildlife Restoration Act of 1990, and for other purposes.\n\n        -- Senate Committee on Environment and Public Works discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7776 (Rep. DeFazio):\n        A bill to provide for improvements to the rivers and harbors of the United States, to provide for the conservation and development of water and related resources, and for other purposes.\n\n        -- Considered by Senate (Messsage from the House considered).\n\n        -- Cloture motion on the motion to concur in the House amendment to the Senate amendment to H.R. 7776 with an amendment SA 6513 presented in Senate. \n\n        -- Cloture motion on the motion to concur in the House amendment to the Senate amendment to H.R. 7776 presented in Senate.\n \n\n S.Amdt. 6513 (Sen. Manchin):\n        To provide for American energy security by improving the permitting process.\n\n        --Considered by Senate (Messsage from the House considered).\n\n\n S.Amdt. 6515 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate (Messsage from the House considered).\n\n\n S.Amdt. 6516 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate (Messsage from the House considered).\n\n\n S.Amdt. 6517 (Sen. Schumer):\n        To modify the effective date.\n\n        --Considered by Senate (Messsage from the House considered).\n\n\n S.Amdt. 6518 (Sen. Schumer):\n        To modify the effective date.\n\n        --Considered by Senate (Messsage from the House considered).\n\n\n\n\n S. 1143 (Sen. Hawley):\n        A bill to prohibit certain individuals from downloading or using TikTok on any device issued by the United States or a government corporation.\n\n        -- Committee on Homeland Security and Governmental Affairs. Reported by Senator Peters without amendment. With written report No. 117-256.\n\n        -- Placed on Senate Legislative Calendar under General Orders. Calendar No. 642.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 1687 (Sen. Rubio):\n        A bill to amend section 21 of the Small Business Act to require cyber certification for small business development center counselors, and for other purposes.\n\n        -- Senate agreed to the House amendment to S. 1687 by Unanimous Consent.\n\n\n S. 2135 (Sen. Hassan):\n        A bill to amend title 31, United States Code, to require the Chief Operating Officer of each agency to compile a list of unnecessary programs, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute withdrawn by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6524 (Sen. Hassan):\n        In the nature of a substitute.\n\n        --Amendment SA 6524 proposed by Senator Schumer for Senator Hassan.\n\n        --Amendment SA 6524 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 3429 (Sen. Sullivan):\n        A bill to establish an Alaska Salmon Research Task Force.\n\n        -- Committee on Commerce, Science, and Transportation. Reported by Senator Cantwell with an amendment in the nature of a substitute. Without written report.\n\n        -- Placed on Senate Legislative Calendar under General Orders. Calendar No. 644.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute as amended agreed to by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6523 (Sen. Sullivan):\n        In the nature of a substitute.\n\n        --Amendment SA 6523 proposed by Senator Schumer for Senator Sullivan.\n\n        --Amendment SA 6523 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 3846 (Sen. Cornyn):\n        A bill to reauthorize the Justice and Mental Health Collaboration Program, and for other purposes.\n\n        -- Senate agreed to the House amendment to S. 3846 by Unanimous Consent.\n\n\n S. 4460 (Sen. Scott, of FL):\n        A bill to require the Commissioner of U.S. Customs and Border Protection to regularly review and update policies and manuals related to inspections at ports of entry.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 4893 (Sen. Peters):\n        A bill to amend the Lobbying Disclosure Act of 1995 to require certain disclosures by registrants regarding exemptions under the Foreign Agents Registration Act of 1938, as amended.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.J.Res. 60 (Sen. Scott, of SC):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Department of Education relating to \"Final Priorities, Requirements, Definitions, and Selection Criteria-Expanding Opportunity Through Quality Charter Schools Program (CSP)-Grants to State Entities (State Entity Grants); Grants to Charter Management Organizations for the Replication and Expansion of High-Quality Charter Schools (CMO Grants); and Grants to Charter School Developers for the Opening of New Charter Schools and for the Replication and Expansion of High-Quality Charter Schools (Developer Grants)\".\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Failed of passage in Senate by Yea-Nay Vote. 49 - 49. Record Vote Number: 390 \n\n\n\n S.Res. 872 (Sen. Braun):\n        A resolution recognizing Interscholastic Athletic Administrators' Day on December 14, 2022.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 873 (Sen. Schumer):\n        A resolution to authorize the production of records by the Secretary of the Senate and the Senate Sergeant at Arms.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, December 14)","actionItem":"PN953:\n        Francisco O. Mora, of Florida, to be Permanent Representative of the United States of America to the Organization of American States, with the rank of Ambassador\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 45. Record Vote Number: 391 \n\n\n\n PN1691:\n        Elizabeth Frawley Bagley, of Florida, to be Ambassador to the Federative Republic of Brazil\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  7:33 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}