{"retrieved-date":"2025-5-26","actions-date":"Thursday, May 22, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, May 22)","actionItem":"H.J.Res. 87 (Rep. James):\n        A joint resolution providing congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Environmental Protection Agency relating to \"California State Motor Vehicle and Engine Pollution Control Standards; Heavy-Duty Vehicle and Engine Emission Warranty and Maintenance Provisions; Advanced Clean Trucks; Zero Emission Airport Shuttle; Zero-Emission Power Train Certification; Waiver of Preemption; Notice of Decision\".\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 51 - 46. Record Vote Number: 278 \n\n\n        -- Measure laid before Senate by motion.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 51 - 45. Record Vote Number: 279 \n\n\n\n H.J.Res. 88 (Rep. Joyce):\n        A joint resolution providing congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Environmental Protection Agency relating to \"California State Motor Vehicle and Engine Pollution Control Standards; Advanced Clean Cars II; Waiver of Preemption; Notice of Decision\".\n\n        -- Considered by Senate.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 51 - 44. Record Vote Number: 277 \n\n\n\n H.J.Res. 89 (Rep. Obernolte):\n        A joint resolution providing congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Environmental Protection Agency relating to \"California State Motor Vehicle and Engine and Nonroad Engine Pollution Control Standards; The 'Omnibus' Low NOX Regulation; Waiver of Preemption; Notice of Decision\".\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 51 - 46. Record Vote Number: 280 \n\n\n        -- Measure laid before Senate by motion.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 49 - 46. Record Vote Number: 281 \n\n\n\n S. 1051 (Sen. Lankford):\n        A bill to establish the Historic Greenwood District-Black Wall Street National Monument in the State of Oklahoma, and for other purposes.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 214 (Sen. Hirono):\n        A resolution recognizing the significance of Asian American, Native Hawaiian, and Pacific Islander Heritage Month as an important time to celebrate the significant contributions of Asian Americans, Native Hawaiians, and Pacific Islanders to the history of the United States.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 246 (Sen. Rosen):\n        A resolution recognizing the significance of Jewish American Heritage Month and calling on elected officials and civil society leaders to counter antisemitism.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 250 (Sen. Grassley):\n        A resolution recognizing National Foster Care Month as an opportunity to raise awareness about the challenges of children in the foster care system, and encouraging Congress to implement policies to improve the lives of children in the foster care system.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 251 (Sen. Husted):\n        A resolution supporting the designation of May 4 through May 10, 2025, as \"Children's Mental Health Awareness Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 252 (Sen. Scott, of FL):\n        A resolution designating May 2025 as \"Older Americans Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 253 (Sen. Schmitt):\n        A resolution congratulating His Holiness Pope Leo XIV on his election to the papacy.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 254 (Sen. Cassidy):\n        A resolution designating June 12, 2025, as \"National Seersucker Day\", designating every Thursday after National Seersucker Day through the last Thursday in August 2025 as \"Seersucker Thursday\", and designating June 2025 as \"Seersucker Appreciation Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 255 (Sen. Hawley):\n        A resolution honoring the life, achievements, and legacy of former United States Senator Christopher \"Kit\" Bond of Missouri.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, May 22)","actionItem":"PN12-23:\n        Jared Isaacman, of Pennsylvania, to be Administrator of the National Aeronautics and Space Administration\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN17:\n        Michael Duffey, of Virginia, to be Under Secretary of Defense for Acquisition and Sustainment\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN22-16:\n        Dale Marks, of Florida, to be an Assistant Secretary of Defense\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN25-19:\n        Allison Hooker, of Georgia, to be an Under Secretary of State (Political Affairs)\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN50:\n        2 nominations in the Marine Corps beginning with Nathan C. Hess and ending with Christopher S. Lambert\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN116:\n        133 nominations in the Air Force beginning with Joseph L. Abrams and ending with Joseph M. Yabes, Jr.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN117:\n        23 nominations in the Air Force beginning with Margaret E. Abbott and ending with Rachael L. Voigt\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN121:\n        3 nominations in the Army beginning with Matthew D. Brandt and ending with Dejene G. Kassaye\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN122:\n        Missy L. McNeill, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN123:\n        Wendell C. Eldridge, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN124:\n        Eric M. Beall, in the Navy, to be Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN125:\n        Alexandra K. Holland, in the Navy, to be Lieutenant Commander\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN126:\n        Zachary R. Eagle, in the Space Force, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN127-1:\n        262 nominations in the Coast Guard beginning with Joshua S. Alleman and ending with Matthew G. Zavalij\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN128:\n        2 nominations in the Coast Guard beginning with Jason B. Veara and ending with Tara E. Larkin\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN132-1:\n        209 nominations in the Air Force beginning with Amara B. Adams and ending with Robert D. Young\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN134:\n        932 nominations in the Army beginning with Domanique M. Abner and ending with 00003259357\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN135:\n        425 nominations in the Army beginning with Edwin A. Abrazado and ending with 0003102153\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN136:\n        466 nominations in the Army beginning with Jessica S. Abbott and ending with 0003390902\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN137:\n        29 nominations in the Army beginning with Ross O. Anderson and ending with 0002422513\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN151:\n        Edward R. Rogers II, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN152:\n        4 nominations in the Navy beginning with Isabel M. Bernal and ending with John J. W. Yun\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Lankford, at 4:42 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}