{"retrieved-date":"2024-12-23","actions-date":"Friday, December 20, 2024","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Friday, December 20)","actionItem":"H.R. 82 (Rep. Graves):\n        A bill to amend title II of the Social Security Act to repeal the Government pension offset and windfall elimination provisions.\n\n        -- Considered by Senate.\n\n        -- Cloture motion on the measure presented in Senate.\n\n        -- Motion by Senator Schumer to commit to Senate Committee on Finance with instructions to report back forthwith with the following amendment (SA 3357) made in Senate.\n \n\n S.Amdt. 3331 (Sen. Crapo):\n        No Statement of Purpose on File.\n\n        --Amendment SA 3331 proposed by Senator Crapo.\n\n\n S.Amdt. 3346 (Sen. Paul):\n        To adjust the normal and early retirement ages for Social Security benefits and increase the maximum age for delayed retirement credits.\n\n        --Amendment SA 3346 proposed by Senator Paul.\n\n        --Amendment SA 3346, under the order of 12/20/2024, not having achieved 60 votes in the affirmative, not agreed to in Senate by Yea-Nay Vote. 3 - 93. Record Vote Number: \n\n\n S.Amdt. 3352 (Sen. Paul):\n        No Statement of Purpose on File.\n\n        --Amendment SA 3352 proposed by Senator Paul.\n\n        --Amendment SA 3352, under the order of 12/20/2024, not having achieved 60 votes in the affirmative, not agreed to in Senate by Yea-Nay Vote. 28 - 67. Record Vote Number: \n\n\n S.Amdt. 3355 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 3355 proposed by Senator Schumer.\n\n\n S.Amdt. 3356 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 3356 proposed by Senator Schumer to Amendment SA 3355.\n\n\n S.Amdt. 3357 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 3357 proposed by Senator Schumer.\n\n\n S.Amdt. 3358 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 3358 proposed by Senator Schumer to Amendment SA 3357 (the instructions of the motion to commit).\n\n\n S.Amdt. 3359 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 3359 proposed by Senator Schumer to Amendment SA 3358.\n\n\n S.Amdt. 3360 (Sen. Cruz):\n        No Statement of Purpose on File.\n\n        --Amendment SA 3360 proposed by Senator Cruz.\n\n\n\n\n H.R. 1318 (Rep. Neguse):\n        A bill to authorize the location of a monument on the National Mall to commemorate and honor the women's suffrage movement and the passage of the 19th Amendment to the Constitution, and for other purposes.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n H.R. 2997 (Rep. Boebert):\n        A bill to direct the Secretary of the Interior to convey to Mesa County, Colorado, certain Federal land in Colorado, and for other purposes.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 3391 (Rep. Wexton):\n        A bill to extend the Gabriella Miller Kids First Pediatric Research Program at the National Institutes of Health, and for other purposes.\n\n        -- Senate Committee on Health, Education, Labor, and Pensions discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n H.R. 6395 (Rep. Curtis):\n        A bill to amend the Energy Act of 2020 to require the Secretary of the Interior to include the Secretary of Health and Human Services in consultations regarding designations of critical minerals, elements, substances, and materials.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6852 (Rep. Espaillat):\n        A bill to designate Holcombe Rucker Park, in Harlem, New York, as a National Commemorative Site, and for other purposes.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 8012 (Rep. Waltz):\n        A bill to establish the Jackie Robinson Ballpark National Commemorative Site in the State of Florida, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 1348 (Sen. Barrasso):\n        A bill to redesignate land within certain wilderness study areas in the State of Wyoming, and for other purposes.\n\n        -- Passed Senate with an amendment by Voice Vote.\n\n\n S. 1553 (Sen. Barrasso):\n        A bill to amend the Federal Land Policy and Management Act of 1976 to improve the management of grazing permits and leases, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 1723 (Sen. Warren):\n        A bill to establish the Truth and Healing Commission on Indian Boarding School Policies in the United States, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute withdrawn by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Voice Vote.\n \n\n S.Amdt. 3351 (Sen. Schatz):\n        In the nature of a substitute.\n\n        --Amendment SA 3351 proposed by Senator Schatz.\n\n        --Amendment SA 3351 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 1890 (Sen. Wyden):\n        A bill to provide for the establishment of a land health management program on Federal land in Malheur County, Oregon, and for other purposes.\n\n        -- Passed Senate with an amendment and an amendment to the Title by Voice Vote \n\n\n S. 3195 (Sen. Kaine):\n        A bill to designate the General George C. Marshall House, in the Commonwealth of Virginia, as an affiliated area of the National Park System, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 5639 (Sen. Peters):\n        A bill to extend the authority for the protection of certain facilities and assets from unmanned aircraft.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Friday, December 20)","actionItem":"PN10:\n        David Michael Capozzi, of Maryland, to be a Director of the Amtrak Board of Directors for a term of five years\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN1693:\n        Elaine Marie Clegg, of Idaho, to be a Director of the Amtrak Board of Directors for a term of five years\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN2244:\n        Benjamin J. Cheeks, of California, to be United States District Judge for the Southern District of California\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 49 - 47. Record Vote Number: 329 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 49 - 47. Record Vote Number: 330 \n\n\n\n PN2245:\n        Serena Raquel Murillo, of California, to be United States District Judge for the Central District of California\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 49 - 47. Record Vote Number: 331 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 49 - 47. Record Vote Number: 332","actionTimeStamp":"--"}]}