{"retrieved-date":"2024-5-17","actions-date":"Wednesday, May 15, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, May 15)","actionItem":"S.J.Res. 57 (Sen. Schmitt):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Department of the Treasury relating to \"Coronavirus State and Local Fiscal Recovery Funds\".\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Unanimous Consent.\n\n        -- Failed of passage in Senate by Yea-Nay Vote. 46 - 49. Record Vote Number: 168 \n\n\n\n S.Res. 689 (Sen. Barrasso):\n        A resolution supporting the goals and ideals of National Hospital Week, to be observed from May 12 through May 18, 2024.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 690 (Sen. Collins):\n        A resolution supporting the designation of May 15, 2024, as \"National Senior Fraud Awareness Day\" to raise awareness about the increasing number of fraudulent scams targeted at seniors in the United States, to encourage the implementation of policies to prevent those scams from happening, and to improve protections from those scams for seniors.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 691 (Sen. Rubio):\n        A resolution expressing support for the designation of May 17, 2024, as \"DIPG Pediatric Brain Cancer Awareness Day\" to raise awareness of, and encourage research on, diffuse intrinsic pontine glioma tumors and pediatric cancers in general.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 692 (Sen. Grassley):\n        A resolution supporting the mission and goals of National Fentanyl Awareness Day in 2024, including increasing individual and public awareness of the impact of fake or counterfeit fentanyl pills on families and young people.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 693 (Sen. Hirono):\n        A resolution recognizing the significance of Asian American, Native Hawaiian, and Pacific Islander Heritage Month as an important time to celebrate the significant contributions of Asian Americans, Native Hawaiians, and Pacific Islanders to the history of the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, May 15)","actionItem":"PN927:\n        Courtney Diesel O'Donnell, of California, to be United States Permanent Representative to the United Nations Educational, Scientific, and Cultural Organization, with the rank of Ambassador\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 49 - 45. Record Vote Number: 164 \n\n\n\n PN1433:\n        Sanket Jayshukh Bulsara, of New York, to be United States District Judge for the Eastern District of New York\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 42. Record Vote Number: 165 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 42. Record Vote Number: 166 \n\n\n\n PN1436:\n        Eric C. Schulte, of South Dakota, to be United States District Judge for the District of South Dakota\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 61 - 33. Record Vote Number: 167","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  8:04 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}