{"retrieved-date":"2023-7-7","actions-date":"Thursday, June 22, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, June 22)","actionItem":"H.R. 1734 (Rep. Collins):\n        A bill to require coordinated National Institute of Standards and Technology science and research activities regarding illicit drugs containing xylazine, novel synthetic opioids, and other substances of concern, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 139 (Sen. Cruz):\n        in the nature of a substitute.\n\n        --Amendment SA 139 proposed by Senator Schumer for Senator Cruz.\n\n        --Amendment SA 139 agreed to in Senate by Unanimous Consent.\n\n\n\n\n H.J.Res. 44 (Rep. Clyde):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Bureau of Alcohol, Tobacco, Firearms, and Explosives relating to \"Factoring Criteria for Firearms with Attached 'Stabilizing Braces'\".\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Failed of passage in Senate by Yea-Nay Vote. 49 - 50. Record Vote Number: 171 \n\n\n        -- Message on Senate action sent to the House.\n\n\n S. 111 (Sen. Lankford):\n        A bill to require each agency, in providing notice of a rulemaking, to include a link to a 100-word plain language summary of the proposed rule.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 206 (Sen. Scott, of FL):\n        A bill to require the Commissioner of U.S. Customs and Border Protection to regularly review and update policies and manuals related to inspections at ports of entry.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 264 (Sen. Peters):\n        A bill to amend the Lobbying Disclosure Act of 1995 to require certain disclosures by registrants regarding exemptions under the Foreign Agents Registration Act of 1938, as amended.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 349 (Sen. Lankford):\n        A bill to amend title 5, United States Code, to authorize the appointment of spouses of members of the Armed Forces who are on active duty, disabled, or deceased to positions in which the spouses will work remotely.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 829 (Sen. Grassley):\n        A bill to amend the Lobbying Disclosure Act of 1995 to clarify a provision relating to certain contents of registrations under that Act.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 1549 (Sen. Peters):\n        A bill to provide the Congressional Budget Office with necessary authorities to expedite the sharing of data from executive branch agencies, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 247 (Sen. Rosen):\n        A resolution designating June 2023 as National Cybersecurity Education Month.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 277 (Sen. Durbin):\n        A resolution expressing the condolences of the Senate and honoring the memory of the victims on the first anniversary of the mass shooting at the Fourth of July parade in Highland Park, Illinois, on July 4, 2022.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 278 (Sen. Schumer):\n        A resolution to authorize testimony and representation in United States v. Hostetter.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 279 (Sen. Scott, of FL):\n        A resolution commemorating the passage of 2 years since the tragic building collapse in Surfside, Florida, on June 24, 2021.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, June 22)","actionItem":"PN70:\n        Rosemarie Hidalgo, of the District of Columbia, to be Director of the Violence Against Women Office, Department of Justice\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII be waived.\n\n\n PN81:\n        Tiffany M. Cartwright, of Washington, to be United States District Judge for the Western District of Washington\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII be waived.\n\n\n PN168:\n        Kymberly Kathryn Evanson, of Washington, to be United States District Judge for the Western District of Washington\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII be waived.\n\n\n PN382:\n        Xochitl Torres Small, of New Mexico, to be Deputy Secretary of Agriculture\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII be waived.\n\n        -- By unanimous consent agreement, debate 7/10/2023.\n\n\n Treaty Doc. 112-8:\n        The Convention between the Government of the United States of America and the Government of the Republic of Chile for the Avoidance of Double Taxation and the Prevention of Fiscal Evasion with Respect to Taxes on Income and Capital, signed in Washington on February 4, 2010, with a Protocol signed the same day, as corrected by exchanges of notes effected February 25, 2011, and February 10 and 21, 2012, and a related agreement effected by exchange of notes (the \"related Agreement\") on February 4, 2010\n\n        -- Considered by Senate.\n\n        -- Resolution of advice and consent to ratification agreed to in Senate by Yea-Nay Vote. 95 - 2. Record Vote Number: 172 \n\n \n\n S.Amdt. 136 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate.\n\n        --Proposed amendment SA 136 withdrawn in Senate.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  5:23 p.m., the Senate adjourned, under its order of today, until  2 p.m. on Monday, June 26, 2023.","actionTimeStamp":"--"}]}