{"retrieved-date":"2023-3-9","actions-date":"Wednesday, March 8, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, March  8)","actionItem":"H.J.Res. 26 (Rep. Clyde):\n        A joint resolution disapproving the action of the District of Columbia Council in approving the Revised Criminal Code Act of 2022.\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Voice Vote.\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Voice Vote.\n\n        -- Measure laid before Senate by motion.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 81 - 14. Record Vote Number: 49 \n\n\n\n S. 724 (Sen. Grassley):\n        A bill to protect children against sexual abuse and exploitation, and for other purposes.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.\n\n\n S.Res. 100 (Sen. Budd):\n        A resolution to honor the life and death of James Thomas Broyhill, former Senator for the State of North Carolina.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, March  8)","actionItem":"PN27:\n        Daniel I. Werfel, of the District of Columbia, to be Commissioner of Internal Revenue for the term expiring November 12, 2027\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 44. Record Vote Number: 48 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate and vote 3/9/2023.\n\n\n PN162:\n        Patrice H. Kunesh, of Minnesota, to be Commissioner of the Administration for Native Americans, Department of Health and Human Services\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 57 - 35. Record Vote Number: 47","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Ms. Hassan, at  8:08 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}