{"retrieved-date":"2023-1-27","actions-date":"Thu, 26 Jan 2023 22:01:18 -0500","actions-title":"House Floor Proceedings","actions-count":257,"actions-list":[{"index":1,"header":"--","actionItem":"The House adjourned. The next meeting is scheduled for 9:00 a.m. on January 27, 2023.","actionTimeStamp":"Thu, 26 Jan 2023 22:01:18 -0500"},{"index":2,"header":"--","actionItem":"On motion to adjourn Agreed to by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 22:01:17 -0500"},{"index":3,"header":"--","actionItem":"Mr. Schweikert moved that the House do now adjourn.","actionTimeStamp":"Thu, 26 Jan 2023 22:00:55 -0500"},{"index":4,"header":"SPECIAL ORDER SPEECHES","actionItem":"The House has concluded all anticipated legislative business and has proceeded to Special Order speeches.","actionTimeStamp":"Thu, 26 Jan 2023 21:41:04 -0500"},{"index":5,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with further one minute speeches.","actionTimeStamp":"Thu, 26 Jan 2023 21:36:08 -0500"},{"index":6,"header":"--","actionItem":"Committee of the Whole House on the state of the Union rises leaving H.R. 21 as unfinished business.","actionTimeStamp":"Thu, 26 Jan 2023 21:34:56 -0500"},{"index":7,"header":"--","actionItem":"On motion that the Committee rise Agreed to by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 21:34:47 -0500"},{"index":8,"header":"--","actionItem":"Mr. Armstrong moved that the Committee rise.","actionTimeStamp":"Thu, 26 Jan 2023 21:34:35 -0500"},{"index":9,"header":"--","actionItem":"On agreeing to the Tlaib amendment; Failed by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 21:34:13 -0500"},{"index":10,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Tlaib amendment No. 14 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 21:31:49 -0500"},{"index":11,"header":"--","actionItem":"An amendment, offered by Ms. Tlaib,  numbered 14 printed in the Congressional Record to reduce the 10 percent limitation to 0.1 percent leased for oil and gas production.","actionTimeStamp":"Thu, 26 Jan 2023 21:31:22 -0500"},{"index":12,"header":"--","actionItem":"Mr. Armstrong raised a point of order against the Tlaib amendment. Mr. Armstrong stated the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. The Chair sustained the point of order.","actionTimeStamp":"Thu, 26 Jan 2023 21:28:58 -0500"},{"index":13,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Tlaib amendment No. 13 under the five-minute rule. Pending the reservation of a point of order.","actionTimeStamp":"Thu, 26 Jan 2023 21:27:43 -0500"},{"index":14,"header":"--","actionItem":"An amendment, offered by Ms. Tlaib,  numbered 13 printed in the Congressional Record to add a new section requiring a report on campaign donations from the oil and gas industry.","actionTimeStamp":"Thu, 26 Jan 2023 21:27:04 -0500"},{"index":15,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Bowman amendment No. 92, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Bowman demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 21:26:12 -0500"},{"index":16,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Bowman amendment No. 92 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 21:24:28 -0500"},{"index":17,"header":"--","actionItem":"An amendment, offered by Mr. Bowman,  numbered 92 printed in the Congressional Record to authorize the participation, including in any lease auction that occurs pursuant to such plan, by any corporation or entity that the Secretary determines contributed to price gouging in the oil and gas sector in 2022.","actionTimeStamp":"Thu, 26 Jan 2023 21:23:40 -0500"},{"index":18,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Perez amendment No. 79, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Perez demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 21:22:44 -0500"},{"index":19,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Perez amendment No. 79 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 21:20:40 -0500"},{"index":20,"header":"--","actionItem":"An amendment, offered by Ms. Perez,  numbered 79 printed in the Congressional Record to limit leasing in the Washington/Oregon Planning Area if the lease would adversely impact coastal fisheries.","actionTimeStamp":"Thu, 26 Jan 2023 21:19:54 -0500"},{"index":21,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Plaskett amendment No. 43, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Plaskett demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 21:18:39 -0500"},{"index":22,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Plaskett amendment No. 43 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 21:13:08 -0500"},{"index":23,"header":"--","actionItem":"An amendment, offered by Ms. Plaskett,  numbered 43 printed in the Congressional Record to add a new section at the end of the bill Prohibition on Raising Energy Prices which will not increase the average price of energy for American consumers.","actionTimeStamp":"Thu, 26 Jan 2023 21:12:30 -0500"},{"index":24,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Barragan amendment No. 24, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Barragan demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 21:11:41 -0500"},{"index":25,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Barragan amendment No. 24 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 21:09:58 -0500"},{"index":26,"header":"--","actionItem":"An amendment, offered by Ms. Barragan,  numbered 24 printed in the Congressional Record to exclude any Federal land a boundary of which is within 3,200 feet of a residence, school, or hospital.","actionTimeStamp":"Thu, 26 Jan 2023 21:09:27 -0500"},{"index":27,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Castro (TX) amendment No. 4, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Castro (TX) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 21:08:29 -0500"},{"index":28,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Castro (TX) amendment No. 4 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 21:05:33 -0500"},{"index":29,"header":"--","actionItem":"An amendment, offered by Mr. Castro (TX),  numbered 4 printed in the Congressional Record to add a new subparagraph within paragraph 2 to provide for oil and gas leasing of any Federal lands that have a high concentration of orphaned oil and gas wells.","actionTimeStamp":"Thu, 26 Jan 2023 21:05:07 -0500"},{"index":30,"header":"--","actionItem":"On agreeing to the Takano amendment; Failed by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 21:03:59 -0500"},{"index":31,"header":"--","actionItem":"Mr. Armstrong raised a point of order against the Takano amendment. Mr. Armstrong stated the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. Point of order overruled by the Chair.","actionTimeStamp":"Thu, 26 Jan 2023 20:59:36 -0500"},{"index":32,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Takano amendment No. 82 under the five-minute rule. Pending the reservation of a point of order.","actionTimeStamp":"Thu, 26 Jan 2023 20:57:48 -0500"},{"index":33,"header":"--","actionItem":"An amendment, offered by Mr. Takano,  numbered 82 printed in the Congressional Record to make sundry amendments to the limitation paragraph and add at the end of the bill, a new section titled Effective Date.","actionTimeStamp":"Thu, 26 Jan 2023 20:57:11 -0500"},{"index":34,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Takano amendment No. 81, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Takano demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 20:56:14 -0500"},{"index":35,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Takano amendment No. 81 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 20:54:16 -0500"},{"index":36,"header":"--","actionItem":"An amendment, offered by Mr. Takano,  numbered 81 printed in the Congressional Record to add a consideration paragraph stating the Secretary shall consider the number of inactive but approved Federal oil and gas leases and permits to drill issued before the date of enactment of the subsection.","actionTimeStamp":"Thu, 26 Jan 2023 20:53:53 -0500"},{"index":37,"header":"--","actionItem":"On agreeing to the Takano amendment; Failed by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 20:53:33 -0500"},{"index":38,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Takano amendment No. 80 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 20:51:17 -0500"},{"index":39,"header":"--","actionItem":"An amendment, offered by Mr. Takano,  numbered 80 printed in the Congressional Record to add a paragraph stating the Secretary shall provide an opportunity of public comment on the plan for a period of at least 90 days.","actionTimeStamp":"Thu, 26 Jan 2023 20:50:38 -0500"},{"index":40,"header":"--","actionItem":"Mr. Armstrong raised a point of order against the Quigley amendment. Mr. Armstrong stated the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. The Chair sustained the point of order.","actionTimeStamp":"Thu, 26 Jan 2023 20:45:49 -0500"},{"index":41,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Quigley amendment No. 125 under the five-minute rule. Pending the reservation of a point of order.","actionTimeStamp":"Thu, 26 Jan 2023 20:44:21 -0500"},{"index":42,"header":"--","actionItem":"An amendment, offered by Mr. Quigley,  numbered 125 printed in the Congressional Record to change the date of enactment to be the date on which the Secretary certified that Russia's invasion of Ukraine has ended.","actionTimeStamp":"Thu, 26 Jan 2023 20:43:34 -0500"},{"index":43,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Cicilline amendment No. 135, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Armstrong demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 20:42:17 -0500"},{"index":44,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Cicilline amendment No. 135 under the five-minute rule. Pending the reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 20:39:19 -0500"},{"index":45,"header":"--","actionItem":"An amendment, offered by Mr. Cicilline,  numbered 135 printed in the Congressional Record to add additional limitations to the plan.","actionTimeStamp":"Thu, 26 Jan 2023 20:38:50 -0500"},{"index":46,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Vasquez amendment No. 64, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Vasquez demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 20:38:18 -0500"},{"index":47,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Vasquez amendment No. 64 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 20:35:51 -0500"},{"index":48,"header":"--","actionItem":"An amendment, offered by Mr. Vasquez,  numbered 64 printed in the Congressional Record to strike all after the enacting clause and insert a section titled Domestic Oil and Gas for the SPR.","actionTimeStamp":"Thu, 26 Jan 2023 20:35:22 -0500"},{"index":49,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Vasquez amendment No. 63, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Vasquez demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 20:34:20 -0500"},{"index":50,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Vasquez amendment No. 63 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 20:31:42 -0500"},{"index":51,"header":"--","actionItem":"An amendment, offered by Mr. Vasquez,  numbered 63 printed in the Congressional Record to add at the end of the bill an effective date section stating that it shall not take effect until the Secretary of Energy, in consultation with the Secretary of the Interior, publishes a report on the number, location, and owner of all unused permits to drill for oil and gas on Federal land.","actionTimeStamp":"Thu, 26 Jan 2023 20:30:21 -0500"},{"index":52,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Porter amendment No. 45, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Porter demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 20:30:11 -0500"},{"index":53,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Porter amendment No. 45 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 20:26:12 -0500"},{"index":54,"header":"--","actionItem":"An amendment, offered by Ms. Porter,  numbered 45 printed in the Congressional Record to provide that the plan shall not provide financial benefit to any entity which is allowed any allowance for depletion which is determined under section 613 of the Internal Revenue Code of 1986.","actionTimeStamp":"Thu, 26 Jan 2023 20:26:09 -0500"},{"index":55,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Lee (NV) amendment No. 25, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mrs. Lee (NV) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 20:25:01 -0500"},{"index":56,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Lee (NV) amendment No. 25 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 20:20:36 -0500"},{"index":57,"header":"--","actionItem":"An amendment, offered by Mrs. Lee (NV),  numbered 25 printed in the Congressional Record to add a new subsection within paragraph (2) to increase in Federal lands described in paragraph (1) that have no or low potential for oil and gas development.","actionTimeStamp":"Thu, 26 Jan 2023 20:20:04 -0500"},{"index":58,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Scholten amendment No. 60, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Weber (TX) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 20:18:49 -0500"},{"index":59,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Scholten amendment No. 60 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 20:15:16 -0500"},{"index":60,"header":"--","actionItem":"An amendment, offered by Ms. Scholten,  numbered 60 printed in the Congressional Record to insert language stating that if the Secretary determines a situation exists in which a delay in executing a drawdown of petroleum products in the Reserve in order to comply with paragraph (1) with increase gas prices.","actionTimeStamp":"Thu, 26 Jan 2023 20:15:13 -0500"},{"index":61,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Manning amendment No. 27, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Manning demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 20:13:42 -0500"},{"index":62,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Manning amendment No. 27 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 20:10:52 -0500"},{"index":63,"header":"--","actionItem":"An amendment, offered by Ms. Manning,  numbered 27 printed in the Congressional Record to exclude the submerged lands of the Outer Continental Shelf from the plan.","actionTimeStamp":"Thu, 26 Jan 2023 20:10:51 -0500"},{"index":64,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Schneider amendment No. 131, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Schneider demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 20:10:12 -0500"},{"index":65,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Schneider amendment No. 131 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 20:07:03 -0500"},{"index":66,"header":"--","actionItem":"An amendment, offered by Mr. Schneider,  numbered 131 printed in the Congressional Record to exclude oil and gas leasing in the Great Lakes from the plan.","actionTimeStamp":"Thu, 26 Jan 2023 20:07:01 -0500"},{"index":67,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Wasserman Schultz amendment No. 75, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Wasserman Schultz demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 20:06:28 -0500"},{"index":68,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Wasserman Schultz amendment No. 75 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 20:03:10 -0500"},{"index":69,"header":"--","actionItem":"An amendment, offered by Ms. Wasserman Schultz,  numbered 75 printed in the Congressional Record to exclude the Big Cypress National Reserve.","actionTimeStamp":"Thu, 26 Jan 2023 20:02:50 -0500"},{"index":70,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Casten amendment No. 68, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Casten demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 20:02:08 -0500"},{"index":71,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Casten amendment No. 68 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 19:59:37 -0500"},{"index":72,"header":"--","actionItem":"An amendment, offered by Mr. Casten,  numbered 68 printed in the Congressional Record to remove the word \"gas\" from the leasing of oil and gas production.","actionTimeStamp":"Thu, 26 Jan 2023 19:59:35 -0500"},{"index":73,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Casten amendment No. 67, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Casten demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 19:58:50 -0500"},{"index":74,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Casten amendment No. 67 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 19:54:38 -0500"},{"index":75,"header":"--","actionItem":"An amendment, offered by Mr. Casten,  numbered 67 printed in the Congressional Record to make sundry amendments to the bill.","actionTimeStamp":"Thu, 26 Jan 2023 19:54:36 -0500"},{"index":76,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Casten amendment No. 66, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Weber (TX) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 19:53:35 -0500"},{"index":77,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Casten amendment No. 66 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 19:48:32 -0500"},{"index":78,"header":"--","actionItem":"An amendment, offered by Mr. Casten,  numbered 66 printed in the Congressional Record to make sundry amendments to the bill and add a subparagraph titled \"Participation by Fossil Industry Entities\".","actionTimeStamp":"Thu, 26 Jan 2023 19:48:30 -0500"},{"index":79,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Ross amendment No. 70, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Ross demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 19:47:41 -0500"},{"index":80,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Ross amendment No. 70 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 19:43:50 -0500"},{"index":81,"header":"--","actionItem":"An amendment, offered by Ms. Ross,  numbered 70 printed in the Congressional Record to add an exclusion paragraph stating that the plan in paragraph (1) shall not include any tracts where oil or gas production would harass or take a North Atlantic Right Whale.","actionTimeStamp":"Thu, 26 Jan 2023 19:43:47 -0500"},{"index":82,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Jackson Lee amendment No. 36, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Jackson Lee demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 19:42:47 -0500"},{"index":83,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Jackson Lee amendment No. 36 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 19:37:10 -0500"},{"index":84,"header":"--","actionItem":"An amendment, offered by Ms. Jackson Lee,  numbered 36 printed in the Congressional Record to add a paragraph within Section 2 that paragraph (1) shall not take effect until the Secretary submits to Congress a report on the necessity of acting under the authority of this section to refill the Reserve.","actionTimeStamp":"Thu, 26 Jan 2023 19:37:07 -0500"},{"index":85,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Jackson Lee amendment No. 35, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Jackson Lee demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 19:36:35 -0500"},{"index":86,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Jackson Lee amendment No. 35 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 19:30:33 -0500"},{"index":87,"header":"--","actionItem":"An amendment, offered by Ms. Jackson Lee,  numbered 35 printed in the Congressional Record to include additional language excluding instances when the Secretary may not execute the first drawdown of petroleum products in the Reserve and changes the effective date of the bill.","actionTimeStamp":"Thu, 26 Jan 2023 19:30:31 -0500"},{"index":88,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Ocasio-Cortez amendment No. 73, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Ocasio-Cortez demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 19:29:41 -0500"},{"index":89,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Ocasio-Cortez amendment No. 73 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 19:25:31 -0500"},{"index":90,"header":"--","actionItem":"An amendment, offered by Ms. Ocasio-Cortez,  numbered 73 printed in the Congressional Record to limit the plan where oil and gas leasing would be inconsistent with the goals of the Paris Climate Accords.","actionTimeStamp":"Thu, 26 Jan 2023 19:25:29 -0500"},{"index":91,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Ocasio-Cortez amendment No. 72, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Ocasio-Cortez demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 19:24:51 -0500"},{"index":92,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Ocasio-Cortez amendment No. 72 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 19:19:22 -0500"},{"index":93,"header":"--","actionItem":"An amendment, offered by Ms. Ocasio-Cortez,  numbered 72 printed in the Congressional Record to limit the plan that, if leased for oil and gas production, to not increasing net carbon emissions.","actionTimeStamp":"Thu, 26 Jan 2023 19:19:19 -0500"},{"index":94,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Ocasio-Cortez amendment No. 74, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Ocasio-Cortez demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 19:18:50 -0500"},{"index":95,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Ocasio-Cortez amendment No. 74 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 19:16:04 -0500"},{"index":96,"header":"--","actionItem":"An amendment, offered by Ms. Ocasio-Cortez,  numbered 74 printed in the Congressional Record to limit the plan to include the lease of any land for oil or gas production to a company that has purchased an equity security of the company listed on a national securities exchange.","actionTimeStamp":"Thu, 26 Jan 2023 19:15:30 -0500"},{"index":97,"header":"--","actionItem":"Mr. Duncan raised a point of order against the Goldman (NY) amendment. Mr. Duncan stated that the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. The Chair sustained the point of order.","actionTimeStamp":"Thu, 26 Jan 2023 19:12:21 -0500"},{"index":98,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Goldman (NY) amendment No. 16 under the five-minute rule, pending a reservation of a point of order.","actionTimeStamp":"Thu, 26 Jan 2023 19:09:29 -0500"},{"index":99,"header":"--","actionItem":"An amendment, offered by Mr. Goldman (NY),  numbered 16 printed in the Congressional Record to add certification language to the bill.","actionTimeStamp":"Thu, 26 Jan 2023 19:09:14 -0500"},{"index":100,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Magaziner amendment No. 58, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Magaziner demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 19:08:19 -0500"},{"index":101,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Magaziner amendment No. 58 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 19:05:10 -0500"},{"index":102,"header":"--","actionItem":"An amendment, offered by Mr. Magaziner,  numbered 58 printed in the Congressional Record to insert a new effective date of paragraph (1) to not take effect until the date on which the Secretary determines that implementation of paragraph (1) will not negatively affect consumers homes that are heated using heating oil or other petroleum-based fuels.","actionTimeStamp":"Thu, 26 Jan 2023 19:04:45 -0500"},{"index":103,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Magaziner amendment No. 59, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Magaziner demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 19:04:09 -0500"},{"index":104,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Magaziner amendment No. 59 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 18:59:30 -0500"},{"index":105,"header":"--","actionItem":"An amendment, offered by Mr. Magaziner,  numbered 59 printed in the Congressional Record to exclude anything in section 2 from being construed as an impact to the authority of the President or Secretary of Energy to initiate a drawdown of petroleum products from the Reserve in order to lower gas prices.","actionTimeStamp":"Thu, 26 Jan 2023 18:59:06 -0500"},{"index":106,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Payne amendment No. 76, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Payne demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 18:58:24 -0500"},{"index":107,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Payne amendment No. 76 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 18:54:42 -0500"},{"index":108,"header":"--","actionItem":"An amendment, offered by Mr. Payne,  numbered 76 printed in the Congressional Record to add a new section at the end Rule of Construction with Respect to Environmental Justice relating to communities of color and low-wealth communities which face the greatest harms due to climate change and greenhouse gas emissions.","actionTimeStamp":"Thu, 26 Jan 2023 18:54:00 -0500"},{"index":109,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Lee (CA) amendment No. 84, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Lee (CA) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 18:53:09 -0500"},{"index":110,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Lee (CA) amendment No. 84 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 18:47:58 -0500"},{"index":111,"header":"--","actionItem":"An amendment, offered by Ms. Lee (CA),  numbered 84 printed in the Congressional Record to add a new paragraph titled Effective Date, stating that the plan will take effect on the date the Secretary certifies that any increase in the percentage of Federal lands leased for oil and gas production would not perpetuate environmental injustice.","actionTimeStamp":"Thu, 26 Jan 2023 18:47:27 -0500"},{"index":112,"header":"On agreeing to the Garcia, Robert amendment; Failed by recorded vote: 199","actionItem":"230 (Roll no. 60).","actionTimeStamp":"Thu, 26 Jan 2023 18:41:32 -0500"},{"index":113,"header":"On agreeing to the Cohen amendment; Failed by recorded vote: 199","actionItem":"232 (Roll no. 59).","actionTimeStamp":"Thu, 26 Jan 2023 18:37:14 -0500"},{"index":114,"header":"On agreeing to the Gottheimer amendment; Agreed to by recorded vote: 418","actionItem":"12 (Roll no. 58).","actionTimeStamp":"Thu, 26 Jan 2023 18:34:26 -0500"},{"index":115,"header":"On agreeing to the Gottheimer amendment; Agreed to by recorded vote: 419","actionItem":"13 (Roll no. 57).","actionTimeStamp":"Thu, 26 Jan 2023 18:31:47 -0500"},{"index":116,"header":"On agreeing to the Torres (CA) amendment; Failed by recorded vote: 204","actionItem":"228 (Roll no. 56).","actionTimeStamp":"Thu, 26 Jan 2023 18:28:20 -0500"},{"index":117,"header":"On agreeing to the DeGette amendment; Failed by recorded vote: 212","actionItem":"220 (Roll no. 55).","actionTimeStamp":"Thu, 26 Jan 2023 18:25:26 -0500"},{"index":118,"header":"On agreeing to the Grijalva amendment; Failed by recorded vote: 197","actionItem":"235 (Roll no. 54).","actionTimeStamp":"Thu, 26 Jan 2023 18:22:35 -0500"},{"index":119,"header":"On agreeing to the Grijalva amendment; Failed by recorded vote: 213","actionItem":"219 (Roll no. 53).","actionTimeStamp":"Thu, 26 Jan 2023 18:19:28 -0500"},{"index":120,"header":"On agreeing to the Grijalva amendment; Failed by recorded vote: 213","actionItem":"219 (Roll no. 52).","actionTimeStamp":"Thu, 26 Jan 2023 18:16:29 -0500"},{"index":121,"header":"On agreeing to the Levin amendment; Failed by recorded vote: 210","actionItem":"222 (Roll no. 51).","actionTimeStamp":"Thu, 26 Jan 2023 18:13:30 -0500"},{"index":122,"header":"On agreeing to the DelBene amendment; Failed by recorded vote: 213","actionItem":"219 (Roll no. 50).","actionTimeStamp":"Thu, 26 Jan 2023 18:10:44 -0500"},{"index":123,"header":"On agreeing to the Levin amendment; Failed by recorded vote: 213","actionItem":"218 (Roll no. 49).","actionTimeStamp":"Thu, 26 Jan 2023 18:07:13 -0500"},{"index":124,"header":"On agreeing to the Panetta amendment; Failed by recorded vote: 213","actionItem":"218 (Roll no. 48).","actionTimeStamp":"Thu, 26 Jan 2023 18:04:27 -0500"},{"index":125,"header":"On agreeing to the Huffman amendment; Failed by recorded vote: 205","actionItem":"225 (Roll no. 47).","actionTimeStamp":"Thu, 26 Jan 2023 18:01:36 -0500"},{"index":126,"header":"On agreeing to the Huffman amendment; Failed by recorded vote: 212","actionItem":"218 (Roll no. 46).","actionTimeStamp":"Thu, 26 Jan 2023 17:58:42 -0500"},{"index":127,"header":"On agreeing to the Spanberger amendment; Failed by recorded vote: 213","actionItem":"218 (Roll no. 45).","actionTimeStamp":"Thu, 26 Jan 2023 17:55:37 -0500"},{"index":128,"header":"On agreeing to the Boebert amendment; Agreed to by recorded vote: 220","actionItem":"212 (Roll no. 44).","actionTimeStamp":"Thu, 26 Jan 2023 17:52:20 -0500"},{"index":129,"header":"On agreeing to the Soto amendment; Failed by recorded vote: 213","actionItem":"218 (Roll no. 43).","actionTimeStamp":"Thu, 26 Jan 2023 17:49:13 -0500"},{"index":130,"header":"On agreeing to the Greene (GA) amendment; Failed by recorded vote: 14","actionItem":"418 (Roll no. 42).","actionTimeStamp":"Thu, 26 Jan 2023 17:46:05 -0500"},{"index":131,"header":"On agreeing to the Mace amendment; Agreed to by recorded vote: 389","actionItem":"42 (Roll no. 41).","actionTimeStamp":"Thu, 26 Jan 2023 17:42:24 -0500"},{"index":132,"header":"On agreeing to the Pallone amendment; Failed by recorded vote: 214","actionItem":"219 (Roll no. 40).","actionTimeStamp":"Thu, 26 Jan 2023 17:39:08 -0500"},{"index":133,"header":"On agreeing to the Castor (FL) amendment; Failed by recorded vote: 214","actionItem":"219 (Roll no. 39).","actionTimeStamp":"Thu, 26 Jan 2023 17:35:50 -0500"},{"index":134,"header":"On agreeing to the Blunt Rochester amendment; Failed by recorded vote: 213","actionItem":"218 (Roll no. 38).","actionTimeStamp":"Thu, 26 Jan 2023 17:31:18 -0500"},{"index":135,"header":"On agreeing to the Tlaib amendment; Failed by recorded vote: 205","actionItem":"220 (Roll no. 37).","actionTimeStamp":"Thu, 26 Jan 2023 17:27:46 -0500"},{"index":136,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Robert Garcia (CA) amendment No.53, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Carter (GA) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 16:58:41 -0500"},{"index":137,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Robert Garcia (CA) amendment No. 53 under the five-minute rule, pending a reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 16:55:37 -0500"},{"index":138,"header":"--","actionItem":"An amendment, offered by Mr. Garcia, Robert,  numbered 53 printed in the Congressional Record to insert a new effective date of paragraph (1) to not take effect until a certification is submitted to Congress that any increase in the percentage of Federal lands leased for oil and gas production will not result in an increase in greenhouse gas emissions.","actionTimeStamp":"Thu, 26 Jan 2023 16:55:03 -0500"},{"index":139,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Cohen amendment No. 129, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Cohen demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 16:54:28 -0500"},{"index":140,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Cohen amendment No. 129 under the five-minute rule, pending a reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 16:50:26 -0500"},{"index":141,"header":"--","actionItem":"An amendment, offered by Mr. Cohen,  numbered 129 printed in the Congressional Record to add additional limitations to the plan.","actionTimeStamp":"Thu, 26 Jan 2023 16:50:24 -0500"},{"index":142,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Gottheimer amendment No. 86, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Carter (GA) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 16:49:42 -0500"},{"index":143,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Gottheimer amendment No. 86 under the five-minute rule, pending a reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 16:45:40 -0500"},{"index":144,"header":"--","actionItem":"An amendment, offered by Mr. Gottheimer,  numbered 86 printed in the Congressional Record to require the Secretary to consult with certain Secretaries about the plan and ensure such plan will not result in the sale of petroleum products drawn down from the Reserve to Iran, China, North Korea, or Russia.","actionTimeStamp":"Thu, 26 Jan 2023 16:45:37 -0500"},{"index":145,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Gottheimer amendment No. 85, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Gottheimer demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 16:45:15 -0500"},{"index":146,"header":"--","actionItem":"Mr. Carter (GA) raised a point of order against the Gottheimer amendment. Mr. Carter (GA) stated that the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. Point of order overruled by the Chair.","actionTimeStamp":"Thu, 26 Jan 2023 16:43:29 -0500"},{"index":147,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Gottheimer amendment No. 85 under the five-minute rule, pending a reservation of a point of order.","actionTimeStamp":"Thu, 26 Jan 2023 16:41:48 -0500"},{"index":148,"header":"--","actionItem":"An amendment, offered by Mr. Gottheimer,  numbered 85 printed in the Congressional Record to add sundry amendments to the bill.","actionTimeStamp":"Thu, 26 Jan 2023 16:41:21 -0500"},{"index":149,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Torres (CA) amendment No. 50, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mrs. Torres (CA) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 16:41:06 -0500"},{"index":150,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Torres (CA) amendment No. 50 under the five-minute rule, pending a reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 16:36:03 -0500"},{"index":151,"header":"--","actionItem":"An amendment, offered by Mrs. Torres (CA),  numbered 50 printed in the Congressional Record to change the effective date to be the date the Secretary certifies that the oil and gas leasing on Federal lands is necessary to replenish the Strategic Petroleum Reserve to the amount held on February 23, 2022.","actionTimeStamp":"Thu, 26 Jan 2023 16:35:15 -0500"},{"index":152,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the DeGette amendment No. 89, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. DeGette demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 16:34:18 -0500"},{"index":153,"header":"--","actionItem":"Mr. Walberg raised a point of order against the DeGette amendment. Mr. Walberg raised a point of order against the DeGette amendment. Mr. Walberg stated that the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. Point of order overruled by the Chair.","actionTimeStamp":"Thu, 26 Jan 2023 16:31:42 -0500"},{"index":154,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the DeGette amendment No. 89 under the five-minute rule, pending a reservation of a point of order.","actionTimeStamp":"Thu, 26 Jan 2023 16:27:44 -0500"},{"index":155,"header":"--","actionItem":"An amendment, offered by Ms. DeGette,  numbered 89 printed in the Congressional Record to add a new subparagraph only allowing for a lease or permit if accompanied by a certification to the Secretary that it would not excessively increase the sales price of any petroleum products during a severe energy supply interruption or any period of decreased supply of petroleum products.","actionTimeStamp":"Thu, 26 Jan 2023 16:27:06 -0500"},{"index":156,"header":"--","actionItem":"Mr. Walberg raised a point of order against the Thompson (CA) amendment. Mr. Walberg stated that the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. The Chair sustained the point of order.","actionTimeStamp":"Thu, 26 Jan 2023 16:24:52 -0500"},{"index":157,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Thompson (CA) amendment No. 23 under the five-minute rule, pending a reservation of a point of order.","actionTimeStamp":"Thu, 26 Jan 2023 16:22:11 -0500"},{"index":158,"header":"--","actionItem":"An amendment, offered by Mr. Thompson (CA),  numbered 23 printed in the Congressional Record to change the short title to Strategic Production and Conservation Response Act and add conservation requirements to the plan.","actionTimeStamp":"Thu, 26 Jan 2023 16:21:43 -0500"},{"index":159,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Grijalva amendment No. 57, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Grijalva demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 16:20:47 -0500"},{"index":160,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Grijalva amendment No. 57 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 16:18:16 -0500"},{"index":161,"header":"--","actionItem":"An amendment, offered by Mr. Grijalva,  numbered 57 printed in the Congressional Record to exclude oil and gas leasing on any Federal lands that are viable for renewable energy production from the plan required in paragraph (1).","actionTimeStamp":"Thu, 26 Jan 2023 16:17:33 -0500"},{"index":162,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Grijalva amendment No. 56, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Grijalva demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 16:17:19 -0500"},{"index":163,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Grijalva amendment No. 56 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 16:15:02 -0500"},{"index":164,"header":"--","actionItem":"An amendment, offered by Mr. Grijalva,  numbered 56 printed in the Congressional Record to exclude any oil and gas leasing on any Federal land where oil and gas leasing would result in or exacerbate disproportionate burdens on certain communities from the plan required by paragraph (1).","actionTimeStamp":"Thu, 26 Jan 2023 16:14:30 -0500"},{"index":165,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Grijalva amendment No. 55, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Grijalva demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 16:14:12 -0500"},{"index":166,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Grijalva amendment No. 55 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 16:11:50 -0500"},{"index":167,"header":"--","actionItem":"An amendment, offered by Mr. Grijalva,  numbered 55 printed in the Congressional Record to add a new paragraph at the end of the bill requiring a plan to consult with Tribal governments and other government officials to be included in the plan required by paragraph (1).","actionTimeStamp":"Thu, 26 Jan 2023 16:11:04 -0500"},{"index":168,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Grijalva amendment No. 55, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Levin demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 16:10:04 -0500"},{"index":169,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Levin amendment No. 21 under the five-minute rule, pending a reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 16:07:36 -0500"},{"index":170,"header":"--","actionItem":"An amendment, offered by Mr. Levin,  numbered 21 printed in the Congressional Record to limit Federal land from the plan if it would not provide a fair return taxpayers.","actionTimeStamp":"Thu, 26 Jan 2023 16:07:34 -0500"},{"index":171,"header":"--","actionItem":"Mr. Pallone raised a point of order against the Barr amendment. Mr. Pallone raised a point of order against the Barr amendment. Mr. Pallone stated that the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. The Chair sustained the point of order.","actionTimeStamp":"Thu, 26 Jan 2023 16:04:12 -0500"},{"index":172,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Barr amendment No. 48 under the five-minute rule, pending the reservation of a point of order.","actionTimeStamp":"Thu, 26 Jan 2023 15:59:28 -0500"},{"index":173,"header":"--","actionItem":"An amendment, offered by Mr. Barr,  numbered 48 printed in the Congressional Record to add a new section at the end of the bill Temporary Suspension of Certain Financial Regulations to limit access to financing for oil and gas companies until the date the amount of petroleum products in the Strategic Petroleum Reserve is equal to or greater than the amount on the day before the drawdown.","actionTimeStamp":"Thu, 26 Jan 2023 15:59:11 -0500"},{"index":174,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the DelBene amendment No. 7, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. DelBene demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 15:58:13 -0500"},{"index":175,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the DelBene amendment No. 7 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 15:52:53 -0500"},{"index":176,"header":"--","actionItem":"An amendment, offered by Ms. DelBene,  numbered 7 printed in the Congressional Record to add a new paragraph within section 2 excluding oil and gas leasing in any tract located in the Washington/Oregon planning area.","actionTimeStamp":"Thu, 26 Jan 2023 15:52:05 -0500"},{"index":177,"header":"POSTONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Levin amendment No. 18, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Levin demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 15:51:33 -0500"},{"index":178,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Levin amendment No. 18 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 15:47:36 -0500"},{"index":179,"header":"--","actionItem":"An amendment, offered by Mr. Levin,  numbered 18 printed in the Congressional Record to exclude oil and gas leasing in any tract located in the Southern California planning area.","actionTimeStamp":"Thu, 26 Jan 2023 15:47:03 -0500"},{"index":180,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Panetta amendment No. 26, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Panetta demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 15:46:28 -0500"},{"index":181,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Panetta amendment No. 26 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 15:42:23 -0500"},{"index":182,"header":"--","actionItem":"An amendment, offered by Mr. Panetta,  numbered 26 printed in the Congressional Record to add a new paragraph, Offshore Exclusions, which shall not include oil and gas leasing in any tract located in the Central California planning area.","actionTimeStamp":"Thu, 26 Jan 2023 15:42:09 -0500"},{"index":183,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Huffman amendment No. 65, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Huffman demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 15:41:23 -0500"},{"index":184,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Huffman amendment No. 15 under the five-minute rule, pending the reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 15:37:35 -0500"},{"index":185,"header":"--","actionItem":"An amendment, offered by Mr. Huffman,  numbered 65 printed in the Congressional Record to exclude any tract of Federal land where oil and gas leasing would decrease land and water available for outdoor recreation from the total increase in the percentage of Federal lands described in paragraph (1) leased for oil and gas production.","actionTimeStamp":"Thu, 26 Jan 2023 15:36:42 -0500"},{"index":186,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Huffman amendment No. 15, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Huffman demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 15:36:08 -0500"},{"index":187,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Huffman amendment No. 15 under the five-minute rule, pending the reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 15:32:27 -0500"},{"index":188,"header":"--","actionItem":"An amendment, offered by Mr. Huffman,  numbered 15 printed in the Congressional Record to add a new paragraph, Offshore Exclusions which shall not include oil and gas leasing in any tract located in the Northern California planning area.","actionTimeStamp":"Thu, 26 Jan 2023 15:32:02 -0500"},{"index":189,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Tlaib amendment No. 11, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Tlaib demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 15:31:20 -0500"},{"index":190,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Tlaib amendment No. 11 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 15:29:34 -0500"},{"index":191,"header":"--","actionItem":"An amendment, offered by Ms. Tlaib,  numbered 11 printed in the Congressional Record to add the Administrator of the Environmental Protection Agency and the Council on Environmental Quality to the list of officials to be consulted in the Compensatory Production Increase Plan.","actionTimeStamp":"Thu, 26 Jan 2023 15:29:18 -0500"},{"index":192,"header":"--","actionItem":"On agreeing to the Perry amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 15:28:43 -0500"},{"index":193,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Perry amendment No. 41 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 15:22:37 -0500"},{"index":194,"header":"--","actionItem":"An amendment, offered by Mr. Perry,  numbered 41 printed in the Congressional Record to add a paragraph at the end of the bill that the plan required by paragraph (1) shall include a list of parcels planned to be offered for lease.","actionTimeStamp":"Thu, 26 Jan 2023 15:22:20 -0500"},{"index":195,"header":"--","actionItem":"Mr. Johnson (OH) raised a point of order against the Tlaib amendment. Mr. Johnson stated that the provisions of the amendment exceeds the scope of the bill and the amendment is therefore, not germane. The Chair sustained the point of order.","actionTimeStamp":"Thu, 26 Jan 2023 15:20:16 -0500"},{"index":196,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Tlaib amendment No. 10 under the five-minute rule, pending a reservation of a point of order.","actionTimeStamp":"Thu, 26 Jan 2023 15:19:09 -0500"},{"index":197,"header":"--","actionItem":"An amendment, offered by Ms. Tlaib,  numbered 10 printed in the Congressional Record to add a new paragraph within section 2 titled \"Environmental Reviews\".","actionTimeStamp":"Thu, 26 Jan 2023 15:19:06 -0500"},{"index":198,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 15:18:49 -0500"},{"index":199,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Boebert amendment No. 137 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 15:11:39 -0500"},{"index":200,"header":"--","actionItem":"An amendment, offered by Mrs. Boebert,  numbered 137 printed in the Congressional Record to add a paragraph that the Secretary shall identify areas to lease within the approximately 224,793.73 acres, including approximately 200,518.28 acres of National Forest System lands, approximately 15,464.99 acres of public lands, and approximately 8,810.46 acres of reserved Federal mineral interest within the Thompson Divide area in Colorado.","actionTimeStamp":"Thu, 26 Jan 2023 15:11:36 -0500"},{"index":201,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Spanberger amendment No. 29, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Spanberger demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 15:11:07 -0500"},{"index":202,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Spanberger amendment No. 29 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 15:06:21 -0500"},{"index":203,"header":"--","actionItem":"An amendment, offered by Ms. Spanberger,  numbered 29 printed in the Congressional Record to add a new paragraph entitled Offshore Exclusion which shall not include oil and gas leasing in any tract located off the coast of Virginia.","actionTimeStamp":"Thu, 26 Jan 2023 15:05:58 -0500"},{"index":204,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Boebert amendment No. 33, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Pallone demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 15:05:15 -0500"},{"index":205,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Boebert amendment No. 33 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 14:56:34 -0500"},{"index":206,"header":"--","actionItem":"An amendment, offered by Mrs. Boebert,  numbered 33 printed in the Congressional Record to reduce the 10 percent leased for oil and gas production and increase it to 15 percent.","actionTimeStamp":"Thu, 26 Jan 2023 14:56:33 -0500"},{"index":207,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Soto amendment No. 44, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Soto demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 14:56:03 -0500"},{"index":208,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Soto amendment No. 44 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 14:52:00 -0500"},{"index":209,"header":"--","actionItem":"An amendment, offered by Mr. Soto,  numbered 44 printed in the Congressional Record to change the effective date to be the date the Secretary submits a certification to Congress that the price of gasoline and diesel fuel will not increase in any Petroleum Administration for Defense District.","actionTimeStamp":"Thu, 26 Jan 2023 14:51:39 -0500"},{"index":210,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 14:51:19 -0500"},{"index":211,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Boebert amendment No. 32 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 14:47:20 -0500"},{"index":212,"header":"--","actionItem":"An amendment, offered by Mrs. Boebert,  numbered 32 printed in the Congressional Record to add a new paragraph stating the Secretaries of various agencies shall submit to certain committees in Congress plans for Federal lands.","actionTimeStamp":"Thu, 26 Jan 2023 14:47:17 -0500"},{"index":213,"header":"--","actionItem":"On agreeing to the Cleaver amendment; Failed by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 14:46:58 -0500"},{"index":214,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Cleaver amendment No. 9 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 14:43:37 -0500"},{"index":215,"header":"--","actionItem":"An amendment, offered by Mr. Cleaver,  numbered 9 printed in the Congressional Record to add an additional limitation to when the Secretary may execute the first drawdown of petroleum products in the reserve.","actionTimeStamp":"Thu, 26 Jan 2023 14:43:34 -0500"},{"index":216,"header":"--","actionItem":"On agreeing to the Clyde amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 14:42:47 -0500"},{"index":217,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Clyde amendment No. 91 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 14:40:40 -0500"},{"index":218,"header":"--","actionItem":"An amendment, offered by Mr. Clyde,  numbered 91 printed in the Congressional Record to insert language stating the Secretary submit the developed plans to Congress.","actionTimeStamp":"Thu, 26 Jan 2023 14:40:37 -0500"},{"index":219,"header":"--","actionItem":"On agreeing to the Cleaver amendment; Failed by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 14:40:15 -0500"},{"index":220,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Cleaver amendment No. 8 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 14:37:45 -0500"},{"index":221,"header":"--","actionItem":"An amendment, offered by Mr. Cleaver,  numbered 8 printed in the Congressional Record to add the Administrator of the Environmental Protection Agency and Director of the Bureau of Indian Affairs to the list of officials to be consulted in the Compensatory Production Increase Plan.","actionTimeStamp":"Thu, 26 Jan 2023 14:37:42 -0500"},{"index":222,"header":"--","actionItem":"On agreeing to the LaLota amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 14:37:00 -0500"},{"index":223,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the LaLota amendment No. 143 under the five-minute rule, pending a reservation of a point of order, pending a reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 14:34:46 -0500"},{"index":224,"header":"--","actionItem":"An amendment, offered by Mr. LaLota,  numbered 143 printed in the Congressional Record to add a new section at the end of the bill titled No Effect on Existing Leasing Restrictions.","actionTimeStamp":"Thu, 26 Jan 2023 14:34:44 -0500"},{"index":225,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Blunt Rochester amendment No. 71, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Blunt Rochester demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 14:33:51 -0500"},{"index":226,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Blunt Rochester amendment No. 71 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 14:30:25 -0500"},{"index":227,"header":"--","actionItem":"An amendment, offered by Ms. Blunt Rochester,  numbered 71 printed in the Congressional Record to add a new section at the end Rule of Construction with Respect to Greenhouse Gas Emissions to provide that this Act not controvert United States commitment under the Paris Agreement.","actionTimeStamp":"Thu, 26 Jan 2023 14:30:18 -0500"},{"index":228,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Greene (GA) amendment No. 2, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Pallone demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 14:29:46 -0500"},{"index":229,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Greene (GA) amendment No. 2 under the five-minute rule, pending a reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 14:19:06 -0500"},{"index":230,"header":"--","actionItem":"An amendment, offered by Mrs. Greene (GA),  numbered 2 printed in the Congressional Record to make a technical correction to section 2, Compensatory Production Increase Plan.","actionTimeStamp":"Thu, 26 Jan 2023 14:18:56 -0500"},{"index":231,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Castor (FL) amendment No. 3, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Ms. Castor (FL) demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 14:18:17 -0500"},{"index":232,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Castor (FL) amendment No. 3 under the five-minute rule, pending the reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 14:12:28 -0500"},{"index":233,"header":"--","actionItem":"An amendment, offered by Ms. Castor (FL),  numbered 3 printed in the Congressional Record to add a new paragraph within section 2 pertaining to offshore exclusions.","actionTimeStamp":"Thu, 26 Jan 2023 14:11:45 -0500"},{"index":234,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Mace amendment No. 133, the Chair put the question on adoption of the amendment and by voice vote, announced that the ayes had prevailed. Mr. Pallone demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 14:10:50 -0500"},{"index":235,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Mace amendment No. 133 under the five-minute rule, pending the reservation of a point of order. Subsequently, the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 14:06:59 -0500"},{"index":236,"header":"--","actionItem":"An amendment, offered by Ms. Mace,  numbered 133 printed in the Congressional Record to add a new section that nothing in this Act, shall affect any statutory or regulatory restrictions in effect on the date of enacment of this Act (including any withdrawal of Federal land) that may prohibit oil and gas leasing within the area designated as the South Atlantic Planning Area.","actionTimeStamp":"Thu, 26 Jan 2023 14:06:55 -0500"},{"index":237,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the Pallone amendment No. 104, the Chair put the question on adoption of the amendment and by voice vote, announced that the noes had prevailed. Mr. Pallone demanded a recorded vote and the Chair postponed further proceedings on the question of adoption of the amendment until a time to be announced.","actionTimeStamp":"Thu, 26 Jan 2023 14:05:53 -0500"},{"index":238,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Pallone amendment No. 104 under the five-minute rule, pending the reservation of a point of order. Subsequently the point of order was withdrawn.","actionTimeStamp":"Thu, 26 Jan 2023 14:01:17 -0500"},{"index":239,"header":"--","actionItem":"An amendment, offered by Mr. Pallone,  numbered 104 printed in the Congressional Record to add a paragraph Offshore Exclusions to exclude oil and gas leasing located in the North Atlantic Planning Area.","actionTimeStamp":"Thu, 26 Jan 2023 14:00:58 -0500"},{"index":240,"header":"--","actionItem":"On agreeing to the Gaetz amendment; Agreed to by voice vote.","actionTimeStamp":"Thu, 26 Jan 2023 14:00:19 -0500"},{"index":241,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 5, the Committee of the Whole proceeded with debate on the Gaetz amendment No. 1 under the five-minute rule.","actionTimeStamp":"Thu, 26 Jan 2023 13:53:02 -0500"},{"index":242,"header":"--","actionItem":"An amendment, offered by Mr. Gaetz,  numbered 1 printed in the Congressional Record to add a new section stating that nothing in the Act or amendments made by the Act shall affect the Presidential memorandum titled \"Memorandum on the Withdrawal of Certain Areas of the United States Outer Continental Shelf from Leasing Disposition\".","actionTimeStamp":"Thu, 26 Jan 2023 13:52:53 -0500"},{"index":243,"header":"GENERAL DEBATE","actionItem":"The Committee of the Whole proceeded with one hour of general debate on H.R. 21.","actionTimeStamp":"Thu, 26 Jan 2023 12:30:33 -0500"},{"index":244,"header":"--","actionItem":"The Speaker designated the Honorable David Rouzer to act as Chairman of the Committee.","actionTimeStamp":"Thu, 26 Jan 2023 12:29:37 -0500"},{"index":245,"header":"--","actionItem":"House resolved itself into the Committee of the Whole House on the state of the Union pursuant to H. Res. 5 and Rule XVIII.","actionTimeStamp":"Thu, 26 Jan 2023 12:29:35 -0500"},{"index":246,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 5. H.R. 21  \"To provide for the development of a plan to increase oil and gas production under oil and gas leases of Federal lands under the jurisdiction of the Secretary of Agriculture, the Secretary of Energy, the Secretary of the Interior, and the Secretary of Defense in conjunction with a drawdown of petroleum reserves from the Strategic Petroleum Reserve.\"","actionTimeStamp":"Thu, 26 Jan 2023 12:29:12 -0500"},{"index":247,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Thu, 26 Jan 2023 12:24:56 -0500"},{"index":248,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Thu, 26 Jan 2023 12:24:52 -0500"},{"index":249,"header":"--","actionItem":"Considered as privileged matter. H. Res. 60  \"Electing Members to a certain standing committee of the House of Representatives.\"","actionTimeStamp":"Thu, 26 Jan 2023 12:24:27 -0500"},{"index":250,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches which by direction of the Chair, would be limited to 15 per side of the aisle.","actionTimeStamp":"Thu, 26 Jan 2023 12:02:36 -0500"},{"index":251,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Wilson of SC to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 26 Jan 2023 12:02:16 -0500"},{"index":252,"header":"--","actionItem":"The Speaker announced approval of the Journal. Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Thu, 26 Jan 2023 12:02:05 -0500"},{"index":253,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Thu, 26 Jan 2023 12:00:39 -0500"},{"index":254,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of January 26.","actionTimeStamp":"Thu, 26 Jan 2023 12:00:27 -0500"},{"index":255,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Thu, 26 Jan 2023 11:19:27 -0500"},{"index":256,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Thu, 26 Jan 2023 10:00:17 -0500"},{"index":257,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 26 Jan 2023 10:00:00 -0500"}]}