{"retrieved-date":"2024-4-30","actions-date":"Tuesday, April 23, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Saturday, April 20, 2024,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Saturday, April 20, 2024, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, April 23)","actionItem":"H.R. 292 (Rep. Garcia):\n        A bill to designate the facility of the United States Postal Service located at 24355 Creekside Road in Santa Clarita, California, as the \"William L. Reynolds Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Motion by Senator Schumer to concur in the House amendment to the Senate amendment to H.R. 815.\n\n        -- Cloture motion on the motion to concur in the House amendment to the Senateamendment to H.R. 815 presented in Senate.\n\n        -- Motion by Senator Schumer to concur in the House amendment to the Senate amendment to H.R. 815 with an amendment (SA 1842) made in Senate.\n\n        -- Motion by Senator Schumer to refer to Senate Committee on Appropriations the House message to accompany H.R. 815 with instructions to report back forthwith with the following amendment (SA 1844) made in Senate.\n\n        -- Motion to table the motion to refer the House message to accompany H.R. 815to the Committee on Appropriations with instructions to report back forthwith with the following amendment (SA 1844) rejected in Senate by Yea-Nay Vote. 48 - 50. Record Vote Number: 151 \n\n\n        -- Cloture on the motion to concur in the House amendment to the Senate amendment to H.R. 815 invoked in Senate by Yea-Nay Vote. 80 - 19. Record Vote Number: 152 \n\n\n        -- Motion by Senator Schumer to refer to Senate Committee on Appropriations with instructions to report back forthwith with the following amendment (SA1844) fell when cloture was invoked on the motion to concur in the House amendment to the Senate amendment to H.R. 815 in Senate.\n\n        -- Point of order by Senator Lee pursuant to section 314(e) of the Congressional Budget Act of 1974 against the measure raised in Senate.\n\n        -- Motion to waive all applicable budgetary discipline with respect to the measure (the motion to concur in the House amendment to the Senate amendment) agreed to in Senate by Yea-Nay Vote. 75 - 20. Record Vote Number: 153 \n\n\n        -- Senate agreed to the House amendment to the Senate amendment to H.R. 815 byYea-Nay Vote. 79 - 18. Record Vote Number: 154 \n\n\n        -- Message on Senate action sent to the House.\n \n\n S.Amdt. 1842 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 1842 proposed by Senator Schumer.\n\n        --Proposed amendment SA 1842 withdrawn in Senate.\n\n\n S.Amdt. 1843 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 1843 proposed by Senator Schumer to Amendment SA 1842.\n\n        --SA 1843 fell when SA 1842 was withdrawn.\n\n\n S.Amdt. 1844 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 1844 proposed by Senator Schumer.\n\n        --SA 1844 fell when cloture invoked on the motion to concur in the House amendment to the Senate amendment to H.R. 815.\n\n\n S.Amdt. 1845 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 1845 proposed by Senator Schumer to Amendment SA 1844 (the instructions of the motion to refer).\n\n        --SA 1845 fell when SA 1844 (the instructions of the motion to refer) fell\n\n\n S.Amdt. 1846 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 1846 proposed by Senator Schumer to Amendment SA 1845.\n\n        --SA 1846 fell when SA 1845 fell.\n\n\n\n H.R. 996 (Rep. Carter):\n        A bill to designate the facility of the United States Postal Service located at 3901 MacArthur Blvd., in New Orleans, Louisiana, as the \"Dr. Rudy Lombard Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 2379 (Rep. Krishnamoorthi):\n        A bill to designate the facility of the United States Postal Service located at 616 East Main Street in St. Charles, Illinois, as the \"Veterans of the Vietnam War Memorial Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 2754 (Rep. Cuellar):\n        A bill to designate the facility of the United States Postal Service located at 2395 East Del Mar Boulevard in Laredo, Texas, as the \"Lance Corporal David Lee Espinoza, Lance Corporal Juan Rodrigo Rodriguez & Sergeant Roberto Arizola Jr. Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 3865 (Rep. Meuser):\n        A bill to designate the facility of the United States Postal Service located at 101 South 8th Street in Lebanon, Pennsylvania, as the \"Lieutenant William D. Lebo Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 3944 (Rep. Allen):\n        A bill to designate the facility of the United States Postal Service located at 120 West Church Street in Mount Vernon, Georgia, as the \"Second Lieutenant Patrick Palmer Calhoun Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 3947 (Rep. Bean):\n        A bill to designate the facility of the United States Postal Service located at 859 North State Road 21 in Melrose, Florida, as the \"Pamela Jane Rock Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 2143 (Sen. Rounds):\n        A bill to designate the facility of the United States Postal Service located at 320 South 2nd Avenue in Sioux Falls, SouthDakota, as the \"Staff Sergeant Robb Lura Rolfing Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 2274 (Sen. Barrasso):\n        A bill to designate the facility of the United States Postal Service located at 112 Wyoming Street in Shoshoni, Wyoming, as the \"Dessie A. Bebout Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 2717 (Sen. Braun):\n        A bill to designate the facility of the United States Postal Service located at 231 North Franklin Street in Greensburg, Indiana, as the \"Brigadier General John T. Wilder Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 3267 (Sen. Rounds):\n        A bill to designate the facility of the United States Postal Service located at 410 Dakota Avenue South in Huron, South Dakota, as the \"First Lieutenant Thomas Michael Martin Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 3357 (Sen. Casey):\n        A bill to designate the facility of the United States Postal Service located at 5120 Derry Street in Harrisburg, Pennsylvania, as the \"Hettie Simmons Love Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 3419 (Sen. Fetterman):\n        A bill to designate the facility of the United States Postal Service located at 1765 Camp Hill Bypass in Camp Hill, Pennsylvania, as the \"John Charles Traub Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 3639 (Sen. Peters):\n        A bill to designate the facility of the United States Postal Service located at 2075 West Stadium Boulevard in Ann Arbor, Michigan, as the \"Robert Hayden Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 3640 (Sen. Peters):\n        A bill to designate the facility of the United States Postal Service located at 155 South Main Street in Mount Clemens, Michigan, as the \"Lieutenant Colonel Alexander Jefferson Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 3851 (Sen. Peters):\n        A bill to designate the facility of the United States Postal Service located at 90 McCamly Street South in Battle Creek, Michigan, as the \"Sojourner Truth Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 661 (Sen. Manchin):\n        A resolution designating the week of April 15 through April 21, 2024, as \"National Osteopathic Medicine Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 662 (Sen. Schumer):\n        A resolution to authorize testimony, document production, and representation in United States of America v. Robert Menendez, et al.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 663 (Sen. Bennet):\n        A resolution commemorating the 25th anniversary ofthe Columbine High School shooting.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, April 23)","actionItem":"PN1458:\n        Georgia N. Alexakis, of Illinois, to be United States District Judge for the Northern District of Illinois\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  9:44 p.m., the Senate adjourned, under its order of today, until 10 a.m. on Friday, April 26, 2024.","actionTimeStamp":"--"}]}