{"retrieved-date":"2023-6-19","actions-date":"Thursday, June 15, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, June 15)","actionItem":"S.Res. 256 (Sen. Warnock):\n        A resolution recognizing Father's Day and the role of father engagement in improving the overall health and life outcomes for both the mother and baby.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 257 (Sen. Graham):\n        A resolution designating July 19, 2023, as \"Glioblastoma Awareness Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, June 15)","actionItem":"PN82:\n        Natasha C. Merle, of New York, to be United States District Judge for the Eastern District of New York\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN83:\n        Nusrat Jahan Choudhury, of New York, to be United States District Judge for the Eastern District of New York\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 164 \n\n\n\n PN90:\n        Julie Rikelman, of Massachusetts, to be United States Circuit Judge for the First Circuit\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 45. Record Vote Number: 165 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate 6/20/2023.\n\n\n Treaty Doc. 112-8:\n        The Convention between the Government of the United States of America and the Government of the Republic of Chile for the Avoidance of Double Taxation and the Prevention of Fiscal Evasion with Respect to Taxes on Income and Capital, signed in Washington on February 4, 2010, with a Protocol signed the same day, as corrected by exchanges of notes effected February 25, 2011, and February 10 and 21, 2012, and a related agreement effected by exchange of notes (the \"related Agreement\") on February 4, 2010\n\n        -- Motion to proceed to executive session to consideration of treaty agreed to in Senate by Voice Vote.\n\n        -- Treaty moved through its parliamentary stages up to and including presentation of the resolution of advice and consent to ratification.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  3:02 p.m, the Presiding Officer (Mr. Booker in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}