{"retrieved-date":"2025-7-2","actions-date":"Saturday, June 28, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the      proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday,      the morning hour being deemed expired, and the times for the recognition      of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today      .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Saturday, June 28)","actionItem":"H.R. 1 (Rep. Arrington):\n                A bill to provide for reconciliation pursuant to title II of H. Con. Res. 14.      \n\n        --        Read twice. Placed on Senate Legislative Calendar under General Orders.        Calendar No. 107.      \n\n        --        Motion to proceed to consideration of measure agreed to in Senate by        Yea-Nay Vote. 51 - 49. Record Vote Number:        329      \n\n         \n\n S.Amdt. 2360 (Sen. Graham):\n        In the nature of a substitute.\n\n        --            Amendment SA 2360 proposed by Senator Thune for Senator Graham.          \n\n        --            Point of order that the amendment violates section 313(b)(1)(E) of the            Congressional Budget Act raised in Senate with respect to amendment SA            2360.          \n\n        --            Ruling of the Chair that the point of order raised by Senator Thune with            respect to amendment SA 2360, is that unless the Budget Committee,            speaking through its chairman, asserts that the amendment causes a            violation of the Budget Act, the Chair will not so hold.          \n\n        --            Amendment SA 2360 ruled in order by the chair.          \n\n        --            Motion by Senator Schumer to appeal the ruling of the Chair that            amendment SA2360 is in order made in Senate.          \n\n        --      Amendment SA 2360 proposed by Senator Thune for Senator Graham.    \n\n        --      Point of order that the amendment violates section 313(b)(1)(E) of the      Congressional Budget Act raised in Senate with respect to amendment SA      2360.    \n\n        --      Ruling of the Chair that the point of order raised by Senator Thune with      respect to amendment SA 2360, is that unless the Budget Committee,      speaking through its chairman, asserts that the amendment causes a      violation of the Budget Act, the Chair will not so hold.    \n\n        --      Amendment SA 2360 ruled in order by the chair.    \n\n        --      Motion by Senator Schumer to appeal the ruling of the Chair that      amendment SA2360 is in order made in Senate.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Sunday, June 29)","actionItem":"PN34:\n                Adam J. Romnek, in the Marine Corps, to be Lieutenant Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN38:\n                Benjamin D. Kastning, in the Marine Corps, to be Lieutenant Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN52:\n                Matthew A. Beard, in the Marine Corps, to be Lieutenant Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN98:\n                30 nominations in the Army beginning with Camisha Q. Abattam and ending with Racheal L. Wood      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN99:\n                10 nominations in the Army beginning with David M.Boland and ending with Christopher W. Remillard      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN100:\n                52 nominations in the Army beginning with Harris A. Abbasi and ending with 0003080783      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN101:\n                13 nominations in the Army beginning with Jacob L.Barnoski and ending with Jonathan Shearer      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN103:\n                47 nominations in the Marine Corps beginning with Michael P. Abrams and ending with Jeremy K. Yamada      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN119:\n                44 nominations in the Air Force beginning with Alexander A. Adeleye and ending with Noah C. Wood      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN130:\n                228 nominations in the Air Force beginning with Sarahgrace R. Aglubat and ending with Casey L. Zoellick      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN131:\n                40 nominations in the Air Force beginning with Laura A. Abbott and ending with Anne L. Willey      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN133:\n                141 nominations in the Air Force beginning with Hugo D. Alarcon and ending with Nicholas J. Yielding      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN142:\n                15 nominations in the Army beginning with Daniel J. Bland and ending with Anna Maria Travis      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN143:\n                103 nominations in the Army beginning with Justin M. Adams and ending with 0002993837      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN144:\n                129 nominations in the Army beginning with Joseph B. Ahlborn and ending with 0003951188      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN145:\n                30 nominations in the Army beginning with Timothy W. Atkins and ending with Ricky L. Warren, Jr.      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN153:\n                18 nominations in the Air Force beginning with Brett D. Barner and ending with Peter S. Vo      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN154:\n                126 nominations in the Air Force beginning with Daniel A. Agada and ending with Mario L. Zenteno      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN155:\n                55 nominations in the Air Force beginning with Rodinanthonyfil R. Alarcon and ending with Lisa M. Yeater      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN156:\n                432 nominations in the Air Force beginning with Luchezar A. Abbott and ending with Alexander B. Zima      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN157:\n                54 nominations in the Air Force beginning with Victor A. Acosta and ending with William D. Yau      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN158:\n                68 nominations in the Air Force beginning with Dustin C. Adams and ending with Donnell D. Wright      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN159:\n                1116 nominations in the Air Force beginning with Haval L. Aarif and ending with Thomas P. Zogal      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN160:\n                270 nominations in the Air Force beginning with Joey A. Abelon, Jr. and ending with Louis J. Zib III      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN161:\n                170 nominations in the Air Force beginning with Cristian Agredo and ending with Jena M. Zander      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN162:\n                Brent T. Bubany, in the Army, to be Major      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN163:\n                Jeffrey A. Smith, in the Air Force, to be Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN164:\n                Joshua S. Stinson, in the Air Force, to be Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN165:\n                Cyrus A. Perry, in the Air Force, to be LieutenantColonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN166:\n                Benjamin R. Washburn, in the Air Force, to be Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN167:\n                Raymond E. Kerr, in the Air Force, to be Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN168:\n                Matthew T. Olson, in the Air Force, to be Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN169:\n                Lemuel J. Rios, in the Air Force, to be Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN170:\n                102 nominations in the Air Force beginning with Jesse C. Allen and ending with Bridget S. Zorn      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN171:\n                Clayton J. Aune, in the Air Force, to be Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN172:\n                Garrett M. Wells, in the Air Force, to be Major      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN173:\n                Brandon G. Wagoner, in the Air Force, to be Major      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN174:\n                Garrett C. Guthrie, in the Air Force, to be Major      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN175:\n                Vanessa J. Moffett, in the Air Force, to be Lieutenant Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN176:\n                Ramon Morado, in the Air Force, to be Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN177:\n                John H. Diaz, in the Air Force, to be Lieutenant Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN178:\n                Brennan P. McDonald, in the Air Force, to be Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN179:\n                Tyler B. Smith, in the Air Force, to be Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN180:\n                Margaret A. Nowicki, in the Army, to be Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN181:\n                Arthur G. Brong, in the Army, to be Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN182:\n                28 nominations in the Army beginning with Spencer R. Atkinson and ending with Anna Yoo      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN183:\n                161 nominations in the Army beginning with Joseph R. Adams and ending with Liang Zhou      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN184:\n                18 nominations in the Army beginning with Michael M. Armstrong and ending with Garrett G. Wood      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN185:\n                77 nominations in the Army beginning with Jason B.Alisangco and ending with 0002875100      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN186:\n                220 nominations in the Army beginning with Kyle L.Akers and ending with Brian K. Zdunowski      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN187:\n                48 nominations in the Army beginning with Angela J. Allen and ending with Shun Y. Yu      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN188:\n                222 nominations in the Army beginning with Carlos J. Acosta Rivera and ending with Jay A. Zwirblis      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN189:\n                David C. Sandomir, in the Navy, to be Captain      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN190:\n                Allen H. Grimes, in the Navy, to be Captain      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN191:\n                Jonathan D. Padgett, in the Navy, to be Captain      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN192:\n                Jonathan D. Padgett, in the Navy, to be Captain      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN193:\n                Ricky R. Rowe, in the Navy, to be Captain      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN194:\n                24 nominations in the Navy beginning with Daniel P. Bradley and ending with Kasimir M. Wnuk      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN195:\n                Daniel P. Malatesta, in the Navy, to be Captain      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN196:\n                67 nominations in the Navy beginning with Martha C. Adams and ending with Benjamin M. Walborn      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN197:\n                John K. Hope III, in the Navy, to be Captain      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN198:\n                13 nominations in the Navy beginning with Michael W. Coulter and ending with Monty A. Vikdal      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN199:\n                3 nominations in the Navy beginning with Robert J.Chavez and ending with Dean T. Moon      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN200:\n                2 nominations in the Navy beginning with Daniel S.Avondoglio and ending with Robert F. Marnell      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN201:\n                Santiago M. Carrizosa, in the Navy, to be Captain      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN202:\n                3 nominations in the Navy beginning with Allison M. Ashearriola and ending with Patrick L. Obrien      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN203:\n                15 nominations in the Navy beginning with Joseph E. Benton III and ending with Luke G. Wisniewski      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN204:\n                4 nominations in the Navy beginning with Leon W. Moore and ending with Todd M. Spitler      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN205:\n                Christopher A. Baxter, in the Navy, to be Captain      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN206:\n                2 nominations in the Navy beginning with Calvin Martin and ending with Miko K. Wade      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN207:\n                3 nominations in the Navy beginning with Brian J. Abbott and ending with Eric P. Nardo      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN208:\n                6 nominations in the Navy beginning with Wade A. Berzett and ending with Regis C. Worley, Jr.      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN209:\n                4 nominations in the Navy beginning with Scott P. Bennie and ending with Christopher M. Schmid      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN210:\n                77 nominations in the Navy beginning with Jesse Bandle and ending with James L. Zimmerman      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN211:\n                13 nominations in the Navy beginning with William P. Boggess and ending with Rachel L. Werner      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN212:\n                24 nominations in the Navy beginning with James P.Adwell and ending with Timothy T. Welsh      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN213:\n                12 nominations in the Navy beginning with Deniz M.Baykan and ending with Katherine D. Worstell      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN214:\n                5 nominations in the Navy beginning with Eric K. Conrad and ending with Katherine Vester      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN215:\n                3 nominations in the Navy beginning with Anthony B. Fries and ending with Dennis D. Smith, Jr.      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN216:\n                2 nominations in the Navy beginning with Michael R. Fasano and ending with Jeriahmi L. L. Tinsley      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN217:\n                8 nominations in the Navy beginning with Emily J. Bingham and ending with Thomas H. Wright      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN218:\n                19 nominations in the Navy beginning with JeremiahP. Anderson and ending with Jeffrey K. White      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN219:\n                5 nominations in the Navy beginning with Brien J. Croteau and ending with Brent F. West      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN220:\n                258 nominations in the Navy beginning with Ian P. Adams and ending with George S. Zintak      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN221:\n                16 nominations in the Navy beginning with James G.Angerman and ending with Robert M. Syre      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN222:\n                6 nominations in the Navy beginning with Aaron E. Kleinman and ending with Steven E. Stougard      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN223:\n                26 nominations in the Navy beginning with Lamont A. Brown and ending with Brent L. Summers      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN224:\n                33 nominations in the Navy beginning with Colleen L. Abuzeid and ending with Elizabeth M. Zuloaga      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN225:\n                Justin J. Degrado, in the Navy, to be Captain      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN226:\n                13 nominations in the Navy beginning with Naimi Amiral and ending with Michael A. White      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN227:\n                3 nominations in the Navy beginning with Arlo K. Abrahamson and ending with Richlyn C. Ivey      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN228:\n                6 nominations in the Navy beginning with James C. Bailey and ending with Alejandro Palomino      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN229:\n                14 nominations in the Navy beginning with Daniel J. Bellinghausen and ending with Eric Zilberman      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN230:\n                17 nominations in the Navy beginning with Michael J. Bonacorsa and ending with Jacob E. Wilson      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN231:\n                12 nominations in the Navy beginning with Christian G. Acord and ending with Christopher J. Wasek      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN232:\n                8 nominations in the Navy beginning with Aaron N. Aaron and ending with Michael N. Perkins II      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN233:\n                5 nominations in the Navy beginning with Kristine N. Bench and ending with Christopher K. Tuggle      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN234:\n                3 nominations in the Navy beginning with Kurt E. Davis and ending with Jason A. Rinto      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN235:\n                2 nominations in the Navy beginning with Andrew J.Adams and ending with Peter B. Manzoli      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN236:\n                Jaime I. Roman, in the Navy, to be Captain      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN237:\n                Matthew L. Sevier, in the Navy, to be Captain      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN238:\n                Ashley S. M. McAbee, in the Navy, to be Captain      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN239:\n                Jeremy D. Bartowitz, in the Navy, to be Captain      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN240:\n                Brenna L. Schnars, in the Navy, to be Captain      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN241:\n                Steven A. Halle, in the Navy, to be Captain      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN242:\n                Kristen M. Barra, in the Space Force, to be Lieutenant Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN243:\n                4 nominations in the Coast Guard beginning with John C. Adams and ending with Judson B. Wheeler      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN248:\n                501 nominations in the Air Force beginning with Clarence Abercrombie, Jr. and ending with Andrew P. Zwirlein      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN249:\n                30 nominations in the Air Force beginning with Bryce D. Acres and ending with Christopher D. Westfall      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN250:\n                4 nominations in the Army beginning with Jessica E. Basso and ending with Bradley Tait      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN252:\n                7 nominations in the Army beginning with Rudylee Armijo and ending with Wilson T. Mustain      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN253:\n                Mark R. Milhiser, in the Army, to be Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN254:\n                4 nominations in the Navy beginning with Matthew D. Baird and ending with Jerry T. Whitlock      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN255:\n                15 nominations in the Navy beginning with NeremiahJ. S. Castano and ending with Peter S. Sunden      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN256:\n                8 nominations in the Navy beginning with Matthew B. Daniels and ending with Kenneth J. Phillips      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN257:\n                3 nominations in the Navy beginning with Colin C. Engels and ending with Christopher L. Worthy      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN258:\n                4 nominations in the Navy beginning with Mark L. Brooks and ending with John B. Stockstill      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN259:\n                18 nominations in the Navy beginning with Wendy F.Alband and ending with Kimberly Smith      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN260:\n                3 nominations in the Navy beginning with Peter J. Hammes and ending with Jeannine L. Weiss      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN261:\n                4 nominations in the Navy beginning with Toby J. Degenhardt and ending with Brian A. Potoski      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN262:\n                15 nominations in the Navy beginning with Ben P. Ammerman and ending with Robert C. Singer      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN263:\n                James M. Missler, Jr., in the Navy, to be Captain      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN264:\n                Kaelan F. Clay, in the Navy, to be Commander      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN265:\n                Elliott Giles, in the Navy, to be Commander      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN266:\n                13 nominations in the Navy beginning with Chad C. Barnhart and ending with Caitlin J. Takahashi      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN267:\n                23 nominations in the Navy beginning with Burnes C. W. Brown and ending with Kenneth W. Zilka      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN268:\n                6 nominations in the Navy beginning with Justus T.Cook and ending with Sheu O. Yusuf      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN269:\n                32 nominations in the Navy beginning with Jeremy M. Adams and ending with Chance S. Yergensen      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN270:\n                Raymond C. Brushier, in the Space Force, to be Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN272:\n                Vice Adm. Charles B. Cooper II, in the Navy, to beAdmiral      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN273:\n                13 nominations in the Army beginning with Christopher L. Blaha and ending with Thomas A. Whitehead      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN274:\n                25 nominations in the Army beginning with Blake A.Bugaj and ending with Kyle R. Vogt      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN275:\n                Lt. Gen. Alexus G. Grynkewich, in the Air Force, to be General      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN276:\n                9 nominations in the Air Force beginning with Brig. Gen. David M. Castaneda and ending with Brig. Gen. Dean D. Sniegowski      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN277:\n                Brig. Gen. John B. Hinson, in the Army, to be Major General      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN278:\n                Brig. Gen. Kent J. Lightner, in the Army, to be Major General      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN279:\n                2 nominations in the Army beginning with Brig. Gen. Todd L. Erskine and ending with Col. David G. Barrett      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN280:\n                Col. Christopher G. Tolar, in the Marine Corps, tobe Major General      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN281:\n                Rear Adm. (lh) Christopher D. Stone, in the Navy, to be Rear Admiral      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN282:\n                Rear Adm. (lh) David M. Buzzetti, in the Navy, to be Rear Admiral      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN283:\n                3 nominations in the Navy beginning with Rear Adm.(lh) David J. Faehnle and ending with Rear Adm. (lh) Donald M. Plummer      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN284:\n                Rear Adm. (lh) Kristin Acquavella, in the Navy, tobe Rear Admiral      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN285:\n                Rear Adm. (lh) Matthew Case, in the Navy, to be Rear Admiral      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN286:\n                3 nominations in the Space Force beginning with Brig. Gen. Robert J. Hutt and ending with Brig. Gen. Brian D. Sidari      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN287:\n                Brig. Gen. Aaron D. Drake, in the Air Force, to beMajor General      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN288:\n                Col. Catherine V. Barrington, in the Air Force, tobe Brigadier General      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN289:\n                5 nominations in the Air Force beginning with Col.Keolani W. Bailey and ending with Col. Bernadette Maldonado      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN290:\n                14 nominations in the Air Force beginning with Col. Chad R. W. Biehl and ending with Col. Gavin D. Tade      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN292:\n                6 nominations in the Army beginning with Col. Matthew M. Cain and ending with Col. Mark F. Schoenfeld      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN293:\n                Col. Isaac B. Martinez, in the Army, to be Brigadier General      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN294:\n                Col. Marshall S. Scantlin, in the Army, to be Brigadier General      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN295:\n                Col. Patrick L. Pollak, in the Army, to be Brigadier General      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN296:\n                Capt. Damian D. Flatt, in the Navy, to be Rear Admiral (lower half)      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN297:\n                Capt. Reginald S. Ewing III, in the Navy, to be Rear Admiral (lower half)      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN298:\n                Capt. Raymond P. Owens III, in the Navy, to be Rear Admiral (lower half)      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN299:\n                2 nominations in the Navy beginning with Capt. Erin E. O. Acosta and ending with Capt. Benjamin A. Snell      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN300:\n                Capt. Jereal E. Dorsey, in the Navy, to be Rear Admiral (lower half)      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN301:\n                Capt. Kertreck V. Brooks, in the Navy, to be Rear Admiral (lower half)      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN302:\n                Capt. Sharif H. Calfee, in the Navy, to be Rear Admiral (lower half)      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN303:\n                Capt. Omarr E. Tobias, in the Navy, to be Rear Admiral (lower half)      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN304:\n                Capt. Michael J. Thornton, in the Navy, to be RearAdmiral (lower half)      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN305:\n                Capt. Jonathan J. Jettparmer, in the Navy, to be Rear Admiral (lower half)      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN306:\n                2 nominations in the Navy beginning with Capt. Quinton S. Packard and ending with Capt. Jonathan R. Townsend      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN307:\n                5 nominations in the Navy beginning with Capt. Christopher A. Carter and ending with Capt. Kelly C. Ward      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN308:\n                Capt. Frank J. Brajevic, in the Navy, to be Rear Admiral (lower half)      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN309:\n                Capt. Anthony L. Lacourse, in the Navy, to be RearAdmiral (lower half)      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN310:\n                Capt. Kristin L. McCarthy, in the Navy, to be RearAdmiral (lower half)      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN311:\n                Capt. Kimberly M. Sandberg, in the Navy, to be Rear Admiral (lower half)      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN312:\n                Capt. Kevin M. Corcoran, in the Navy, to be Rear Admiral (lower half)      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN313:\n                Capt. Lester Ortiz, in the Navy, to be Rear Admiral (lower half)      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN314:\n                7 nominations in the Space Force beginning with Col. Casey M. Beard and ending with Col. Matthew E. Holston      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN315:\n                500 nominations in the Army beginning with WilliamP. Abbott and ending with 0004221858      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN316:\n                442 nominations in the Army beginning with Benjamin T. Abel and ending with 0004209777      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN317:\n                35 nominations in the Army beginning with Alan Adame and ending with 0000089994      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN318:\n                304 nominations in the Army beginning with James J. Agius and ending with 0003086373      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN319:\n                Jacob C. Crockett, in the Marine Corps, to be Lieutenant Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN320:\n                Brian N. Johnson, in the Navy, to be Lieutenant Commander      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN321:\n                Sergio E. Lloret, in the Navy, to be Commander      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN322:\n                Les M. Begin, in the Navy, to be Commander      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN323:\n                Shelby M. Nikitin, in the Navy, to be Captain      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN324:\n                23 nominations in the Navy beginning with Claudia I. Alday and ending with Ryan J. Wickham      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN325:\n                48 nominations in the Navy beginning with Robert T. Augustine and ending with Cody C. White      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN326:\n                15 nominations in the Navy beginning with Matthew J. Arnsberger and ending with Anthony J. Wich      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN327:\n                23 nominations in the Navy beginning with Travis L. Carter and ending with Katherine R. Wright      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN328:\n                26 nominations in the Navy beginning with Luis E. Banchs and ending with Matthew K. Wittkopp      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN329:\n                49 nominations in the Navy beginning with JermaineArmstrong and ending with Kendra M. Yates      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN330:\n                2 nominations in the Navy beginning with Dwayne D.Dunlap and ending with Jason O. Lawrie      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN331:\n                12 nominations in the Navy beginning with Richard E. Arthur II and ending with Brian E. Yee      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN332:\n                8 nominations in the Navy beginning with David J. Carter and ending with Matthew A. Stroup      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN333:\n                22 nominations in the Navy beginning with Daniel J. Bradshaw and ending with Jacob J. Torba      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN334:\n                14 nominations in the Navy beginning with Michael Adamski, Jr. and ending with Jacqueline Zimny      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN335:\n                4 nominations in the Navy beginning with Christopher P. Anderson and ending with Alex R. Turco      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN336:\n                6 nominations in the Navy beginning with Joshua D.Ciocco and ending with Christopher J. Richards      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN337:\n                20 nominations in the Navy beginning with Deena R.Abt and ending with Shane A. Welsh      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN338:\n                14 nominations in the Navy beginning with Robert J. Campbellmartin and ending with Jacob R. Wofford      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN339:\n                6 nominations in the Navy beginning with Michael L. Harper and ending with Michael S. Williams      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN340:\n                13 nominations in the Navy beginning with Gloria F. Boykin and ending with Emma S. Yearby      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN341:\n                568 nominations in the Navy beginning with Anastasia S. Abid and ending with Alexander T. Zimmerman      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN347:\n                Brig. Gen. Karen S. MondayGresham, in the Army, tobe Major General      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN349:\n                18 nominations in the Army beginning with Eric O. Dean and ending with John C. Verdugo      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN350:\n                2 nominations in the Air Force beginning with Lt. Gen. Case A. Cunningham and ending with Lt. Gen. John J. DeGoes      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN351:\n                Lt. Gen. Adrian L. Spain, in the Air Force, to be General      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN353:\n                Maj. Gen. Bobby L. Christine, in the Army, to be Judge Advocate General of the United States Army      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN355:\n                Lt. Gen. Benjamin T. Watson, in the Marine Corps, to be Lieutenant General      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN356:\n                Maj. Gen. William J. Bowers, in the Marine Corps, to be Lieutenant General      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN357:\n                Maj. Gen. David L. Odom, in the Marine Corps, to be Lieutenant General      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN358:\n                Maj. Gen. Stephen E. Liszewski, in the Marine Corps, to be Lieutenant General      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN359:\n                Lt. Gen. Gregory L. Masiello, in the Marine Corps,to be Lieutenant General      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN360:\n                Maj. Gen. Jay M. Bargeron, in the Marine Corps, tobe Lieutenant General      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN362:\n                5 nominations in the Navy beginning with Vice Adm.Frederick W. Kacher and ending with Rear Adm. Thomas M. Henderschedt      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN363:\n                Chad M. Henderson, in the Army, to be Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN364:\n                2 nominations in the Army beginning with Lily M. Diakhate and ending with Jeffrey B. Kusyj      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN365:\n                Patricia L. Mashburn, in the Army, to be Major      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN366:\n                Peter I. Belk, in the Army, to be Colonel      \n\n        --        Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  1:14 a.m,      the Presiding Officer (Mr. Moreno in the chair) declared the      Senate adjourned, under its order of today, until  9 a.m. on      Monday, June 30, 2025.","actionTimeStamp":"--"}]}