{"retrieved-date":"2023-8-8","actions-date":"Fri, 04 Aug 2023 11:03:01 -0400","actions-title":"House Floor Proceedings","actions-count":7,"actions-list":[{"index":1,"header":"--","actionItem":"The Speaker announced that the House do now adjourn pursuant to section 3(z) of H. Res. 5. The next meeting is scheduled for 10:30 a.m. on August 8, 2023.","actionTimeStamp":"Fri, 04 Aug 2023 11:03:01 -0400"},{"index":2,"header":"--","actionItem":"The House received a message from the Acting Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Representatives, the Acting Clerk received the following message from the Secretary of the Senate on July 28, 2023, at 2:23 p.m.: That the Senate passed S. 788, S. 992, S. 1528, S. 1608, S. 1858, and H.R. 2544. Appointments: Migratory Bird Conservation Commission; Commission on Security and Cooperation in Europe (Helsinki); United States Holocaust Memorial Council and Congressional-Executive Commission on the People's Republic of China.","actionTimeStamp":"Fri, 04 Aug 2023 11:02:05 -0400"},{"index":3,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair led the House in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Fri, 04 Aug 2023 11:01:47 -0400"},{"index":4,"header":"SPEAKER'S APPROVAL OF THE JOURNAL","actionItem":"Pursuant to section 3(z) of H. Res. 5, the Journal of the last day's proceedings was approved.","actionTimeStamp":"Fri, 04 Aug 2023 11:01:35 -0400"},{"index":5,"header":"--","actionItem":"Today's prayer was offered by Rev. John Kellogg, Christ Church, Washington Parish, Washington, DC","actionTimeStamp":"Fri, 04 Aug 2023 11:00:51 -0400"},{"index":6,"header":"--","actionItem":"The Speaker designated the Honorable Christopher H. Smith to act as Speaker pro tempore for today.","actionTimeStamp":"Fri, 04 Aug 2023 11:00:40 -0400"},{"index":7,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Fri, 04 Aug 2023 11:00:00 -0400"}]}