{"retrieved-date":"2023-2-28","actions-date":"Tue, 28 Feb 2023 12:38:38 -0500","actions-title":"House Floor Proceedings","actions-count":13,"actions-list":[{"index":1,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is subject to the call of the Chair.","actionTimeStamp":"Tue, 28 Feb 2023 12:38:38 -0500"},{"index":2,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on H. Res. 166, the Chair put the question on ordering the previous question and by voice vote announced that the ayes had prevailed. Mr. McGovern demanded the yeas and nays and the Chair postponed further proceedings on ordering the previous question until a time to be announced.","actionTimeStamp":"Tue, 28 Feb 2023 12:37:56 -0500"},{"index":3,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 166.","actionTimeStamp":"Tue, 28 Feb 2023 12:08:55 -0500"},{"index":4,"header":"--","actionItem":"Considered as privileged matter. H. Res. 166 — \"Providing for consideration of the bill (H.R. 347) to require the Executive Office of the President to provide an inflation estimate with respect to Executive orders with a significant effect on the annual gross budget, and for other purposes, and providing for consideration of the joint resolution (H.J. Res. 30) providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Department of Labor relating to \"Prudence and Loyalty in Selecting Plan Investments and Exercising Shareholder Rights\".\"","actionTimeStamp":"Tue, 28 Feb 2023 12:06:08 -0500"},{"index":5,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches which by direction of the Chair would be limited to 15 per side of the aisle.","actionTimeStamp":"Tue, 28 Feb 2023 12:02:20 -0500"},{"index":6,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Wilson of SC to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Tue, 28 Feb 2023 12:01:51 -0500"},{"index":7,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Tue, 28 Feb 2023 12:01:43 -0500"},{"index":8,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Tue, 28 Feb 2023 12:00:16 -0500"},{"index":9,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of February 28.","actionTimeStamp":"Tue, 28 Feb 2023 12:00:00 -0500"},{"index":10,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Tue, 28 Feb 2023 10:39:40 -0500"},{"index":11,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Tue, 28 Feb 2023 10:01:00 -0500"},{"index":12,"header":"--","actionItem":"The Speaker designated the Honorable Anna Paulina Luna to act as Speaker pro tempore for today.","actionTimeStamp":"Tue, 28 Feb 2023 10:00:18 -0500"},{"index":13,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Tue, 28 Feb 2023 10:00:00 -0500"}]}