{"retrieved-date":"2023-10-27","actions-date":"Wednesday, October 25, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, October 25)","actionItem":"H.R. 4366 (Rep. Carter):\n        A bill making appropriations for military construction, the Department of Veterans Affairs, and related agencies for the fiscal year ending September 30, 2024, and for other purposes.\n\n        -- Considered by Senate.\n\n        -- Motion by Senator Schumer to commit to Senate Committee on Appropriations with instructions to report back forthwith with the following amendment (SA 1230) withdrawn in Senate by Unanimous Consent.\n \n\n S.Amdt. 1092 (Sen. Murray):\n        In the nature of a substitute.\n\n        --Considered by Senate.\n\n\n S.Amdt. 1113 (Sen. Hirono):\n        To provide funding for competitive grants for construction of agricultural research facilities and related activities, with an offset.\n\n        --Amendment SA 1113 proposed by Senator Murray for Senator Hirono to Amendment SA 1092.\n\n        --Amendment SA 1113 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1115 (Sen. Stabenow):\n        To provide funding for the Urban Agriculture and Innovative Production Program.\n\n        --Amendment SA 1115 proposed by Senator Murray for Senator Stabenow to Amendment SA 1092.\n\n        --Amendment SA 1115 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1116 (Sen. Kelly):\n        To require medical facilities of the Department of Veterans Affairs to share certain data with State cancer registries.\n\n        --Amendment SA 1116 proposed by Senator Murray for Senator Kelly to Amendment SA 1092.\n\n        --Amendment SA 1116 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1117 (Sen. Rosen):\n        To make amounts available to the Veterans Health Administration to sustain and increase telehealth capacity and associated programmatic efforts.\n\n        --Amendment SA 1117 proposed by Senator Murray for Senator Rosen to Amendment SA 1092.\n\n        --Amendment SA 1117 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1120 (Sen. Schatz):\n        To extend the period of availability for fiscal year 2021 national infrastructure investments.\n\n        --Amendment SA 1120 proposed by Senator Murray for Senator Schatz to Amendment SA 1092.\n\n        --Amendment SA 1120 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1131 (Sen. Shaheen):\n        To require a report on the use of third-party contractors to conduct medical disability examinations of veterans.\n\n        --Amendment SA 1131 proposed by Senator Murray for Senator Shaheen to Amendment SA 1092.\n\n        --Amendment SA 1131 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1133 (Sen. Kelly):\n        To require a report relating to rural community facilities direct loan applicants.\n\n        --Amendment SA 1133 proposed by Senator Murray for Senator Kelly to Amendment SA 1092.\n\n        --Amendment SA 1133 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1134 (Sen. Smith):\n        To require the submission of a report on improving staffing at the Farm Service Agency and the Natural Resources Conservation Service at the county level.\n\n        --Amendment SA 1134 proposed by Senator Murray for Senator Smith to Amendment SA 1092.\n\n        --Amendment SA 1134 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1139 (Sen. Padilla):\n        To provide for the development of emergency evacuation route planning guidelines and best practices.\n\n        --Amendment SA 1139 proposed by Senator Murray for Senator Padilla to Amendment SA 1092.\n\n        --Amendment SA 1139 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1140 (Sen. Padilla):\n        To improve housing assistance for veterans experiencing homelessness.\n\n        --Amendment SA 1140 proposed by Senator Murray for Senator Padilla to Amendment SA 1092.\n\n        --Amendment SA 1140 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1175 (Sen. Booker):\n        To increase funding for rural decentralized water systems.\n\n        --Amendment SA 1175 proposed by Senator Murray for Senator Booker to Amendment SA 1092.\n\n        --Amendment SA 1175 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1185 (Sen. Daines):\n        To require the Secretary of Veterans Affairs to submit to Congress an earned value analysis of the Veterans Electronic Health Record system of the Department of Veterans Affairs.\n\n        --Amendment SA 1185 proposed by Senator Murray for Senator Daines to Amendment SA 1092.\n\n        --Amendment SA 1185 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1202 (Sen. Reed):\n        To appropriate amounts for shellfish research, with an offset.\n\n        --Amendment SA 1202 proposed by Senator Murray for Senator Reed to Amendment SA 1092.\n\n        --Amendment SA 1202 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1203 (Sen. Klobuchar):\n        To make funds available for the aeronautical information management program.\n\n        --Amendment SA 1203 proposed by Senator Murray for Senator Klobuchar to Amendment SA 1092.\n\n        --Amendment SA 1203 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1205 (Sen. Murray):\n        To change the effective date.\n\n        --Considered by Senate.\n\n        --Proposed amendment SA 1205 withdrawn in Senate.\n\n\n S.Amdt. 1210 (Sen. Vance):\n        To prohibit funds appropriated for the Department of Transportation for fiscal year 2024 from being used to enforce a mask mandate in response to the COVID-19 virus.\n\n        --Amendment SA 1210 proposed by Senator Vance to Amendment SA 1092.\n\n        --Amendment SA 1210 agreed to in Senate by Yea-Nay Vote. 59 - 38. Record Vote Number: \n\n\n S.Amdt. 1216 (Sen. Sullivan):\n        To prioritize the use of funds for certain telehealth services and mental health programs for veterans.\n\n        --Amendment SA 1216 proposed by Senator Murray for Senator Sullivan to Amendment SA 1092.\n\n        --Amendment SA 1216 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1220 (Sen. Rosen):\n        To provide funding for the suppression and control of Mormon crickets in western States.\n\n        --Amendment SA 1220 proposed by Senator Murray for Senator Rosen to Amendment SA 1092.\n\n        --Amendment SA 1220 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1221 (Sen. Sullivan):\n        To prohibit the use of funds to procure seafood from China for use in school meals.\n\n        --Amendment SA 1221 proposed by Senator Murray for Senator Sullivan to Amendment SA 1092.\n\n        --Amendment SA 1221 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1230 (Sen. Schumer):\n        To change the effective date.\n\n        --Considered by Senate.\n\n        --Proposed amendment SA 1230 withdrawn in Senate.\n\n\n S.Amdt. 1232 (Sen. Lankford):\n        To provide for a period of continuing appropriations in the event of a lapse in appropriations under the normal appropriations process, and establish procedures and consequences in the event of a failure to enact appropriations.\n\n        --Amendment SA 1232 proposed by Senator Lankford to Amendment SA 1092.\n\n        --Amendment SA 1232, under the order of 10/24/2023, not having achieved 60 votes in the affirmative, was not agreed to in Senate by Yea-Nay Vote. 56 - 42. Record Vote Number: \n\n\n S.Amdt. 1237 (Sen. Rubio):\n        To prohibit the use of funds to implement the final rule regarding energy efficient standards for certain subsidized housing.\n\n        --Amendment SA 1237 proposed by Senator Graham for Senator Rubio to Amendment SA 1092.\n\n        --Amendment SA 1237 not agreed to in Senate by Yea-Nay Vote. 47 - 51. Record Vote Number: \n\n\n S.Amdt. 1250 (Sen. Moran):\n        To prohibit the use of funds appropriated by division A to change rates for reimbursement for transportation via a special mode of transportation under the laws administered by the Secretary of Veterans Affairs and to reduce certain amounts available to the Department of Veterans Affairs.\n\n        --Amendment SA 1250 proposed by Senator Murray for Senator Moran to Amendment SA 1092.\n\n        --Amendment SA 1250 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1255 (Sen. Ossoff):\n        To provide funds for the Office of Women's Health of the Department of Veterans Affairs to expand access of women veterans to mammography initiatives and equipment.\n\n        --Amendment SA 1255 proposed by Senator Murray for Senator Ossoff to Amendment SA 1092.\n\n        --Amendment SA 1255 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1264 (Sen. Tillis):\n        To require a review regarding veterans who engaged in toxic exposure risk activities while serving in Kosovo.\n\n        --Amendment SA 1264 proposed by Senator Murray for Senator Tillis to Amendment SA 1092.\n\n        --Amendment SA 1264 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1270 (Sen. Britt):\n        To provide appropriations for certain research using plant genomics, with an offset.\n\n        --Amendment SA 1270 proposed by Senator Murray for Senator Britt to Amendment SA 1092.\n\n        --Amendment SA 1270 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1277 (Sen. Cardin):\n        To provide funding for invasive catfish control.\n\n        --Amendment SA 1277 proposed by Senator Murray for Senator Cardin to Amendment SA 1092.\n\n        --Amendment SA 1277 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1283 (Sen. Peters):\n        To provide funding for the emergency and transitional pet shelter and housing assistance grant program.\n\n        --Amendment SA 1283 proposed by Senator Murray for Senator Peters to Amendment SA 1092.\n\n        --Amendment SA 1283 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1351 (Sen. Warnock):\n        To require the Secretary of Transportation to report on the Federal Aviation Administration's workforce development programs.\n\n        --Amendment SA 1351 proposed by Senator Murray for Senator Warnock to Amendment SA 1092.\n\n        --Amendment SA 1351 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1352 (Sen. Merkley):\n        To increase the set-aside for multi-benefit projects under the watershed and flood prevention operations program.\n\n        --Amendment SA 1352 proposed by Senator Murray for Senator Merkley to Amendment SA 1092.\n\n        --Amendment SA 1352 agreed to in Senate by Voice Vote.\n\n\n S.Amdt. 1354 (Sen. Kennedy):\n        To prohibit the availability of funds for the Secretary of Veterans Affairs to report certain information to the Department of Justice for use by the National Instant Criminal Background Check System.\n\n        --Amendment SA 1354 proposed by Senator Kennedy to Amendment SA 1092.\n\n        --Amendment SA 1354 agreed to in Senate by Yea-Nay Vote. 53 - 45. Record Vote Number: \n\n\n\n\n S.Res. 428 (Sen. Fischer):\n        A resolution recognizing women's collegiate athletics and the record-setting Volleyball Day in Nebraska event on August 30, 2023.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 430 (Sen. Manchin):\n        A resolution designating October 20, 2023, as \"National Early Childhood Literacy Awareness Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 431 (Sen. Ernst):\n        A resolution recognizing the month of October 2023 as \"National Women's Small Business Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 432 (Sen. Casey):\n        A resolution recognizing the fifth commemoration of the antisemitic attack that occurred on October 27, 2018, at a synagogue in Pittsburgh, Pennsylvania.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, October 25)","actionItem":"PN155:\n        Jessica Looman, of Minnesota, to be Administrator of the Wage and Hour Division, Department of Labor\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 46. Record Vote Number: 265","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Manchin, at  7:02 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}