{"retrieved-date":"2025-7-2","actions-date":"Wed, 02 Jul 2025 09:18:53 -0400","actions-title":"House Floor Proceedings","actions-count":10,"actions-list":[{"index":1,"header":"On consideration of the resolution Roll Call 186","actionItem":"Yea and Nay vote pending.","actionTimeStamp":"Wed, 02 Jul 2025 09:18:53 -0400"},{"index":2,"header":"POINT OF ORDER","actionItem":"Mr. McGovern raised a point of order against the provisions of H. Res. 566 on the grounds that the resolution violates section 426(a) of the Congressional Budget Act. The Chair announced that the disposition of the point of order would be resolved by the question of consideration of H. Res. 566. The House proceeded with 20 minutes of debate on the point of order at the end of which the Chair will put the question on consideration.","actionTimeStamp":"Wed, 02 Jul 2025 09:05:33 -0400"},{"index":3,"header":"--","actionItem":"By direction of the Committee on Rules, Ms. Foxx called up H. Res. 566 and asked for its immediate consideration.","actionTimeStamp":"Wed, 02 Jul 2025 09:04:12 -0400"},{"index":4,"header":"--","actionItem":"The House received a message from the Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Representatives, the Clerk notified the House that he had received the following message from the Secretary of the Senate on July 1, 2025, at 5:20 p.m.: That the Senate passed H.R. 1, as amended.","actionTimeStamp":"Wed, 02 Jul 2025 09:03:46 -0400"},{"index":5,"header":"--","actionItem":"The House received a communication from the Honorable Robert Garcia. Mr. Garcia (CA) submitted his resignation from the Committee on Homeland Security. The resignation was accepted without objection.","actionTimeStamp":"Wed, 02 Jul 2025 09:03:03 -0400"},{"index":6,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. McGovern to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 02 Jul 2025 09:03:03 -0400"},{"index":7,"header":"SPEAKER'S APPORVAL OF THE JOURNAL","actionItem":"Pursuant to clause 13 of Rule I, the Journal of the last day's proceedings was approved.","actionTimeStamp":"Wed, 02 Jul 2025 09:02:48 -0400"},{"index":8,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Wed, 02 Jul 2025 09:01:31 -0400"},{"index":9,"header":"--","actionItem":"The Speaker designated the Honorable Michael K. Simpson to act as Speaker pro tempore for today.","actionTimeStamp":"Wed, 02 Jul 2025 09:01:16 -0400"},{"index":10,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 02 Jul 2025 09:00:00 -0400"}]}