{"retrieved-date":"2024-7-10","actions-date":"Wed, 10 Jul 2024 13:10:58 -0400","actions-title":"House Floor Proceedings","actions-count":16,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H.J. Res. 165.","actionTimeStamp":"Wed, 10 Jul 2024 13:10:58 -0400"},{"index":2,"header":"--","actionItem":"Rule provides for consideration of H.R. 8281, H.J. Res. 165, H.R. 8772, H.R. 7637 and H.R. 7700 The resolution provides for consideration of H.R. 8772 under a structured rule and H.R. 8281, H.J. Res. 165, H.R. 7700, and H.R. 7637 under a closed rule. Rule provides for one hour of general debate and one motion to recommit on each bill.","actionTimeStamp":"Wed, 10 Jul 2024 13:10:03 -0400"},{"index":3,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 1341. H.J. Res. 165 — \"Providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Department of Education relating to \"Nondiscrimination on the Basis of Sex in Education Programs or Activities Receiving Federal Financial Assistance\".\"","actionTimeStamp":"Wed, 10 Jul 2024 13:09:58 -0400"},{"index":4,"header":"POSTPONED PROCEEDINGS","actionItem":"At the conclusion of debate on the veto message of the President to H.J. Res. 109, the Chair put the question on will the House, on reconsideration, pass H.J. Res. 109, the objections of the President to the contrary notwithstanding. Under the Constitution, the vote must be taken by the yeas and nays. Further proceedings were postponed until a time to be announced.","actionTimeStamp":"Wed, 10 Jul 2024 13:08:12 -0400"},{"index":5,"header":"--","actionItem":"The previous question was ordered without objection.","actionTimeStamp":"Wed, 10 Jul 2024 13:08:03 -0400"},{"index":6,"header":"DEBATE","actionItem":"Pursuant to a previous order of the House of June 3, 2024, the unfinished business is the further consideration of the veto message of the President on H.J. Res. 109. The House proceeded with one hour of debate on the objections of the President to the contrary notwithstanding.","actionTimeStamp":"Wed, 10 Jul 2024 12:35:27 -0400"},{"index":7,"header":"--","actionItem":"The Chair laid before the House the veto message from the President.","actionTimeStamp":"Wed, 10 Jul 2024 12:35:08 -0400"},{"index":8,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair would be limited to 15 per side of the aisle.","actionTimeStamp":"Wed, 10 Jul 2024 12:03:05 -0400"},{"index":9,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Wilson of SC to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 10 Jul 2024 12:02:39 -0400"},{"index":10,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 10 Jul 2024 12:02:36 -0400"},{"index":11,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Wed, 10 Jul 2024 12:00:51 -0400"},{"index":12,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of July 10.","actionTimeStamp":"Wed, 10 Jul 2024 12:00:00 -0400"},{"index":13,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Wed, 10 Jul 2024 11:19:19 -0400"},{"index":14,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Wed, 10 Jul 2024 10:00:41 -0400"},{"index":15,"header":"--","actionItem":"The Speaker designated the Honorable Mike Bost to act as Speaker pro tempore for today.","actionTimeStamp":"Wed, 10 Jul 2024 10:00:20 -0400"},{"index":16,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 10 Jul 2024 10:00:00 -0400"}]}