{"retrieved-date":"2025-11-27","actions-date":"Thursday, November 20, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, November 20)","actionItem":"H.R. 970 (Rep. Strickland):\n        A bill to amend title 38, United States Code, to require the Secretary of Veterans Affairs to periodically review the automatic maximum coverage under the Servicemembers' Group Life Insurance program and the Veterans' Group Life Insurance program, and for other purposes.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n H.R. 983 (Rep. Van Orden):\n        A bill to Amend title 38, United States Code, to direct the Secretary of Veterans Affairs to disapprove courses of education offered by a public institution of higher learning that does not charge the in-State tuition rate to a veteran using certain educational assistance under title 10 of such Code, and for other purposes.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n H.R. 1912 (Rep. Connolly):\n        A bill to amend title 38, United States Code, to improve the repayment by the Secretary of Veterans Affairs of benefits misused by a fiduciary, and for other purposes.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n H.J.Res. 130 (Rep. Hageman):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Bureau of Land Management relating to \"Buffalo Field Office Record of Decision and Approved Resource Management Plan Amendment\".\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 51 - 43. Record Vote Number: 623 \n\n\n        -- Message on Senate action sent to the House.\n\n\n H.J.Res. 133 (Rep. Aderholt):\n        A joint resolution requesting the Secretary of the Interior to authorize unique and one-time arrangements for displays on the National Mall and the Washington Monument during the period beginning on December 31, 2025, and ending on January 5, 2026.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S. 222 (Sen. Marshall):\n        A bill to amend the Richard B. Russell National School Lunch Act to allow schools that participate in the school lunch program to serve whole milk, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S. 351 (Sen. Capito):\n        A bill to establish a pilot grant program to improve recycling accessibility, to require the Administrator of the Environmental Protection Agency to carry out certain activities to collect and disseminate data on recycling and composting programs in the United States, and for other purposes.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n        -- Message on Senate action sent to the House.\n\n\n S. 1318 (Sen. Moran):\n        A bill to direct the American Battle Monuments Commission to establish a program to identify American-Jewish servicemembers buried in United States military cemeteries overseas under markers that incorrectly represent their religion and heritage, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S. 2110 (Sen. Merkley):\n        A bill to require the Administrator of the Environmental Protection Agency to prepare a report on reuse and refill systems, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S. 2379 (Sen. Cornyn):\n        A bill to amend the State Justice Institute Act of 1984 to authorize the State Justice Institute to provide awards to certain organizations to establish a State judicial threat intelligence and resource center.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S.J.Res. 89 (Sen. Lummis):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Bureau of Land Management relating to \"Buffalo Field Office Record of Decision and Approved Resource Management Plan Amendment\".\n\n        -- Indefinitely postponed by Senate by Unanimous Consent.\n\n\n S.Res. 489 (Sen. Hyde-Smith):\n        A resolution commending Delta State University in Cleveland, Mississippi, for 100 years of service to the State of Mississippi and the United States.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 513 (Sen. Cramer):\n        A resolution designating November 22, 2025, as National Adoption Day and November 2025 as National Adoption Month to promote national awareness of adoption and the children awaiting families, celebrating children and families involved in adoption, and encouraging the people of the United States to secure safety, permanency, and well-being for all children.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 514 (Sen. Shaheen):\n        A resolution designating November 2025 as \"American Diabetes Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 515 (Sen. Padilla):\n        A resolution congratulating the Los Angeles Dodgers for winning the 2025 Major League Baseball World Series.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, November 20)","actionItem":"PN291-3:\n        Col. Henry R. Jeffress III, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN432:\n        Col. William J. Creeden, in the Air Force, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN448:\n        70 nominations in the Air Force beginning with Darrick J. Beckman and ending with April L. Woody\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN468:\n        Brig. Gen. David W. May, in the Air Force, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN474:\n        Vice Adm. Richard A. Correll, in the Navy, to be Admiral\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN520-1:\n        David A. Bragdon, of North Carolina, to be United States District Judge for the Middle District of North Carolina\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN520-2:\n        Lindsey Ann Freeman, of North Carolina, to be United States District Judge for the Middle District of North Carolina\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN556-6:\n        Lt. Gen. Christopher O. Mohan, in the Army, to be Lieutenant General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN611:\n        Col. Michael P. Flaherty, in the Army, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN613:\n        3 nominations in the Army beginning with Col. Christopher B. Creaghe and ending with Col. Caroline R. Pogge\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN625:\n        2 nominations in the Army beginning with Col. Jonathan W. Bennett and ending with Col. Susan M. Gannon\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN626:\n        Col. Ryan J. Nielsen, in the Army, to be Brigadier General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN627:\n        Kristen D. Shadden, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN628:\n        Ana I.L. Jacinto, in the Air Force, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN629:\n        Joshua N. Payne, in the Air Force, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN630:\n        Elmo M. Clonch, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN631:\n        Robert J. Miller, in the Army, to be Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN632:\n        Eric J. O'Connor, in the Army, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN633:\n        Brandon S. Wood, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN634:\n        3 nominations in the Army beginning with Matthew L. Altenberg and ending with Kyle R. Weinerth\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN635:\n        2 nominations in the Army beginning with Gregory L. Davis and ending with Matthew D. Sharp\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN636:\n        4 nominations in the Army beginning with Dustin J. Drewry and ending with David E. Ramirez\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN637:\n        Bolivar G. Molina, in the Army, to be Major\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN638:\n        56 nominations in the Army beginning with Benjamin A. Accinelli and ending with 0002572958\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN639:\n        6 nominations in the Army beginning with Gary L. Barr and ending with Harry R. Wille III\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN640:\n        2 nominations in the Army beginning with Vincentanthony S. Guerrero and ending with Anthony T. Sevier\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN641:\n        Stephanie N. Sokol, in the Marine Corps, to be Lieutenant Colonel\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN642:\n        796 nominations in the Marine Corps beginning with Lucas H. Aaron and ending with Marc L. Zimkiewicz\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN643:\n        4 nominations in the Navy beginning with Jeffrey M. Tessier and ending with Diane M. Rogers\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN644:\n        2 nominations in the Space Force beginning with Dominique S. Keys and ending with Patrick R. Meissner\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN647:\n        Brig. Gen. Richard W. Corner II, in the Army, to be Major General\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN648:\n        2 nominations in the Army beginning with Brig. Gen. Stephanie Q. Howard and ending with Brig. Gen. Jennifer A. Marrasthost\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN649:\n        Rear Adm. (lh) Benjamin G. Reynolds, in the Navy, to be Rear Admiral\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Tillis, at  4:43 p.m., the Senate adjourned, under its order of today, until 11 a.m. tomorrow.","actionTimeStamp":"--"}]}