{"retrieved-date":"2022-12-20","actions-date":"Monday, December 19, 2022","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Thursday, December 15, 2022,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Thursday, December 15, 2022, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, December 19)","actionItem":"H.R. 203 (Rep. Garcia):\n        A bill to designate the facility of the United States Postal Service located at 4020 Broadway Street in Houston, Texas, asthe \"Benny C. Martinez Post Office Building\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 441 (Rep. Young):\n        To provide for the conveyance of certain property to the Tanana Tribal Council located in Tanana, Alaska, the conveyance of certain property to the Southeast Alaska Regional Health Consortium locatedin Sitka, Alaska, and the conveyance of certain property to the Alaskan Native Tribal Health Consortium located in Anchorage, Alaska, and for otherpurposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 478 (Rep. O'Halleran):\n        A bill to direct the Secretary of the Interior to take certain land located in Pinal County, Arizona, into trust for the benefit of the Gila River Indian Community, and for other purposes.\n\n        -- Passed Senate without amendment by Voice Vote.\n\n\n H.R. 1095 (Rep. Barragan):\n        A bill to designate the facility of the United States Postal Service located at 101 South Willowbrook Avenue in Compton, California, as the \"PFC James Anderson, Jr., Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 2472 (Rep. Johnson):\n        A bill to designate the facility of the United States Postal Service located at 82422 Cadiz Jewett Road in Cadiz, Ohio, asthe \"John Armor Bingham Post Office\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 2473 (Rep. Johnson):\n        A bill to designate the facility of the United States Postal Service located at 275 Penn Avenue in Salem, Ohio, as the \"Howard Arthur Tibbs Post Office\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 4622 (Rep. Balderson):\n        A bill to designate the facility of the United States Postal Service located at 226 North Main Street in Roseville, Ohio, as the \"Ronald E. Rosser Post Office\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 4881 (Rep. Grijalva):\n        A bill to direct the Secretary of the Interior to take into trust for the Pascua Yaqui Tribe of Arizona certain land in Pima County, Arizona, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 4899 (Rep. Stauber):\n        A bill to designate the facility of the United States Postal Service located at 10 Broadway Street West, in Akeley, Minnesota, as the \"Neal Kenneth Todd Post Office\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 5271 (Rep. Cooper):\n        A bill to designate the facility of the United States Postal Service located at 2245 Rosa L Parks Boulevard in Nashville, Tennessee, as the \"Thelma Harper Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 5349 (Rep. Clyburn):\n        A bill to designate the facility of the United States Postal Service located at 1550 State Road S-38-211 in Orangeburg, South Carolina, as the \"J.I. Washington Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 5650 (Rep. Schweikert):\n        A bill to designate the facility of the United States Postal Service located at 16605 East Avenue of the Fountains in Fountain Hills, Arizona, as the \"Dr. C.T. Wright Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 5659 (Rep. Brownley):\n        A bill to designate the facility of the United States Postal Service located at 1961 North C Street in Oxnard, California,as the \"John R. Hatcher III Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 5794 (Rep. Doyle):\n        A bill to designate the facility of the United States Postal Service located at 850 Walnut Street in McKeesport, Pennsylvania, as the \"First Sergeant Leonard A. Funk, Jr. Post Office Building\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 5865 (Rep. Green):\n        A bill to designate the facility of the United States Postal Service located at 4110 Bluebonnet Drive in Stafford, Texas, as the \"Leonard Scarcella Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 5900 (Rep. Gomez):\n        A bill to designate the facility of the United States Postal Service located at 2016 East 1st Street in Los Angeles, California, as the \"Marine Corps Reserve PVT Jacob Cruz Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 5952 (Rep. Fischbach):\n        A bill to designate the facility of the United States Postal Service located at 123 East Main Street, in Vergas, Minnesota, as the \"Jon Glawe Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6042 (Rep. Mace):\n        To designate the facility of the United States Postal Service located at 213 William Hilton Parkway in Hilton Head Island,South Carolina, as the \"Caesar H. Wright Jr. Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6064 (Rep. Nehls):\n        A bill to direct the Secretary of Veterans Affairsto seek to enter into an agreement with the National Academies of Sciences,Engineering, and Medicine for a review of examinations, furnished by the Secretary, to individuals who submit claims to the Secretary for compensation under chapter 11 of title 38, United States Code, for mental and physical conditions linked to military sexual trauma.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6080 (Rep. Hill):\n        A bill to designate the facility of the United States Postal Service located at 5420 Kavanaugh Boulevard in Little Rock, Arkansas, as the \"Ronald A. Robinson Post Office\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6218 (Rep. Emmer):\n        A bill to designate the facility of the United States Postal Service located at 317 Blattner Drive in Avon, Minnesota, as the \"W.O.C. Kort Miller Plantenberg Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6220 (Rep. Fischbach):\n        A bill to designate the facility of the United States Postal Service located at 100 3rd Avenue Northwest in Perham, Minnesota, as the \"Charles P. Nord Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6221 (Rep. Fischbach):\n        A bill to designate the facility of the United States Postal Service located at 155 Main Avenue West in Winsted, Minnesota, as the \"James A. Rogers Jr. Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6267 (Rep. Jones):\n        A bill to designate the facility of the United States Postal Service located at 15 Chestnut Street in Suffern, New York, as the \"Sergeant Gerald T. 'Jerry' Donnellan Post Office\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6386 (Rep. Krishnamoorthi):\n        A bill to designate the facility of the United States Postal Service located at 450 West Schaumburg Road in Schaumburg, Illinois, as the \"Veterans of Iraq and Afghanistan Memorial Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6427 (Rep. Johnson):\n        A bill to amend the Red River National Wildlife Refuge Act to modify the boundary of the Red River National Wildlife Refuge, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6604 (Rep. Buchanan):\n        A bill to amend title 38, United States Code, to improve the method by which the Secretary of Veterans Affairs determines the effects of a closure or disapproval of an educational institution on individuals who do not transfer credits from such institution.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6630 (Rep. Kim):\n        A bill to designate the facility of the United States Postal Service located at 1400 N Kraemer Blvd. in Placentia, California, as the \"PFC Jang Ho Kim Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6917 (Rep. Casten):\n        A bill to designate the facility of the United States Postal Service located at 301 East Congress Parkway in Crystal Lake,Illinois, as the \"Ryan J. Cummings Post Office Building\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 6961 (Rep. Mrvan):\n        A bill to amend title 38, United States Code, to improve hearings before the Board of Veterans' Appeals regarding claims involving military sexual trauma.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7299 (Rep. Mrvan):\n        A bill to require the Secretary of Veterans Affairs to obtain an independent cybersecurity assessment of information systems of the Department of Veterans Affairs, and for other purposes.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7335 (Rep. Luria):\n        A bill to improve coordination between the Veterans Health Administration and the Veterans Benefits Administration with respect to claims for compensation arising from military sexual trauma, and for other purposes.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7514 (Rep. Kelly):\n        A bill to designate the facility of the United States Postal Service located at 345 South Main Street in Butler, Pennsylvania, as the \"Andrew Gomer Williams Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7518 (Rep. Levin):\n        A bill to designate the facility of the United States Postal Service located at 23200 John R Road in Hazel Park, Michigan,as the \"Roy E. Dickens Post Office\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7519 (Rep. Levin):\n        A bill to designate the facility of the United States Postal Service located at 2050 South Boulevard in Bloomfield Township, Michigan, as the \"Dr. Ezra S. Parke Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7638 (Rep. Franklin):\n        A bill to designate the facility of the United States Postal Service located at 6000 South Florida Avenue in Lakeland, Florida, as the \"U.S. Marine Corporal Ronald R. Payne Jr. Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7735 (Rep. Bost):\n        A bill to direct the Secretary of Veterans Affairsto update the appraisal requirements for certain loans guaranteed by the Department of Veterans Affairs, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 8025 (Rep. Omar):\n        A bill to designate the facility of the United States Postal Service located at 100 South 1st Street in Minneapolis, Minnesota, as the \"Martin Olav Sabo Post Office\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 8026 (Rep. Omar):\n        A bill to designate the facility of the United States Postal Service located at 825 West 65th Street in Minneapolis, Minnesota, as the \"Charles W. Lindberg Post Office\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 8203 (Rep. Doggett):\n        A bill to designate the facility of the United States Postal Service located at 651 Business Interstate Highway 35 North Suite 420 in New Braunfels, Texas, as the \"Bob Krueger Post Office\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 8226 (Rep. Craig):\n        A bill to designate the facility of the United States Postal Service located at 236 Concord Exchange North in South Saint Paul, Minnesota, as the \"Officer Leo Pavlak Post Office Building\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 8260 (Rep. Pappas):\n        A bill to amend title 38, United States Code, to shorten the timeframe for designation of benefits under Department of Veterans Affairs life insurance programs, to improve the treatment of undisbursed life insurance benefits by the Department of Veterans Affairs, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 9308 (Rep. Jacobs):\n        A bill to designate the facility of the United States Postal Service located at 6401 El Cajon Boulevard in San Diego, California, as the \"Susan A. Davis Post Office\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 365 (Sen. Blackburn):\n        A bill to amend title 18, United States Code, to require a provider of a report to the CyberTipline related to online sexualexploitation of children to preserve the contents of such report for 180 days, and for other purposes.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6548 (Sen. Blackburn):\n        In the nature of a substitute.\n\n        --Amendment SA 6548 proposed by Senator Kelly for Senator Blackburn.\n\n        --Amendment SA 6548 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 989 (Sen. Schatz):\n        A bill to establish a Native American language resource center in furtherance of the policy set forth in the Native American Languages Act.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute withdrawn by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Voice Vote.\n \n\n S.Amdt. 6545 (Sen. Schatz):\n        In the nature of a substitute.\n\n        --Amendment SA 6545 proposed by Senator Schatz.\n\n        --Amendment SA 6545 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 1402 (Sen. Schatz):\n        A bill to amend the Native American Languages Act to ensure the survival and continuing vitality of Native American languages, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Voice Vote.\n \n\n S.Amdt. 6544 (Sen. Schatz):\n        In the nature of a substitute.\n\n        --Amendment SA 6544 proposed by Senator Schatz.\n\n        --Amendment SA 6544 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 1466 (Sen. Merkley):\n        A bill to authorize the Director of the United States Geological Survey to establish a regional program to assess, monitor, and benefit the hydrology of saline lakes in the Great Basin and the migratory birds and other wildlife dependent on those habitats, and for other purposes.\n\n        -- Senate agreed to the House amendment to S. 1466 by Unanimous Consent.\n\n\n S. 3168 (Sen. Kelly):\n        A bill to amend the White Mountain Apache Tribe Water Rights Quantification Act of 2010 to modify the enforceability date for certain provisions, and for other purposes.\n\n        -- Committee on Indian Affairs. Reported by Senator Schatz with an amendment in the nature of a substitute. Without written report.\n\n        -- Placed on Senate Legislative Calendar under General Orders. Calendar No. 683.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute withdrawn by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6546 (Sen. Schatz):\n        In the nature of a substitute.\n\n        --Amendment SA 6546 proposed by Senator Schatz.\n\n        --Amendment SA 6546 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 3308 (Sen. Kelly):\n        A bill to authorize the Colorado River Indian Tribes to enter into lease or exchange agreements and storage agreements relating to water of the Colorado River allocated to the Colorado River Indian Tribes, and for other purposes.\n\n        -- Committee on Indian Affairs. Reported by Senator Schatz with an amendment in the nature of a substitute. Without written report.\n\n        -- Placed on Senate Legislative Calendar under General Orders. Calendar No. 682.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 3388 (Sen. Tester):\n        A bill to amend title 38, United States Code, to improve benefits administered by the Secretary of Veterans Affairs, and forother purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6550 (Sen. Tester):\n        In the nature of a substitute.\n\n        --Amendment SA 6550 proposed by Senator Kelly for Senator Tester.\n\n        --Amendment SA 6550 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 4104 (Sen. Sinema):\n        A bill to approve the settlement of water rights claims of the Hualapai Tribe and certain allottees in the State of Arizona,to authorize construction of a water project relating to those water rightsclaims, and for other purposes.\n\n        -- Committee on Indian Affairs. Reported by Senator Schatz with amendments. Without written report.\n\n        -- Placed on Senate Legislative Calendar under General Orders. Calendar No. 684.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute withdrawn by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6547 (Sen. Schatz):\n        In the nature of a substitute.\n\n        --Amendment SA 6547 proposed by Senator Schatz.\n\n        --Amendment SA 6547 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 4411 (Sen. Cruz):\n        A bill to designate the facility of the United States Postal Service located at 5302 Galveston Road in Houston, Texas, as the \"Vanessa Guillen Post Office Building\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 4719 (Sen. Grassley):\n        A bill to protect children against sexual abuse and exploitation, and for other purposes.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6549 (Sen. Grassley):\n        In the nature of a substitute.\n\n        --Amendment SA 6549 proposed by Senator Kelly for Senator Grassley.\n\n        --Amendment SA 6549 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 4949 (Sen. Tester):\n        A bill to amend title 38, United States Code, to address green burial sections in national cemeteries, and for other purposes.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 4978 (Sen. Barrasso):\n        A bill to amend the Public Health Service Act to reauthorize the State offices of rural health program.\n\n        -- Senate Committee on Health, Education, Labor, and Pensions discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 6551 (Sen. Barrasso):\n        In the nature of a substitute.\n\n        --Amendment SA 6551 proposed by Senator Kelly for Senator Barrasso.\n\n        --Amendment SA 6551 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 874 (Sen. Cassidy):\n        A resolution expressing the sense of the Senate that the activities of transnational criminal organizations, including the use of illicit economies, illicit trade, and trade-based money laundering, pose a risk to the interests of the United States and allies and partners of the United States around the world.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Monday, December 19)","actionItem":"PN2386:\n        Kimberly Ann McClain, of Maryland, to be an Assistant Secretary of Housing and Urban Development\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2665:\n        Travis Hill, of Maryland, to be a Member of the Board of Directors of the Federal Deposit Insurance Corporation for a term of six years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2666:\n        Travis Hill, of Maryland, to be Vice Chairperson of the Board of Directors of the Federal Deposit Insurance Corporation\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2667:\n        Jonathan McKernan, of Tennessee, to be a Member ofthe Board of Directors of the Federal Deposit Insurance Corporation for theremainder of the term expiring May 31, 2024\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2692:\n        Martin J. Gruenberg, of Maryland, to be a Member of the Board of Directors of the Federal Deposit Insurance Corporation for a term of six years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 45 - 39. Record Vote Number: 400 \n\n\n\n PN2693:\n        Martin J. Gruenberg, of Maryland, to be Chairperson of the Board of Directors of the Federal Deposit Insurance Corporation for a term of five years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  1:26 a.m, the Presiding Officer (Mr. Padilla in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}