{"retrieved-date":"2023-1-6","actions-date":"Fri, 06 Jan 2023 15:22:55 -0500","actions-title":"House Floor Proceedings","actions-count":12,"actions-list":[{"index":1,"header":"On motion to adjourn Roll Call 17","actionItem":"Yea and Nay vote pending.","actionTimeStamp":"Fri, 06 Jan 2023 15:22:55 -0500"},{"index":2,"header":"--","actionItem":"Mr. Scalise moved that the House do now adjourn.","actionTimeStamp":"Fri, 06 Jan 2023 15:22:50 -0500"},{"index":3,"header":"ANNOUCEMENT OF RESULT OF ROLL CALL 16","actionItem":"The Clerk announced that no persons having received a majority of the whole number of votes cast by surname in the Election of the Speaker, a Speaker was not elected.","actionTimeStamp":"Fri, 06 Jan 2023 15:22:06 -0500"},{"index":4,"header":"NOMINATIONS FOR OFFICE OF SPEAKER","actionItem":"Pursuant to law and precedent, the Clerk directed the Reading Clerk to call the roll for the Election of the Speaker. Accordingly, the Honorable James Comer of Kentucky placed the name of the Honorable Kevin McCarthy into nomination for the Office of Speaker, and the Honorable Veronica Escobar of Texas placed the name of the Honorable Hakeem S. Jeffries into nomination for the Office of Speaker. No other nominations were put forward.","actionTimeStamp":"Fri, 06 Jan 2023 13:57:55 -0500"},{"index":5,"header":"ANNOUCEMENT OF RESULT OF ROLL CALL 15","actionItem":"The Clerk announced that no persons having received a majority of the whole number of votes cast by surname in the Election of the Speaker, a Speaker was not elected.","actionTimeStamp":"Fri, 06 Jan 2023 13:56:47 -0500"},{"index":6,"header":"Roll call 15","actionItem":"Election of the Speaker. Mr. McCarthy 213, Mr. Jeffries 211, Mr. Jordan 4, and Mr. Hern 3 (Roll no. 15).","actionTimeStamp":"Fri, 06 Jan 2023 13:56:45 -0500"},{"index":7,"header":"NOMINATIONS FOR OFFICE OF SPEAKER","actionItem":"Pursuant to law and precedent, the Clerk directed the Reading Clerk to call the roll for the Election of the Speaker. Accordingly, the Honorable Mike Garcia of California placed the name of the Honorable Kevin McCarthy into nomination for the Office of Speaker, the Honorable James E. Clyburn of South Carolina placed the name of the Honorable Hakeem S. Jeffries into nomination for the Office of Speaker, the Honorable Matt Gaetz of Florida placed the name of the Honorable Jim Jordan into nomination for the Office of Speaker, and the Honorable Lauren Boebert placed the name of the Honorable Kevin Hern into nomination for the Office of Speaker. No other nominations were put forward.","actionTimeStamp":"Fri, 06 Jan 2023 12:09:25 -0500"},{"index":8,"header":"POINT OF NO QUORUM","actionItem":"Ms. Stefanik made a point of order that a quorum was not present. Accordingly, Members-elect were counted and the Clerk announced that 275 Members-elect being counted, a quorum was present.","actionTimeStamp":"Fri, 06 Jan 2023 12:03:06 -0500"},{"index":9,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Clerk led the House in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Fri, 06 Jan 2023 12:02:25 -0500"},{"index":10,"header":"--","actionItem":"The Clerk announced approval of the Journal.","actionTimeStamp":"Fri, 06 Jan 2023 12:02:00 -0500"},{"index":11,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Fri, 06 Jan 2023 12:00:34 -0500"},{"index":12,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Fri, 06 Jan 2023 12:00:00 -0500"}]}