{"retrieved-date":"2023-10-18","actions-date":"Tue, 17 Oct 2023 18:19:47 -0400","actions-title":"House Floor Proceedings","actions-count":17,"actions-list":[{"index":1,"header":"--","actionItem":"The House adjourned pursuant to a previous special order. The next meeting is scheduled for 11:00 a.m. on October 18, 2023.","actionTimeStamp":"Tue, 17 Oct 2023 18:19:47 -0400"},{"index":2,"header":"--","actionItem":"On motion to adjourn Agreed to by voice vote.","actionTimeStamp":"Tue, 17 Oct 2023 18:19:46 -0400"},{"index":3,"header":"--","actionItem":"Mr. Hill moved that the House do now adjourn.","actionTimeStamp":"Tue, 17 Oct 2023 18:19:42 -0400"},{"index":4,"header":"--","actionItem":"Mr. Hill asked unanimous consent that when the House adjourns today, it adjourn to meet at 11:00 a.m. on October 18. Agreed to without objection.","actionTimeStamp":"Tue, 17 Oct 2023 18:19:35 -0400"},{"index":5,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of October 17.","actionTimeStamp":"Tue, 17 Oct 2023 18:19:26 -0400"},{"index":6,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is subject to the call of the Chair.","actionTimeStamp":"Tue, 17 Oct 2023 13:53:54 -0400"},{"index":7,"header":"ANNOUNCEMENT OF RESULT OF ROLL CALL 521","actionItem":"The Chair announced that no persons having received a majority of the whole number of votes cast by surname in the Election of the Speaker, a Speaker was not elected.","actionTimeStamp":"Tue, 17 Oct 2023 13:53:50 -0400"},{"index":8,"header":"Roll call 521","actionItem":"Election of the Speaker. Mr. Jordan 200, Mr. Jeffries 212, Mr. Scalise 7, Mr. McCarthy 6, Mr. Zeldin 3, Mr. Garcia, Mike 1, Mr. Emmer 1, Mr. Cole 1, and Mr. Massie 1 (Roll no. 521).","actionTimeStamp":"Tue, 17 Oct 2023 13:53:41 -0400"},{"index":9,"header":"APPOINTMENT OF TELLERS","actionItem":"The Chair announced the appointment of the following Members to act as Tellers during the Roll Call for Election of Speaker: Mr. Steil, Mr. Morelle, Mr. Loudermilk, and Ms. Sewell.","actionTimeStamp":"Tue, 17 Oct 2023 12:55:03 -0400"},{"index":10,"header":"NOMINATIONS FOR OFFICE OF SPEAKER","actionItem":"The Honorable Elise Stefanik, by direction of the Republican Conference, nominated the Honorable Jim Jordan, a Member from the State of Ohio. The Honorable Pete Aguilar, by direction of the Democratic Caucus, nominated the Honorable Hakeem Jeffries, a Member from the State of New York. No other nominations were put forward.","actionTimeStamp":"Tue, 17 Oct 2023 12:42:15 -0400"},{"index":11,"header":"ORDER OF BUSINESS-ELECTION OF THE SPEAKER","actionItem":"The Chair announced that the floor was open to receive nominations for the Office of the Speaker of the U.S. House of Representatives.","actionTimeStamp":"Tue, 17 Oct 2023 12:41:11 -0400"},{"index":12,"header":"--","actionItem":"Call of the House Quorum responded: 432 present (Roll no. 520).","actionTimeStamp":"Tue, 17 Oct 2023 12:41:06 -0400"},{"index":13,"header":"CALL OF THE HOUSE","actionItem":"Pursuant to clause 7 of rule XX, Mr. Johnson (LA) moved a call of the House. The Speaker announced that under clause 7(b) of rule XX, he conferred recognition for that purpose and that without objection, a call of the House would be ordered.","actionTimeStamp":"Tue, 17 Oct 2023 12:06:17 -0400"},{"index":14,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Ms. Kelly of IL to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Tue, 17 Oct 2023 12:05:41 -0400"},{"index":15,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Tue, 17 Oct 2023 12:05:36 -0400"},{"index":16,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Tue, 17 Oct 2023 12:03:36 -0400"},{"index":17,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Tue, 17 Oct 2023 12:00:00 -0400"}]}