{"retrieved-date":"2025-12-4","actions-date":"Thu, 04 Dec 2025 10:29:15 -0500","actions-title":"House Floor Proceedings","actions-count":16,"actions-list":[{"index":1,"header":"On passage Roll Call 314","actionItem":"Yea and Nay vote pending.","actionTimeStamp":"Thu, 04 Dec 2025 10:29:15 -0500"},{"index":2,"header":"--","actionItem":"Considered as unfinished business. H.R. 1049 — \"To ensure that parents are aware of foreign influence in their child's public school, and for other purposes.\"","actionTimeStamp":"Thu, 04 Dec 2025 10:29:06 -0500"},{"index":3,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Thu, 04 Dec 2025 10:28:33 -0500"},{"index":4,"header":"--","actionItem":"On passage Passed by the Yeas and Nays: (Roll no. 313).","actionTimeStamp":"Thu, 04 Dec 2025 10:28:32 -0500"},{"index":5,"header":"--","actionItem":"The previous question was ordered pursuant to the rule.","actionTimeStamp":"Thu, 04 Dec 2025 09:59:52 -0500"},{"index":6,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H.R. 1069.","actionTimeStamp":"Thu, 04 Dec 2025 09:28:33 -0500"},{"index":7,"header":"--","actionItem":"Rule provides for consideration of H.R. 4312, H.R. 1005, H.R. 1049, H.R. 1069, H.R. 2965 and H.R. 4305. The resolution provides for consideration of H.R. 4312, H.R. 1005, H.R. 1049, H.R. 1069, H.R. 2965, and H.R. 4305 under a closed rule with one hour of general debate and one motion to recommit on each bill.","actionTimeStamp":"Thu, 04 Dec 2025 09:27:39 -0500"},{"index":8,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 916. H.R. 1069 — \"To prohibit the availability of Federal education funds for elementary and secondary schools that receive direct or indirect support from the Government of the People's Republic of China.\"","actionTimeStamp":"Thu, 04 Dec 2025 09:27:34 -0500"},{"index":9,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair would be limited to 5 per side of the aisle.","actionTimeStamp":"Thu, 04 Dec 2025 09:14:52 -0500"},{"index":10,"header":"ADJUSTMENT OF THE WHOLE NUMBER OF THE HOUSE","actionItem":"Under Clause 5(d) of Rule XX, the Chair announced to the House that, in light of the administration of the Oath of Office to the gentleman from Tennessee, the whole number of the House is 433.","actionTimeStamp":"Thu, 04 Dec 2025 09:14:33 -0500"},{"index":11,"header":"OATH OF OFFICE","actionItem":"Representative-Elect Matt Van Epps, Seventh District, State of Tennessee, presented himself in the well of the House for the purpose of taking the Oath of Office which was administered by the Speaker of the House.","actionTimeStamp":"Thu, 04 Dec 2025 09:10:27 -0500"},{"index":12,"header":"--","actionItem":"The House received a message from the Clerk. The Clerk transmitted to the House a copy of a letter received from Mr. Mark Goins, Coordinator of Elections with the Tennessee Office of the Secretary of State, indicating that, according to the unofficial results for the Special General Election held on December 2, 2025, the Honorable Matt Van Epps was elected Representative to Congress for the Seventh Congressional District of Tennessee.","actionTimeStamp":"Thu, 04 Dec 2025 09:09:00 -0500"},{"index":13,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. DesJarlais to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 04 Dec 2025 09:07:07 -0500"},{"index":14,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Thu, 04 Dec 2025 09:07:04 -0500"},{"index":15,"header":"--","actionItem":"Today's prayer was offered by Dr. Yancey C. Arrington, Clear Creek Community Church, League City, Texas.","actionTimeStamp":"Thu, 04 Dec 2025 09:05:51 -0500"},{"index":16,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 04 Dec 2025 09:00:00 -0500"}]}