{"retrieved-date":"2024-9-13","actions-date":"Thursday, September 12, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, September 12)","actionItem":"S. 2120 (Sen. Tillis):\n        A bill to direct the Attorney General to include a data field in the National Missing and Unidentified Persons System to indicate whether the last known location of a missing person was confirmed or was suspected to have been on Federal land, and for other purposes .\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S.Res. 813 (Sen. Crapo):\n        A resolution honoring the life of Steven D. Symms, former United States Senator for the State of Idaho.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S.Res. 814 (Sen. Reed):\n        A resolution designating September 2024 as \"National Literacy Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, September 12)","actionItem":"PN1574:\n        Kevin Gafford Ritz, of Tennessee, to be United States Circuit Judge for the Sixth Circuit\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 49 - 42. Record Vote Number: 239 \n\n\n        -- By unanimous consent agreement, debate 9/16/2024.\n\n\n PN1825:\n        Mary Kathleen Costello, of Pennsylvania, to be United States District Judge for the Eastern District of Pennsylvania\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN1826:\n        Laura Margarete Provinzino, of Minnesota, to be United States District Judge for the District of Minnesota\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 54 - 41. Record Vote Number: 238","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  3:30 p.m, the Presiding Officer (Mr. Booker in the chair) declared the Senate adjourned, under its order of today, until  3 p.m. on Monday, September 16, 2024.","actionTimeStamp":"--"}]}