{"retrieved-date":"2023-5-11","actions-date":"Tuesday, May 9, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Friday, May 5, 2023,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Friday, May 5, 2023, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, May  9)","actionItem":"H.R. 346 (Rep. Stauber):\n        A bill to establish a task force on improvements for notices to air missions, and for other purposes.\n\n        -- Senate Committee on Commerce, Science, and Transportation discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 89 (Sen. Cantwell):\n        In the nature of a substitute.\n\n        --Amendment SA 89 proposed by Senator Schumer for Senator Cantwell.\n\n        --Amendment SA 89 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 157 (Sen. Menendez):\n        A resolution commemorating the 25th anniversary of the signing of the Good Friday Agreement, and for other purposes.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 204 (Sen. Lankford):\n        A resolution congratulating the University of Oklahoma women's gymnastics team for winning the 2023 National Collegiate Athletic Association championship, the program's sixth title overall.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, May  9)","actionItem":"PN93:\n        Bradley N. Garcia, of Maryland, to be United States Circuit Judge for the District of Columbia Circuit\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN148:\n        L. Felice Gorordo, of Florida, to be United States Alternate Executive Director of the International Bank for Reconstruction and Development for a term of two years\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 42. Record Vote Number: 116 \n\n\n        -- By unanimous consent agreement, debate 5/10/2023.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  7:31 p.m, the Presiding Officer (Mr. Kelly in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}