{"retrieved-date":"2024-8-16","actions-date":"Fri, 16 Aug 2024 11:06:06 -0400","actions-title":"House Floor Proceedings","actions-count":17,"actions-list":[{"index":1,"header":"--","actionItem":"The Speaker announced that the House do now adjourn pursuant to section 3(z) of H. Res. 5. The next meeting is scheduled for 2:00 p.m. on August 20, 2024.","actionTimeStamp":"Fri, 16 Aug 2024 11:06:06 -0400"},{"index":2,"header":"--","actionItem":"The House received a communication from Carlos Cameron, District Director, Representative Hal Rogers. Pursuant to Rule VIII of the Rules of the House of Representatives, Mr. Cameron notified the House he had been served with a subpoena for testimony in a criminal trial issued by the United States District Court for the Eastern District of Kentucky and that after consultation with the Office of General Counsel, he had determined that compliance with the subpoena is consistent with the privileges and rights of the House.","actionTimeStamp":"Fri, 16 Aug 2024 11:05:42 -0400"},{"index":3,"header":"--","actionItem":"The House received a communication from Danielle Smoot, Communications Director, Representative Hal Rogers. Pursuant to Rule VIII of the Rules of the House of Representatives, Ms. Smoot notified the House she had been served with a subpoena for testimony in a criminal trial issued by the United States District Court for the Eastern District of Kentucky and that after consultation with the Office of General Counsel, she had determined that compliance with the subpoena is consistent with the privileges and rights of the House.","actionTimeStamp":"Fri, 16 Aug 2024 11:05:12 -0400"},{"index":4,"header":"--","actionItem":"The House received a communication from Stacey Matthews, Caseworker, Representative Hal Rogers. Pursuant to Rule VIII of the Rules of the House of Representatives, Ms. Matthews notified the House she had been served with a subpoena for testimony in a criminal trial issued by the United States District Court for the Eastern District of Kentucky and that after consultation with the Office of General Counsel, she had determined that compliance with the subpoena is consistent with the privileges and rights of the House.","actionTimeStamp":"Fri, 16 Aug 2024 11:05:01 -0400"},{"index":5,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Fri, 16 Aug 2024 11:03:42 -0400"},{"index":6,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Fri, 16 Aug 2024 11:03:40 -0400"},{"index":7,"header":"--","actionItem":"Considered by unanimous consent. H. Con. Res. 126 — \"The title of this measure is not available.\"","actionTimeStamp":"Fri, 16 Aug 2024 11:03:31 -0400"},{"index":8,"header":"--","actionItem":"Without objection, the Chair laid before the House H. Con. Res. 126.","actionTimeStamp":"Fri, 16 Aug 2024 11:03:30 -0400"},{"index":9,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Fri, 16 Aug 2024 11:03:23 -0400"},{"index":10,"header":"--","actionItem":"On agreeing to the resolution Agreed to without objection.","actionTimeStamp":"Fri, 16 Aug 2024 11:03:21 -0400"},{"index":11,"header":"--","actionItem":"Considered by unanimous consent. H. Con. Res. 124 — \"Authorizing the use of Emancipation Hall in the Capitol Visitor Center for a ceremony to present the Congressional Gold Medals awarded under the Hidden Figures Congressional Gold Medal Act.\"","actionTimeStamp":"Fri, 16 Aug 2024 11:03:12 -0400"},{"index":12,"header":"--","actionItem":"Without objection, the Chair laid before the House H. Con. Res. 124.","actionTimeStamp":"Fri, 16 Aug 2024 11:03:11 -0400"},{"index":13,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair led the House in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Fri, 16 Aug 2024 11:03:00 -0400"},{"index":14,"header":"SPEAKER'S APPROVAL OF THE JOURNAL","actionItem":"Pursuant to section 3(z) of H. Res. 5, the Journal of the last day's proceedings was approved.","actionTimeStamp":"Fri, 16 Aug 2024 11:02:37 -0400"},{"index":15,"header":"--","actionItem":"Today's prayer was offered by Reverend Rachel Landers Vaagenes, Capitol Hill Presbyterian Church, Washington, D.C.","actionTimeStamp":"Fri, 16 Aug 2024 11:00:42 -0400"},{"index":16,"header":"--","actionItem":"The Speaker designated the Honorable Larry Bucshon to act as Speaker pro tempore for today.","actionTimeStamp":"Fri, 16 Aug 2024 11:00:23 -0400"},{"index":17,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Fri, 16 Aug 2024 11:00:00 -0400"}]}