{"retrieved-date":"2025-5-6","actions-date":"Monday, May 5, 2025","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Thursday, May 1, 2025,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Thursday, May 1, 2025, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, May  5)","actionItem":"H.J.Res. 61 (Rep. Griffith):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Environmental Protection Agency relating to \"National Emission Standards for Hazardous Air Pollutants: Rubber Tire Manufacturing\".\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Yea-Nay Vote. 51 - 43. Record Vote Number: 231 \n\n\n        -- Measure laid before Senate by motion.\n\n\n S.Res. 200 (Sen. Daines):\n        A resolution expressing support for the designation of May 5, 2025, as the \"National Day of Awareness for Missing and Murdered Indigenous Women and Girls\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 201 (Sen. Ernst):\n        A resolution expressing support for the designation of the week of May 4, 2025, through May 10, 2025, as \"National Small Business Week\" to celebrate the contributions of small businesses and entrepreneurs in every community in the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 202 (Sen. Markey):\n        A resolution recognizing the significance of \"Community College Month\" in April 2025 as a celebration of the more than 1,000 community colleges throughout the United States that support access to higher education, workforce training, and more, and broadly sustain and advance the economic prosperity of the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Con.Res. 12 (Sen. McConnell):\n        A concurrent resolution authorizing the use of Emancipation Hall in the Capitol Visitor Center for a ceremony to present the Congressional Gold Medal, collectively, to the United States Army Rangers Veterans of World War II.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  7:03 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}