{"retrieved-date":"2024-3-21","actions-date":"Wednesday, March 20, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, March 20)","actionItem":"S. 1332 (Sen. Hassan):\n        A bill to require the Office of Management and Budget to consider revising the Standard Occupational Classification system to establish a separate code for direct support professionals, and for other purposes.\n\n        -- Passed Senate with an amendment and an amendment to the Title by Unanimous Consent.\n\n\n S. 3648 (Sen. Peters):\n        A bill to amend the Post-Katrina Management Reform Act of 2006 to repeal certain obsolete requirements, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S.Res. 567 (Sen. Kaine):\n        A resolution recognizing the seriousness of widespread health care worker burnout in the United States and the need to strengthen health workforce well-being, and expressing support for the designation of March 18, 2024, as the inaugural \"Health Workforce Well-Being Day of Awareness\".\n\n        -- Senate Committee on Health, Education, Labor, and Pensions discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 583 (Sen. Smith):\n        A resolution recognizing the 100th anniversary of the National League of Cities and the support it provides to municipalities across the United States.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 600 (Sen. Braun):\n        A resolution recognizing the national debt as a threat to national security.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 601 (Sen. Ossoff):\n        A resolution honoring the life, bravery, and memory of Sergeant Rose Ida Lubin.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 602 (Sen. Scott, of FL):\n        A resolution designating March 16, 2024, as \"National Osceola Turkey Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 603 (Sen. Braun):\n        A resolution designating April 2024 as \"National Native Plant Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 604 (Sen. Ernst):\n        A resolution designating March 21, 2024, as \"National Women in Agriculture Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 605 (Sen. Cardin):\n        A resolution recognizing the 75th anniversary of the National Institute of Dental and Craniofacial Research and its critical role in improving the dental, oral, and craniofacial health of the United States through research, training, and the dissemination of health information.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, March 20)","actionItem":"PN1245:\n        Edward Sunyol Kiel, of New Jersey, to be United States District Judge for the District of New Jersey\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 48. Record Vote Number: 95 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 96 \n\n\n\n PN1248:\n        Eumi K. Lee, of California, to be United States District Judge for the Northern District of California\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 97 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 98","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  6:59 p.m, the Presiding Officer (Mr. Ossoff in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}