{"retrieved-date":"2025-2-20","actions-date":"Wednesday, February 19, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, February 19)","actionItem":"H.Con.Res. 11 (Rep. Stauber):\n        A concurrent resolution providing for a joint session of Congress to receive a message from the President.\n\n        -- Resolution agreed to in Senate without amendment by Unanimous Consent.\n\n\n S.Res. 53 (Sen. Young):\n        A resolution recognizing the 80th anniversary of the amphibious landing on the Japanese island of Iwo Jima during World War II and the raisings of the flag of the United States on Mount Suribachi.\n\n        -- Senate Committee on Foreign Relations discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 84 (Sen. Fetterman):\n        A resolution congratulating the Philadelphia Eagles on their victory in Super Bowl LIX in the successful 105th season of the National Football League.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 85 (Sen. Wicker):\n        A resolution congratulating the Jackson State University Tigers for winning the 2024 Celebration Bowl.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Con.Res. 7 (Sen. Graham):\n        An original concurrent resolution setting forth the congressional budget for the United States Government for fiscal year 2025 and setting forth the appropriate budgetary levels for fiscal years 2026 through 2034.\n\n        -- Considered by Senate.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, February 19)","actionItem":"PN11-18:\n        Kelly Loeffler, of Georgia, to be Administrator of the Small Business Administration\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 46. Record Vote Number: 59","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  7:49 p.m, the Presiding Officer (Mr. Justice in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}