{"retrieved-date":"2025-7-30","actions-date":"Tuesday, July 29, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, July 29)","actionItem":"S. 911 (Sen. Cortez Masto):\n        A bill to amend the Omnibus Crime Control and Safe Streets Act of 1968 to include certain retired law enforcement officers in the public safety officers' death benefits program.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 1020 (Sen. Daines):\n        A bill to require the Federal Energy Regulatory Commission to extend the time period during which licensees are required to commence construction of certain hydropower projects.\n\n        -- Senate Committee on Energy and Natural Resources discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 1595 (Sen. Cornyn):\n        A bill to establish standards for trauma kits purchased using funds provided under the Edward Byrne Memorial Justice Assistance Grant Program.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 309 (Sen. Tuberville):\n        A resolution commemorating the 65th anniversary of the Marshall Space Flight Center and recognizing its continued leadership in the development of the Space Launch System and human space exploration.\n\n        -- Senate Committee on Commerce, Science, and Transportation discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 344 (Sen. Hyde-Smith):\n        A resolution observing the 20th anniversary of the date on which Hurricane Katrina devastated the Gulf Coast and recognizing the progress of efforts to rebuild the affected Gulf Coast region.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 345 (Sen. Lankford):\n        A resolution congratulating the Oklahoma City Thunder on winning the 2025 National Basketball Association Finals.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, July 29)","actionItem":"PN12-7:\n        Samuel Brown, of Nevada, to be Under Secretary of Veterans Affairs for Memorial Affairs\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 45. Record Vote Number: 446 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 54 - 44. Record Vote Number: 447 \n\n\n\n PN13-11:\n        Casey Mulligan, of Illinois, to be Chief Counsel for Advocacy, Small Business Administration\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN22-13:\n        William Kimmitt, of Virginia, to be Under Secretary of Commerce for International Trade\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII be waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 47. Record Vote Number: 442 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 47. Record Vote Number: 443 \n\n\n\n PN22-17:\n        Earl Matthews, of Virginia, to be General Counsel of the Department of Defense\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 47. Record Vote Number: 441 \n\n\n\n PN25-26:\n        Nicholas Kent, of Virginia, to be Under Secretary of Education\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN26-49:\n        David Woll, of Virginia, to be General Counsel of the Department of Housing and Urban Development\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN55-28:\n        Andrea Lucas, of Virginia, to be a Member of the Equal Employment Opportunity Commission for a term expiring July 1, 2030\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN60-14:\n        Susan Monarez, of Wisconsin, to be Director of the Centers for Disease Control and Prevention\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 47. Record Vote Number: 444 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 47. Record Vote Number: 445 \n\n\n\n PN141-30:\n        Cheryl Mason, of North Carolina, to be Inspector General, Department of Veterans Affairs\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN346-2:\n        Emil J. Bove III, of Pennsylvania, to be United States Circuit Judge for the Third Circuit\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 448","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  9:21 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}