{"retrieved-date":"2025-2-17","actions-date":"Thursday, February 13, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, February 13)","actionItem":"S. 146 (Sen. Cruz):\n        A bill to require covered platforms to remove nonconsensual intimate visual depictions, and for other purposes.\n\n        -- Senate Committee on Commerce, Science, and Transportation discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n        -- Message on Senate action sent to the House.\n\n\n S.Res. 79 (Sen. Scott, of FL):\n        A resolution honoring the memories of the victims of the senseless attack at Marjory Stoneman Douglas High School on February 14, 2018.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 80 (Sen. Rounds):\n        A resolution expressing gratitude to the Joint Congressional Committee on Inaugural Ceremonies, the Architect of the Capitol, the Sergeant at Arms, the Secretary of the Senate, law enforcement officers, emergency personnel, and volunteers for their support in making the Presidential Inauguration a success.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, February 13)","actionItem":"PN11-8:\n        Robert F. Kennedy, Jr., of California, to be Secretary of Health and Human Services\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 48. Record Vote Number: 52 \n\n\n\n PN11-9:\n        Howard Lutnick, of New York, to be Secretary of Commerce\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 45. Record Vote Number: 54 \n\n\n\n PN11-12:\n        Brooke Rollins, of Texas, to be Secretary of Agriculture\n\n        -- Cloture motion withdrawn by unanimous consent in Senate.\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 72 - 28. Record Vote Number: 53 \n\n\n\n PN11-18:\n        Kelly Loeffler, of Georgia, to be Administrator of the Small Business Administration\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 43. Record Vote Number: 55 \n\n\n        -- Considered by Senate.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Ms. Murkowski, at 3:41 p.m., the Senate adjourned, under its order of today, until  9 a.m. tomorrow.","actionTimeStamp":"--"}]}