{"retrieved-date":"2024-11-12","actions-date":"Wednesday, September 25, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the      proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday,      the morning hour being deemed expired, and the times for the recognition      of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, September      25)","actionItem":"H.R. 4190 (Rep. Trone):\n                A bill to amend title 38, United States Code, to direct the Secretary of Veterans Affairs to repay the estates of deceased beneficiaries for certain benefits paid by the Secretary and misused by fiduciaries of such beneficiaries.      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n H.R. 7189 (Rep. Bilirakis):\n                A bill to amend the Public Health Service Act to reauthorize a national congenital heart disease research, surveillance, andawareness program, and for other purposes.      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n H.R. 7777 (Rep. Luttrell):\n                A bill to increase, effective as of December 1, 2024, the rates of compensation for veterans with service-connected disabilities and the rates of dependency and indemnity compensation for thesurvivors of certain disabled veterans, and for other purposes.      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n H.R. 9747 (Rep. Cole):\n                A bill making continuing appropriations and extensions for fiscal year 2025, and for other purposes.      \n\n        --        Received in the Senate, read twice, considered, read the third time, and        passed, under the order of 9/24/24, having achieved 60 votes in the        affirmative, without amendment by Yea-Nay Vote. 78 - 18. Record Vote        Number:        255      \n\n\n        --        Message on Senate action sent to the House.      \n    \n\n H.Con.Res. 127 (Rep. Maloy):\n                A concurrent resolution authorizing the use of Emancipation Hall in the Capitol Visitor Center for the unveiling of a statue of Martha Hughes Cannon.      \n\n        --        Resolution agreed to in Senate without amendment by Unanimous Consent.      \n    \n       \n\n S.Amdt. 3299 (Sen. Hagerty):\n        To amend the title.\n\n        --          Amendment SA 3299 proposed by Senator Schumer for Senator Hagerty.        \n\n        --          Amendment SA 3299, not withstanding passage of the bill S.91, agreed to          in Senate by Unanimous Consent.        \n    \n        \n\n S. 275 (Sen. Capito):\n                A bill to require the Federal Communications Commission to establish a vetting process for prospective applicants for high-cost universal service program funding.      \n\n        --        Passed Senate with an amendment by Unanimous Consent.      \n    \n\n S. 1570 (Sen. Duckworth):\n                A bill to amend the Bottles and Breastfeeding Equipment Screening Act to require hygienic handling of breast milk and baby formula by security screening personnel of the Transportation SecurityAdministration and personnel of private security companies providing security screening, and for other purposes.      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n S. 3475 (Sen. Peters):\n                A bill to amend title 49, United States Code, to allow the Secretary of Transportation to designate an authorized operator of the commercial driver's license information system, and for other purposes.      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n S. 3698 (Sen. Moran):\n                A bill to amend title 11, District of Columbia Official Code, to revise references in such title to individuals with intellectual disabilities.      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n S. 4293 (Sen. McConnell):\n                A bill to designate the United States courthouse annex located at 310 South Main Street in London, Kentucky, as the \"Eugene E. Siler, Jr. United States Courthouse Annex\".      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n S. 4489 (Sen. Padilla):\n                A bill to designate the Federal building located at 50 United Nations Plaza in San Francisco, California, as the \"Senator Dianne Feinstein Federal Building,\" and for other purposes.      \n\n        --        Senate Committee on Environment and Public Works discharged by Unanimous        Consent.      \n\n        --        Passed Senate without amendment by Unanimous Consent.      \n    \n\n S. 5284 (Sen. Ossoff):\n                A bill to increase the penalty for prohibited provision of a phone in a correctional facility, and for other purposes.      \n\n        --        Introduced in the Senate, read twice, considered, read the third time, and        passed without amendment by Voice Vote.      \n    \n\n S. 5292 (Sen. Sullivan):\n                A bill to amend the Don Young Coast Guard Authorization Act of 2022 to modify a provision relating to the acquisitionof a Coast Guard icebreaker.      \n\n        --        Introduced in the Senate, read twice, considered, read the third time, and        passed without amendment by Voice Vote.      \n    \n\n S.Res. 805 (Sen. Shaheen):\n                A resolution commemorating the tenth anniversary of the murder of James Wright Foley and calling for the moral courage to prioritize the return of Americans held captive abroad and take all necessary efforts to deter international hostage taking and arbitrary detention.      \n\n        --        Senate Committee on Foreign Relations discharged by Unanimous Consent.      \n\n        --        Measure laid before Senate by unanimous consent.      \n\n        --        Resolution agreed to in Senate with an amendment and an amended preamble by        Unanimous Consent.      \n         \n\n S.Amdt. 3300 (Sen. Shaheen):\n        In the nature of a substitute.\n\n        --            Amendment SA 3300 proposed by Senator Schumer for Senator Shaheen.          \n\n        --            Amendment SA 3300 agreed to in Senate by Unanimous Consent.          \n        \n\n S.Amdt. 3301 (Sen. Shaheen):\n        To amend the preamble.\n\n        --            Amendment SA 3301 proposed by Senator Schumer for Senator Shaheen.          \n\n        --            Amendment SA 3301 agreed to in Senate by Unanimous Consent.          \n      \n\n    \n\n S.Res. 837 (Sen. Sanders):\n                An original resolution authorizing the President of the Senate to certify the report of the Committee on Health, Education, Labor, and Pensions of the Senate regarding the refusal of Dr. Ralph de la Torre to appear and testify before the Committee.      \n\n        --        Resolution agreed to in Senate without amendment and with a preamble by        Voice Vote.      \n    \n\n S.Res. 876 (Sen. Smith):\n                A resolution designating October 2024 as \"NationalPrincipals Month\".      \n\n        --        Submitted in the Senate, considered, and agreed to without amendment and        with a preamble by Unanimous Consent.      \n    \n\n S.Res. 877 (Sen. Shaheen):\n                A resolution designating the week of October 6, 2024, through October 12, 2024, as \"National Community Policing Week\".      \n\n        --        Submitted in the Senate, considered, and agreed to without amendment and        with a preamble by Unanimous Consent.      \n    \n\n S.Res. 878 (Sen. Wicker):\n                A resolution honoring the life, legacy, and contributions of James Earl Jones.      \n\n        --        Submitted in the Senate, considered, and agreed to without amendment and        with a preamble by Unanimous Consent.      \n    \n\n S.Res. 879 (Sen. Tester):\n                A resolution permitting the collection of clothing, toys, food, and housewares during the holiday season for charitable purposes in Senate buildings.      \n\n        --        Submitted in the Senate, considered, and agreed to without amendment by        Unanimous Consent.      \n    \n\n S.Res. 880 (Sen. Smith):\n                A resolution supporting afterschool programs and Lights On Afterschool, a national celebration of afterschool programs held on October 24, 2024.      \n\n        --        Submitted in the Senate, considered, and agreed to without amendment and        with a preamble by Unanimous Consent.      \n    \n\n S.Res. 881 (Sen. Hoeven):\n                A resolution designating October 26, 2024, as the \"Day of the Deployed\".      \n\n        --        Submitted in the Senate, considered, and agreed to without amendment and        with a preamble by Unanimous Consent.      \n    \n\n S.Res. 882 (Sen. Collins):\n                A resolution designating the week of September 23 through September 27, 2024, as \"National Clean Energy Week\".      \n\n        --        Submitted in the Senate, considered, and agreed to without amendment and        with a preamble by Unanimous Consent.      \n    \n\n S.Res. 883 (Sen. Young):\n                A resolution recognizing Big Brothers Big Sisters of America on its 120th anniversary.      \n\n        --        Submitted in the Senate, considered, and agreed to without amendment and        with a preamble by Unanimous Consent.      \n    \n\n S.Res. 884 (Sen. Hyde-Smith):\n                A resolution designating the week of September 22 through September 28, 2024, as \"Gold Star Families Remembrance Week\".      \n\n        --        Submitted in the Senate, considered, and agreed to without amendment and        with a preamble by Unanimous Consent.      \n    \n\n S.Res. 885 (Sen. Shaheen):\n                A resolution designating October 2, 2024, as \"Energy Efficiency Day\" in celebration of the economic and environmental benefits that have been driven by private sector innovation and Federal energy efficiency policies.      \n\n        --        Submitted in the Senate, considered, and agreed to without amendment and        with a preamble by Unanimous Consent.      \n    \n\n S.Res. 886 (Sen. Welch):\n                A resolution expressing support for the designation of the week of October 24, 2024, to October 31, 2024, as \"Bat Week\".      \n\n        --        Submitted in the Senate, considered, and agreed to without amendment and        with a preamble by Unanimous Consent.      \n    \n\n S.Res. 887 (Sen. Boozman):\n                A resolution expressing support for the designation of October 7 through October 12, 2024, as \"National 4-H Week\".      \n\n        --        Submitted in the Senate, considered, and agreed to without amendment and        with a preamble by Unanimous Consent.      \n    \n\n S.Res. 888 (Sen. Blackburn):\n                A resolution honoring the life of James Ralph Sasser, former Senator for the State of Tennessee.      \n\n        --        Submitted in the Senate, considered, and agreed to without amendment and        with a preamble by Unanimous Consent.      \n    \n\n S.Con.Res. 41 (Sen. Paul):\n                A concurrent resolution setting forth the congressional budget for the United States Government for fiscal year 2025 and setting forth the appropriate budgetary levels for fiscal years 2026 through 2034.      \n\n        --        Motion to proceed to consideration of measure made in Senate.      \n\n        --        Motion to proceed to consideration of measure rejected in Senate by Yea-Nay        Vote. 39 - 56. Record Vote Number:        252","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, September      25)","actionItem":"PN587:\n                2 nominations in the Foreign Service beginning with John R. Bass II and ending with Brian A. Nichols      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN923:\n                David Huitema, of Maryland, to be Director of the Office of Government Ethics for a term of five years      \n\n        --        Motion to proceed to executive session to consideration of nomination        agreed to in Senate by Voice Vote.      \n\n        --        Cloture motion presented in Senate.      \n\n        --        By unanimous consent agreement, mandatory quorum required under Rule XXII        waived.      \n    \n\n PN1623:\n                Ann C. Fisher, of South Dakota, to be a Commissioner of the Postal Regulatory Commission for a term expiring October 14, 2030      \n\n        --        Considered by Senate.      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN1624:\n                Ashley Jay Elizabeth Poling, of North Carolina, tobe a Commissioner of the Postal Regulatory Commission for a term expiring November 22, 2030      \n\n        --        Considered by Senate.      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN1743:\n                Jeffrey Samuel Arbeit, of the District of Columbia, to be a Judge of the United States Tax Court for a term of fifteen years      \n\n        --        Considered by Senate.      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN1744:\n                Cathy Fung, of California, to be a Judge of the United States Tax Court for a term of fifteen years      \n\n        --        Motion to proceed to executive session to consideration of nomination        agreed to in Senate by Voice Vote.      \n\n        --        Cloture motion presented in Senate.      \n\n        --        By unanimous consent agreement, mandatory quorum required under Rule XXII        waived.      \n    \n\n PN1745:\n                Benjamin A. Guider III, of Louisiana, to be a Judge of the United States Tax Court for a term of fifteen years      \n\n        --        Considered by Senate.      \n\n        --        Confirmed by the Senate by Voice Vote.      \n    \n\n PN1902:\n                Byron B. Conway, of Wisconsin, to be United StatesDistrict Judge for the Eastern District of Wisconsin      \n\n        --        Considered by Senate.      \n\n        --        Cloture invoked in Senate by Yea-Nay Vote. 58 - 37. Record Vote Number:        253      \n\n\n        --        Confirmed by the Senate by Yea-Nay Vote. 58 - 37. Record Vote Number:        254      \n\n    \n\n PN1903:\n                Jonathan E. Hawley, of Illinois, to be United States District Judge for the Central District of Illinois      \n\n        --        Motion to proceed to executive session to consideration of nomination        agreed to in Senate by Voice Vote.      \n\n        --        Cloture motion presented in Senate.      \n\n        --        By unanimous consent agreement, mandatory quorum required under Rule XXII        waived.      \n    \n\n PN1960:\n                April M. Perry, of Illinois, to be United States District Judge for the Northern District of Illinois      \n\n        --        Considered by Senate.      \n\n        --        Cloture motion withdrawn by unanimous consent in Senate.      \n\n        --        By unanimous consent agreement, debate and vote 11/12/2024.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at      9:48 p.m., the Senate adjourned, under its order of today, until      10 a.m. on Friday, September 27, 2024.","actionTimeStamp":"--"}]}