{"retrieved-date":"2023-6-15","actions-date":"Thu, 15 Jun 2023 09:42:04 -0400","actions-title":"House Floor Proceedings","actions-count":10,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 495, the House proceeded with 10 minutes of debate on the Hageman amendment No. 1.","actionTimeStamp":"Thu, 15 Jun 2023 09:42:04 -0400"},{"index":2,"header":"--","actionItem":"An amendment, offered by Ms. Hageman,  numbered 1 printed in Part B of House Report 118-108 to subject interpretative rules, general statements of policy, and all other agency guidance to de novo judicial review.","actionTimeStamp":"Thu, 15 Jun 2023 09:40:51 -0400"},{"index":3,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H.R. 288.","actionTimeStamp":"Thu, 15 Jun 2023 09:16:11 -0400"},{"index":4,"header":"--","actionItem":"Rule provides for consideration of H.J. Res. 44, H.R. 277, H.R. 288, H.R. 1615 and H.R. 1640. The resolution provides for consideration of H.J. Res. 44 under a closed rule with one hour of general debate and H.R. 277, H.R. 288, H.R. 1615, and H.R. 1640 under structured rules with one hour of general debate. Motion to recommit allowed on each measure. The resolution also provides that the ordering of the yeas and nays on the question of reconsideration of the vote on adoption of H. Res. 463 be considered vacated and the motion to reconsider be laid on the table.","actionTimeStamp":"Thu, 15 Jun 2023 09:14:28 -0400"},{"index":5,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 495. H.R. 288 — \"To amend title 5, United States Code, to clarify the nature of judicial review of agency interpretations of statutory and regulatory provisions.\"","actionTimeStamp":"Thu, 15 Jun 2023 09:14:23 -0400"},{"index":6,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair, would be limited to five per side of the aisle.","actionTimeStamp":"Thu, 15 Jun 2023 09:04:04 -0400"},{"index":7,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Davis of IL to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 15 Jun 2023 09:02:36 -0400"},{"index":8,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Thu, 15 Jun 2023 09:02:31 -0400"},{"index":9,"header":"--","actionItem":"Today's prayer was offered by Deacon Dan S. Borné, Diocese of Baton Rouge, Baton Rouge, Louisiana.","actionTimeStamp":"Thu, 15 Jun 2023 09:01:23 -0400"},{"index":10,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 15 Jun 2023 09:00:00 -0400"}]}