{"retrieved-date":"2023-11-10","actions-date":"Wednesday, November 8, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, November  8)","actionItem":"S. 311 (Sen. Peters):\n        A bill to correct the inequitable denial of enhanced retirement and annuity benefits to certain U.S. Customs and Border Protection Officers.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 670 (Sen. Peters):\n        A bill to improve services for trafficking victims by establishing, in Homeland Security Investigations, the Investigators Maintain Purposeful Awareness to Combat Trafficking Trauma Program and the Victim Assistance Program.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 1363 (Sen. Peters):\n        In the nature of a substitute.\n\n        --Amendment SA 1363 proposed by Senator Whitehouse for Senator Peters.\n\n        --Amendment SA 1363 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 749 (Sen. Fischer):\n        A bill to ensure that the National Advisory Council on Indian Education includes at least 1 member who is the president of a Tribal College or University and to require the Secretaries of Education and Interior to consider the National Advisory Council on Indian Education's reports in the preparation of budget materials.\n\n        -- Senate Committee on Health, Education, Labor, and Pensions discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.J.Res. 38 (Sen. Rubio):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the Federal Highway Administration relating to \"Waiver of Buy America Requirements for Electric Vehicle Chargers\".\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 50 - 48. Record Vote Number: 303 \n\n\n\n S.Res. 456 (Sen. Coons):\n        A resolution designating November 2023 as \"National College Application Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 457 (Sen. Hawley):\n        A resolution honoring the distinguished service of Captain Samuel Farmer of the United States Marine Corps and the Marines and sailors of 1st Platoon, Company G, 2nd Battalion, 1st Marine Regiment.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, November  8)","actionItem":"PN28:\n        Mark W. Libby, of Massachusetts, to be Ambassador to the Republic of Azerbaijan\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN165:\n        Monica Ramirez Almadani, of California, to be United States District Judge for the Central District of California\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 46. Record Vote Number: 304 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate 11/9/2023.\n\n\n PN174:\n        Ramon Ernesto Reyes, Jr., of New York, to be United States District Judge for the Eastern District of New York\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 48. Record Vote Number: 299 \n\n\n\n PN578:\n        Edgard D. Kagan, of Virginia, to be Ambassador to Malaysia\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN786:\n        Charlotte A. Burrows, of the District of Columbia, to be a Member of the Equal Employment Opportunity Commission for a term expiring July 1, 2028\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 47. Record Vote Number: 300 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 47. Record Vote Number: 301 \n\n\n\n PN813:\n        Brandy R. McMillion, of Michigan, to be United States District Judge for the Eastern District of Michigan\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 54 - 44. Record Vote Number: 302 \n\n\n        -- Considered by Senate.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Whitehouse, at  6:56 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}