{"retrieved-date":"2025-11-10","actions-date":"Sunday, November 9, 2025","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Sunday, November  9)","actionItem":"H.R. 5371 (Rep. Cole):\n        A bill making continuing appropriations and extensions for fiscal year 2026, and for other purposes .\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Motion to proceed to consideration of the motion to reconsider the vote by which the fifth cloture on the motion to proceed to H.R. 5371 was not invoked (Record Vote No. 573) agreed to in Senate by Voice Vote.\n\n        -- Motion by Senator Thune to reconsider the vote by which the fifth cloture on the motion to proceed to H.R. 5371 was not invoked (Record Vote No. 573) agreed to in Senate by Voice Vote.\n\n        -- Upon reconsideration, the fifth cloture motion on the motion to proceed to the measure invoked in Senate by Yea-Nay Vote. 60 - 40. Record Vote Number: 610 \n\n\n\n S. 778 (Sen. Rosen):\n        A bill to amend title 38, United States Code, to require a lactation space in each medical center of the Department of Veterans Affairs.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S. 2392 (Sen. Moran):\n        A bill to increase, effective as of December 1, 2025, the rates of compensation for veterans with service-connected disabilities and the rates of dependency and indemnity compensation for the survivors of certain disabled veterans, and for other purposes .\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 124 (Sen. Blumenthal):\n        A resolution recognizing the 250th anniversary of the United States Marine Corps.\n\n        -- Senate Committee on Armed Services discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and an amended preamble by Unanimous Consent.\n \n\n S.Amdt. 3936 (Sen. Blumenthal):\n        To include the liberation of Helmand Province in the list of historic battles where United States Marines served .\n\n        --Amendment SA 3936 proposed by Senator Blumenthal.\n\n        --Amendment SA 3936 agreed to in Senate by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at 11:15 p.m., the Senate adjourned, under its order of today, until 11 a.m. tomorrow.","actionTimeStamp":"--"}]}