{"retrieved-date":"2024-6-12","actions-date":"Tuesday, June 11, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Friday, June 7, 2024,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Friday, June 7, 2024, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, June 11)","actionItem":"H.R. 4581 (Rep. Hinson):\n        A bill to amend title V of the Social Security Act to support stillbirth prevention and research, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 713 (Sen. Coons):\n        A resolution designating May 2024 as \"ALS Awareness Month\".\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 727 (Sen. Daines):\n        A resolution designating June 2024 as \"Great Outdoors Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 728 (Sen. Britt):\n        A resolution commending the University of South Alabama on the occasion of its 60th anniversary and its years of service to the State of Alabama and the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, June 11)","actionItem":"PN1470:\n        David Rosner, of Massachusetts, to be a Member of the Federal Energy Regulatory Commission for a term expiring June 30, 2027\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 67 - 24. Record Vote Number: 191 \n\n\n        -- By unanimous consent agreement, debate 6/12/2024.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Kelly, at  6:50 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}