{"retrieved-date":"2025-3-7","actions-date":"Wednesday, March 5, 2025","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, March  5)","actionItem":"S. 331 (Sen. Cassidy):\n        A bill to amend the Controlled Substances Act with respect to the scheduling of fentanyl-related substances, and for other purposes.\n\n        -- Motion to proceed to measure considered in Senate.\n\n\n S. 524 (Sen. Cruz):\n        A bill to authorize appropriations for the Coast Guard, and for other purposes.\n\n        -- Senate Committee on Commerce, Science, and Transportation discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.J.Res. 28 (Sen. Ricketts):\n        A joint resolution disapproving the rule submitted by the Bureau of Consumer Financial Protection relating to \"Defining Larger Participants of a Market for General-Use Digital Consumer Payment Applications\".\n\n        -- Considered by Senate.\n\n        -- Passed Senate without amendment by Yea-Nay Vote. 51 - 47. Record Vote Number: 106 \n\n\n\n S.Res. 115 (Sen. Lankford):\n        A resolution relating to the death of the Honorable David Lyle Boren, former Senator for the State of Oklahoma .\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, March  5)","actionItem":"PN12-5:\n        Todd Blanche, of Florida, to be Deputy Attorney General\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII be waived.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 46. Record Vote Number: 104 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 46. Record Vote Number: 105","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Curtis, at  7:13 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}