{"retrieved-date":"2025-1-6","actions-date":"Mon, 06 Jan 2025 12:04:24 -0500","actions-title":"House Floor Proceedings","actions-count":8,"actions-list":[{"index":1,"header":"--","actionItem":"The Speaker announced that the House do now recess. today. The next meeting is scheduled for approximately 12:55 P.M. today.","actionTimeStamp":"Mon, 06 Jan 2025 12:04:24 -0500"},{"index":2,"header":"APPOINTMENT OF TELLERS","actionItem":"Pursuant to S. Con. Res. 2, 119th Congress, and the order of the House of January 3, 2025, the Chair announced the Speaker's appointment of tellers on the part of the House to count the electoral votes: Mr. Steil of Wisconsin and Mr. Morelle of New York.","actionTimeStamp":"Mon, 06 Jan 2025 12:04:08 -0500"},{"index":3,"header":"--","actionItem":"The House received a message from the Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Representatives, the Clerk notified the House that he had received the following message from the Secretary of the Senate on January 6, 2025, at 11:09 a.m.: That the Senate agreed to S. Res. 2, S. Res. 5, S. Res. 10, and S. Res. 13.","actionTimeStamp":"Mon, 06 Jan 2025 12:03:30 -0500"},{"index":4,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Taylor to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Mon, 06 Jan 2025 12:02:51 -0500"},{"index":5,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Mon, 06 Jan 2025 12:02:41 -0500"},{"index":6,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Mon, 06 Jan 2025 12:01:05 -0500"},{"index":7,"header":"--","actionItem":"The Speaker designated the Honorable Thomas P. Tiffany to act as Speaker pro tempore for today.","actionTimeStamp":"Mon, 06 Jan 2025 12:00:43 -0500"},{"index":8,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Mon, 06 Jan 2025 12:00:00 -0500"}]}