{"retrieved-date":"2023-7-27","actions-date":"Tuesday, July 25, 2023","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Friday, July 21, 2023,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Friday, July 21, 2023, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, July 25)","actionItem":"H.Con.Res. 57 (Rep. Pfluger):\n        A concurrent resolution expressing the sense of Congress supporting the State of Israel.\n\n        -- Senate Committee on Foreign Relations discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment by Unanimous Consent.\n\n\n S. 2226 (Sen. Reed):\n        An original bill to authorize appropriations for fiscal year 2024 for military activities of the Department of Defense, for military construction, and for defense activities of the Department of Energy, to prescribe military personnel strengths for such fiscal year, and for other purposes.\n\n        -- Considered by Senate.\n \n\n S.Amdt. 813 (Sen. Rounds):\n        To amend the Defense Production Act of 1950 to include the Secretary of Agriculture on the Committee on Foreign Investment in the United States and require review of certain agricultural transactions.\n\n        --Amendment SA 813 proposed by Senator Rounds to Amendment SA 935.\n\n        --Amendment SA 813 under the order of 7/20/2023, having achieved 60 votes in the affirmative, was agreed to in Senate by Yea-Nay Vote. 91 - 7. Record Vote Number: \n\n\n S.Amdt. 931 (Sen. Cornyn):\n        To provide for an investment screening mechanism relating to covered sectors.\n\n        --Amendment SA 931 proposed by Senator Cornyn to Amendment SA 935.\n\n        --Amendment SA 931 under the order of 7/20/2023, having achieved 60 votes in the affirmative, was agreed to in Senate by Yea-Nay Vote. 91 - 6. Record Vote Number: \n\n\n S.Amdt. 935 (Sen. Reed):\n        In the nature of a substitute.\n\n        --Considered by Senate.\n\n\n S.Amdt. 936 (Sen. Schumer):\n        To add an effective date.\n\n        --Considered by Senate.\n\n\n\n\n S.Res. 308 (Sen. Shaheen):\n        A resolution recognizing the historic significance of the 30th anniversary of the founding of the Department of Defense State Partnership Program.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 309 (Sen. Stabenow):\n        A resolution recognizing the importance of the blueberry industry to the United States and designating July 2023 as \"National Blueberry Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at 11:10 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}