{"retrieved-date":"2025-10-16","actions-date":"Wednesday, October 15, 2025","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, October 15)","actionItem":"H.R. 5371 (Rep. Cole):\n        A bill making continuing appropriations and extensions for fiscal year 2026, and for other purposes .\n\n        -- Motion to proceed to consideration of measure made in Senate.\n\n        -- Motion to proceed to consideration of measure agreed to in Senate by Voice Vote.\n\n        -- Motion by Senator Murkowski to reconsider the vote by which the third cloture on the motion to proceed to the measure was not invoked (Record Vote No. 558) agreed to in Senate by Voice Vote.\n\n        -- Upon reconsideration, the third cloture on the motion to proceed to the measure not invoked in Senate by Yea-Nay Vote. 51 - 44. Record Vote Number: 572 \n\n\n\n S.Res. 449 (Sen. Coons):\n        A resolution designating the week beginning on October 12, 2025, as \"National Wildlife Refuge Week\".\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 452 (Sen. Grassley):\n        A resolution designating the week beginning October 19, 2025, as \"National Character Counts Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 453 (Sen. Collins):\n        A resolution designating the week beginning September 7, 2025, as \"National Direct Support Professionals Week\" .\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Thune, at  6:47 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}