{"retrieved-date":"2023-5-12","actions-date":"Wednesday, May 10, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, May 10)","actionItem":"S.Res. 23 (Sen. Cruz):\n        A resolution demanding that the Government of the People's Republic of China and the Communist Party of China immediately release Mark Swidan.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 115 (Sen. Tillis):\n        A resolution supporting the goals and ideals of \"Countering International Parental Child Abduction Month\" and expressing the sense of the Senate that Congress should raise awareness of the harm caused by international parental child abduction.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, May 10)","actionItem":"PN39:\n        Geeta Rao Gupta, of Virginia, to be Ambassador at Large for Global Women's Issues\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 47. Record Vote Number: 121 \n\n\n\n PN68:\n        Colleen Joy Shogan, of Pennsylvania, to be Archivist of the United States\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 45. Record Vote Number: 120 \n\n\n\n PN148:\n        L. Felice Gorordo, of Florida, to be United States Alternate Executive Director of the International Bank for Reconstruction and Development for a term of two years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 45. Record Vote Number: 117 \n\n\n\n PN156:\n        Glenna Laureen Wright-Gallo, of Nevada, to be Assistant Secretary for Special Education and Rehabilitative Services, Department of Education\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 52 - 45. Record Vote Number: 118 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 52 - 44. Record Vote Number: 119","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Bennet, at  8:03 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}