{"retrieved-date":"2024-12-3","actions-date":"Monday, December 2, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Friday, November 29, 2024,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Friday, November 29, 2024, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, December  2)","actionItem":"H.R. 7438 (Rep. LaHood):\n        A bill to require the Secretary of the Treasury to mint coins in commemoration of the FIFA World Cup 2026, and for other purposes.\n\n        -- Senate Committee on Banking, Housing, and Urban Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 3746 (Sen. Hassan):\n        A bill to amend title 38, United States Code, to make certain spouses eligible for services under the disabled veterans' outreach program, and for other purposes.\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 4305 (Sen. Peters):\n        A bill to improve the effectiveness of body armor issued to female agents and officers of the Department of Homeland Security, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute withdrawn by Unanimous Consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3307 (Sen. Peters):\n        In the nature of a substitute.\n\n        --Amendment SA 3307 proposed by Senator Stabenow for Senator Peters.\n\n        --Amendment SA 3307 agreed to in Senate by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Monday, December  2)","actionItem":"PN1577:\n        Brian Edward Murphy, of Massachusetts, to be United States District Judge for the District of Massachusetts\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 47 - 45. Record Vote Number: 305 \n\n\n\n PN1651:\n        Anne Hwang, of California, to be United States District Judge for the Central District of California\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 48 - 43. Record Vote Number: 304 \n\n\n\n PN2015:\n        Anthony J. Brindisi, of New York, to be United States District Judge for the Northern District of New York\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, debate 12/3/2024.\n\n\n PN2016:\n        Tiffany Rene Johnson, of Georgia, to be United States District Judge for the Northern District of Georgia\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN2017:\n        Keli Marie Neary, of Pennsylvania, to be United States District Judge for the Middle District of Pennsylvania\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN2039:\n        Elizabeth C. Coombe, of New York, to be United States District Judge for the Northern District of New York\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN2040:\n        Sarah Morgan Davenport, of New Mexico, to be United States District Judge for the District of New Mexico\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n\n PN2050:\n        Maj. Gen. Allan M. Pepin, in the Army, to be Lieutenant General\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN2157:\n        Lt. Gen. Christopher T. Donahue, in the Army, to be General\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Ms. Stabenow, at 7:45 p.m., the Senate adjourned, under its order of today, until 12 noon tomorrow.","actionTimeStamp":"--"}]}