{"retrieved-date":"2022-12-15","actions-date":"Thu, 15 Dec 2022 10:28:42 -0500","actions-title":"House Floor Proceedings","actions-count":13,"actions-list":[{"index":1,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H.R. 1948.","actionTimeStamp":"Thu, 15 Dec 2022 10:28:42 -0500"},{"index":2,"header":"--","actionItem":"Rule provides for consideration of H.R. 1948, S. 3905 and S. 4003. Rule provides for one hour of general debate each for H.R. 1948, S. 3905, S. 4003. Rule provides for one hour of general debate on the Senate amendment to H.R. 1437. Rule provides that H. Res. 1516 and H. Con. Res. 124 are adopted. Rule provides that the House shall be considered to have taken from the Speaker's table H.R. 2617, with the Senate amendments thereto, to have concurred in the Senate amendments numbered 1, 2, 3, and 5, and to have concurred in the Senate amendment numbered 4 with an amendment consisting of the text of Rules Committee Print 117-73.","actionTimeStamp":"Thu, 15 Dec 2022 10:28:15 -0500"},{"index":3,"header":"--","actionItem":"Considered under the provisions of rule H. Res. 1518. H.R. 1948 — \"To amend title 38, United States Code, to modify authorities relating to the collective bargaining of employees in the Veterans Health Administration.\"","actionTimeStamp":"Thu, 15 Dec 2022 10:28:10 -0500"},{"index":4,"header":"--","actionItem":"Motion to reconsider laid on the table Agreed to without objection.","actionTimeStamp":"Thu, 15 Dec 2022 10:27:04 -0500"},{"index":5,"header":"--","actionItem":"On agreeing to the resolution Agreed to by the Yeas and Nays: (Roll no. 527).","actionTimeStamp":"Thu, 15 Dec 2022 10:27:03 -0500"},{"index":6,"header":"--","actionItem":"The previous question was ordered without objection.","actionTimeStamp":"Thu, 15 Dec 2022 09:42:54 -0500"},{"index":7,"header":"DEBATE","actionItem":"The House proceeded with one hour of debate on H. Res. 1519.","actionTimeStamp":"Thu, 15 Dec 2022 09:22:18 -0500"},{"index":8,"header":"--","actionItem":"Considered as privileged matter. H. Res. 1519 — \"Providing for consideration of the bill (H.R. 8393) to enable the people of Puerto Rico to choose a permanent, nonterritorial, fully self-governing political status for Puerto Rico and to provide for a transition to and the implementation of that permanent, nonterritorial, fully self-governing political status, and for other purposes.\"","actionTimeStamp":"Thu, 15 Dec 2022 09:20:23 -0500"},{"index":9,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches.","actionTimeStamp":"Thu, 15 Dec 2022 09:06:15 -0500"},{"index":10,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mr. Takano to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Thu, 15 Dec 2022 09:04:36 -0500"},{"index":11,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Thu, 15 Dec 2022 09:04:33 -0500"},{"index":12,"header":"--","actionItem":"Today's prayer was offered by Rev. Dr. William J. Barber II, Greenleaf Christian Church, Goldsboro, North Carolina.","actionTimeStamp":"Thu, 15 Dec 2022 09:01:40 -0500"},{"index":13,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Thu, 15 Dec 2022 09:00:00 -0500"}]}