{"retrieved-date":"2023-6-15","actions-date":"Tuesday, June 13, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, June 13)","actionItem":"S. 305 (Sen. Blumenthal):\n        A bill to require the Secretary of the Treasury to mint coins in commemoration of the 250th anniversary of the United States Marine Corps, and to support programs at the Marine Corps Heritage Center.\n\n        -- Senate Committee on Banking, Housing, and Urban Affairs discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 135 (Sen. Blumenthal):\n        In the nature of a substitute.\n\n        --Amendment SA 135 proposed by Senator Durbin for Senator Blumenthal.\n\n        --Amendment SA 135 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 376 (Sen. Cruz):\n        A bill to designate the area between the intersections of 16th Street, Northwest and Fuller Street, Northwest and 16th Street, Northwest and Euclid Street, Northwest in Washington, District of Columbia, as \"Oswaldo Paya Way\".\n\n        -- Senate Committee on Homeland Security and Governmental Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S.Res. 248 (Sen. Daines):\n        A resolution designating June 2023 as \"Great Outdoors Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 249 (Sen. Johnson):\n        A resolution expressing support for the designation of July 2023 as \"National Sarcoma Awareness Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 250 (Sen. Scott, of FL):\n        A resolution designating June 6, 2023, as National Naloxone Awareness Day.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, June 13)","actionItem":"PN87:\n        Hernan D. Vera, of California, to be United States District Judge for the Central District of California\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 51 - 48. Record Vote Number: 155 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 51 - 48. Record Vote Number: 157 \n\n\n\n PN138:\n        Elizabeth Allen, of New York, to be Under Secretary of State for Public Diplomacy\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 66 - 33. Record Vote Number: 154 \n\n\n\n PN383:\n        Jared Bernstein, of Virginia, to be Chairman of the Council of Economic Advisers\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 156 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 49. Record Vote Number: 158","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Durbin, at  7:09 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}