{"retrieved-date":"2024-7-25","actions-date":"Tuesday, July 23, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, July 23)","actionItem":"H.R. 1076 (Rep. De La Cruz):\n        A bill to require the Comptroller General of the United States to carry out a study on the trafficking into the United States of synthetic drugs, and related illicit finance, and for other purposes.\n\n        -- Senate Committee on Banking, Housing, and Urban Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 2073 (Sen. Ossoff):\n        A bill to amend title 31, United States Code, to require agencies to include a list of outdated or duplicative reporting requirements in annual budget justifications, and for other purposes.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Motion by Senator Schumer to concur in the House amendment to S. 2073.\n\n        -- Cloture motion on the motion to concur in the House amendment to S. 2073 presented in Senate.\n\n        -- Motion by Senator Schumer to concur in the House amendment to S. 2073 with an amendment (SA 3021) made in Senate.\n\n        -- Motion by Senator Schumer to refer to Senate Committee on Homeland Security and Governmental Affairs the House message to accompany S. 2073 with instructions to report back forthwith with the following amendment (SA 3023) made in Senate.\n \n\n S.Amdt. 3021 (Sen. Schumer):\n        In the nature of a substitute.\n\n        --Amendment SA 3021 proposed by Senator Schumer.\n\n\n S.Amdt. 3022 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 3022 proposed by Senator Schumer to Amendment SA 3021.\n\n\n S.Amdt. 3023 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 3023 proposed by Senator Schumer.\n\n\n S.Amdt. 3024 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 3024 proposed by Senator Schumer to Amendment SA 3023 (the instructions of the motion to refer).\n\n\n S.Amdt. 3025 (Sen. Schumer):\n        To add an effective date.\n\n        --Amendment SA 3025 proposed by Senator Schumer to Amendment SA 3024.\n\n\n\n\n S. 3696 (Sen. Durbin):\n        A bill to improve rights to relief for individuals affected by non-consensual activities involving intimate digital forgeries, and for other purposes.\n\n        -- Senate Committee on the Judiciary discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Voice Vote.\n \n\n S.Amdt. 3049 (Sen. Durbin):\n        In the nature of a substitute.\n\n        --Amendment SA 3049 proposed by Senator Schumer for Senator Durbin.\n\n        --Amendment SA 3049 agreed to in Senate by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, July 23)","actionItem":"PN1236:\n        Colleen Duffy Kiko, of North Dakota, to be a Member of the Federal Labor Relations Authority for a term of five years expiring July 29, 2027\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 82 - 6. Record Vote Number: 214 \n\n\n\n PN1400:\n        Kashi Way, of Maryland, to be a Judge of the United States Tax Court for a term of fifteen years\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, debate and vote 7/24/2024.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  7:37 p.m, the Presiding Officer (Ms. Butler in the chair) declared the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}