{"retrieved-date":"2023-11-30","actions-date":"Tuesday, November 28, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, November 28)","actionItem":"S.Res. 476 (Sen. Blumenthal):\n        A resolution supporting the goals and ideals of a National Move Over Law Day.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 477 (Sen. Hyde-Smith):\n        A resolution commending the University of Mississippi for 175 years of service to the State of Mississippi and the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 478 (Sen. Rosen):\n        A resolution designating November 2023 as \"National Hospice and Palliative Care Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, November 28)","actionItem":"PN157:\n        Jose Javier Rodriguez, of Florida, to be an Assistant Secretary of Labor\n\n        -- Cloture not invoked in Senate by Yea-Nay Vote. 44 - 51. Record Vote Number: 318 \n\n\n        -- Motion by Senator Schumer to reconsider the vote (Roll Call Vote No. 318) by which cloture was not invoked on the nomination entered in Senate.\n\n\n PN817:\n        Margaret M. Garnett, of New York, to be United States District Judge for the Southern District of New York\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 49 - 46. Record Vote Number: 316 \n\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 49 - 46. Record Vote Number: 317 \n\n\n\n PN903:\n        Jeffrey M. Bryan, of Minnesota, to be United States District Judge for the District of Minnesota\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 49 - 46. Record Vote Number: 315 \n\n\n\n PN1022:\n        Micah W.J. Smith, of Hawaii, to be United States District Judge for the District of Hawaii\n\n        -- Motion to proceed to consideration of nomination made in Senate.\n\n        -- By unanimous consent agreement, debate 11/29/2023.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Durbin, at  5:46 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}