{"retrieved-date":"2023-5-10","actions-date":"Thursday, May 4, 2023","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Thursday, May  4)","actionItem":"S.Res. 119 (Sen. Menendez):\n        A resolution recognizing the 202nd anniversary of the independence of Greece and celebrating democracy in Greece and the United States.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 181 (Sen. Hassan):\n        A resolution supporting the designation of the week of April 24 through April 28, 2023, as \"National Specialized Instructional Support Personnel Appreciation Week\".\n\n        -- Senate Committee on Health, Education, Labor, and Pensions discharged by Unanimous Consent.\n\n        -- Resolution agreed to in Senate without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 198 (Sen. Sullivan):\n        A resolution designating the week of April 23 through April 29, 2023, as \"National Water Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 199 (Sen. Sullivan):\n        A resolution designating May 5, 2023, as \"United States Foreign Service Day\" in recognition of the men and women who have served, or are presently serving, in the Foreign Service of the United States, and honoring the members of the Foreign Service who have given their lives in the line of duty.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Voice Vote.\n\n\n S.Res. 200 (Sen. Cardin):\n        A resolution expressing support for the designation of the week of April 30, 2023, through May 6, 2023, as \"National Small Business Week\" to celebrate the contributions of small businesses and entrepreneurs in every community in the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Thursday, May  4)","actionItem":"PN39:\n        Geeta Rao Gupta, of Virginia, to be Ambassador at Large for Global Women's Issues\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 44. Record Vote Number: 115 \n\n\n        -- By unanimous consent agreement, vote to be determined.\n\n\n PN68:\n        Colleen Joy Shogan, of Pennsylvania, to be Archivist of the United States\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 44. Record Vote Number: 114 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, vote to be determined.\n\n\n PN148:\n        L. Felice Gorordo, of Florida, to be United States Alternate Executive Director of the International Bank for Reconstruction and Development for a term of two years\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- By unanimous consent agreement, debate 5/9/2023.\n\n\n PN156:\n        Glenna Laureen Wright-Gallo, of Nevada, to be Assistant Secretary for Special Education and Rehabilitative Services, Department of Education\n\n        -- Motion to proceed to executive session to consideration of nomination agreed to in Senate by Voice Vote.\n\n        -- Cloture motion presented in Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n\n PN286:\n        Amanda K. Brailsford, of Idaho, to be United States District Judge for the District of Idaho\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN289:\n        LaShonda A. Hunt, of Illinois, to be United States District Judge for the Northern District of Illinois\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 56 - 41. Record Vote Number: 113 \n\n\n\n PN293:\n        Damien M. Diggs, of Texas, to be United States Attorney for the Eastern District of Texas for the term of four years\n\n        -- Considered by Senate.\n\n        -- Confirmed by the Senate by Voice Vote.\n\n\n PN494:\n        133 nominations in the Foreign Service beginning with Kara Miriam Abramson and ending with Faris Y. Asad\n\n        -- Confirmed by the Senate by Voice Vote.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"Under the authority of the order of today, at  3:44 p.m, the Presiding Officer (Ms. Duckworth in the chair) declared the Senate adjourned, under its order of today, until  9:30 a.m. tomorrow.","actionTimeStamp":"--"}]}