{"retrieved-date":"2024-11-14","actions-date":"Wednesday, November 13, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of yesterday, the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of yesterday, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Wednesday, November 13)","actionItem":"H.R. 5464 (Rep. Aderholt):\n        A bill to name the Department of Veterans Affairs community-based outpatient clinic in Guntersville, Alabama, as the \"Colonel Ola Lee Mize Department of Veterans Affairs Clinic\".\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 5861 (Rep. LaHood):\n        A bill to extend reemployment services and eligibility assessments to all claimants for unemployment benefits, and for other purposes.\n\n        -- Senate Committee on Finance discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n H.R. 7333 (Rep. Mast):\n        A bill to name the Department of Veterans Affairs medical center in West Palm Beach, Florida, as the \"Thomas H. Corey VA Medical Center\".\n\n        -- Senate Committee on Veterans' Affairs discharged by Unanimous Consent.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 1316 (Sen. Klobuchar):\n        A bill to amend the Fair Credit Reporting Act to expand the definition of an active duty military consumer for purposes of certain credit monitoring requirements, and for other purposes.\n\n        -- Senate Committee on Banking, Housing, and Urban Affairs discharged by Unanimous Consent.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n \n\n S.Amdt. 3302 (Sen. Klobuchar):\n        In the nature of a substitute.\n\n        --Amendment SA 3302 proposed by Senator Schumer for Senator Klobuchar.\n\n        --Amendment SA 3302 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S. 5314 (Sen. Lankford):\n        A bill to designate the medical center of the Department of Veterans Affairs in Tulsa, Oklahoma, as the James Mountain Inhofe VA Medical Center.\n\n        -- Introduced in the Senate, read twice, considered, read the third time, and passed without amendment by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Wednesday, November 13)","actionItem":"PN923:\n        David Huitema, of Maryland, to be Director of the Office of Government Ethics for a term of five years\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 48. Record Vote Number: 259 \n\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, vote 11/14/2024.\n\n\n PN1744:\n        Cathy Fung, of California, to be a Judge of the United States Tax Court for a term of fifteen years\n\n        -- By unanimous consent agreement, debate and vote 11/13/2024.\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 58 - 37. Record Vote Number: 260 \n\n\n        -- By unanimous consent agreement, debate and vote 11/14/2024.\n\n\n PN1903:\n        Jonathan E. Hawley, of Illinois, to be United States District Judge for the Central District of Illinois\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 50 - 48. Record Vote Number: 257 \n\n\n        -- Confirmed by the Senate by Yea-Nay Vote. 50 - 46. Record Vote Number: 258","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  6:44 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}