{"retrieved-date":"2023-6-14","actions-date":"Wed, 14 Jun 2023 15:10:38 -0400","actions-title":"House Floor Proceedings","actions-count":69,"actions-list":[{"index":1,"header":"On agreeing to the Good (VA) amendment (A009) Roll Call 258","actionItem":"Recorded vote pending.","actionTimeStamp":"Wed, 14 Jun 2023 15:10:38 -0400"},{"index":2,"header":"--","actionItem":"On agreeing to the Biggs amendment; Failed by recorded vote: (Roll no. 257).","actionTimeStamp":"Wed, 14 Jun 2023 15:10:26 -0400"},{"index":3,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Wed, 14 Jun 2023 14:30:45 -0400"},{"index":4,"header":"--","actionItem":"Considered as unfinished business. H.R. 277 — \"To amend chapter 8 of title 5, United States Code, to provide that major rules of the executive branch shall have no force or effect unless a joint resolution of approval is enacted into law.\"","actionTimeStamp":"Wed, 14 Jun 2023 14:30:31 -0400"},{"index":5,"header":"UNFINISHED BUSINESS","actionItem":"The Chair announced the unfinished business was the question on agreeing to the amendments and passage of H.R. 277, and agreeing to the amendments and passage of H.R. 1640, which had all been debated earlier and on which further proceedings had been postponed.","actionTimeStamp":"Wed, 14 Jun 2023 14:30:20 -0400"},{"index":6,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of June 14.","actionTimeStamp":"Wed, 14 Jun 2023 14:30:19 -0400"},{"index":7,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is subject to the call of the Chair.","actionTimeStamp":"Wed, 14 Jun 2023 13:52:14 -0400"},{"index":8,"header":"--","actionItem":"Committee of the Whole House on the state of the Union rises leaving H.R. 277 as unfinished business.","actionTimeStamp":"Wed, 14 Jun 2023 13:51:33 -0400"},{"index":9,"header":"--","actionItem":"On motion that the committee rise Agreed to by voice vote.","actionTimeStamp":"Wed, 14 Jun 2023 13:51:18 -0400"},{"index":10,"header":"--","actionItem":"Mr. Roy moved that the committee rise.","actionTimeStamp":"Wed, 14 Jun 2023 13:51:02 -0400"},{"index":11,"header":"POSTPONED PROCEEDINGS","actionItem":"At conclusion of debate on the Roy amendment No. 15, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Nadler demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 14 Jun 2023 13:50:39 -0400"},{"index":12,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 495, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 15.","actionTimeStamp":"Wed, 14 Jun 2023 13:41:04 -0400"},{"index":13,"header":"--","actionItem":"An amendment, offered by Mr. Roy,  numbered 15 printed in Part A of House Report 118-108 to expand the definition of \"major rule\" to include any rule likely to result in an increase in mandatory vaccinations.","actionTimeStamp":"Wed, 14 Jun 2023 13:40:41 -0400"},{"index":14,"header":"POSTPONED PROCEEDINGS","actionItem":"At conclusion of debate on the Roy amendment No. 14, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Nadler demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 14 Jun 2023 13:40:20 -0400"},{"index":15,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 495, the Committee of the Whole proceeded with 10 minutes of debate on the Roy amendment No. 14.","actionTimeStamp":"Wed, 14 Jun 2023 13:31:59 -0400"},{"index":16,"header":"--","actionItem":"An amendment, offered by Mr. Roy,  numbered 14 printed in Part A of House Report 118-108 expand the definition of \"major rule\" to include any rule that references one of President Biden's major diversity, equity, and inclusion executive orders.","actionTimeStamp":"Wed, 14 Jun 2023 13:31:37 -0400"},{"index":17,"header":"--","actionItem":"On agreeing to the Joyce (OH) amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 14 Jun 2023 13:31:20 -0400"},{"index":18,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 495, the Committee of the Whole proceeded with 10 minutes of debate on the Joyce (OH) amendment No. 13.","actionTimeStamp":"Wed, 14 Jun 2023 13:25:03 -0400"},{"index":19,"header":"--","actionItem":"An amendment, offered by Mr. Joyce (OH),  numbered 13 printed in Part A of House Report 118-108 to amend the definition of 'rule' to include interpretative rules, general statements of policy, and all other agency guidance documents.","actionTimeStamp":"Wed, 14 Jun 2023 13:24:50 -0400"},{"index":20,"header":"POSTPONED PROCEEDINGS","actionItem":"At conclusion of debate on the Houlahan amendment No. 12, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Ms. Houlahan demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 14 Jun 2023 13:24:27 -0400"},{"index":21,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 495, the Committee of the Whole proceeded with 10 minutes of debate on the Houlahan amendment No. 12.","actionTimeStamp":"Wed, 14 Jun 2023 13:17:46 -0400"},{"index":22,"header":"--","actionItem":"An amendment, offered by Ms. Houlahan,  numbered 12 printed in Part A of House Report 118-108 to require Congress to approve by vote any regulation with an economic impact over $1 billion instead of $100 million.","actionTimeStamp":"Wed, 14 Jun 2023 13:17:28 -0400"},{"index":23,"header":"POSTPONED PROCEEDINGS","actionItem":"At conclusion of debate on the Al Green (TX) amendment No. 11, the Chair put the question on agreeing to the amendment and by voice vote, announced that the noes had prevailed. Mr. Al Green (TX) demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 14 Jun 2023 13:16:54 -0400"},{"index":24,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 495, the Committee of the Whole proceeded with 10 minutes of debate on the Al Green (TX) amendment No. 11.","actionTimeStamp":"Wed, 14 Jun 2023 13:12:59 -0400"},{"index":25,"header":"--","actionItem":"An amendment, offered by Mr. Green, Al (TX),  numbered 11 printed in Part A of House Report 118-108 to create a rapid-review requirement which would allow executive branch rules to go into effect if Congress does not pass a joint resolution within 70 legislative days.","actionTimeStamp":"Wed, 14 Jun 2023 13:12:37 -0400"},{"index":26,"header":"POSTPONED PROCEEDINGS","actionItem":"At conclusion of debate on the Al Green (TX) amendment No. 10, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mrs. Hageman demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 14 Jun 2023 13:11:46 -0400"},{"index":27,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 495, the Committee of the Whole proceeded with 10 minutes of debate on the Al Green (TX) amendment No. 10.","actionTimeStamp":"Wed, 14 Jun 2023 13:07:52 -0400"},{"index":28,"header":"--","actionItem":"An amendment, offered by Mr. Green, Al (TX),  numbered 10 printed in Part A of House Report 118-108 to delay implementation of the legislation by 1 year and require a study be conducted in that time by the GAO on the effects of implementation.","actionTimeStamp":"Wed, 14 Jun 2023 13:07:30 -0400"},{"index":29,"header":"POSTPONED PROCEEDINGS","actionItem":"At conclusion of debate on the Good (VA) amendment No. 9, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Nadler demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 14 Jun 2023 13:06:50 -0400"},{"index":30,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 495, the Committee of the Whole proceeded with 10 minutes of debate on the Good (VA) amendment No. 9.","actionTimeStamp":"Wed, 14 Jun 2023 13:00:40 -0400"},{"index":31,"header":"--","actionItem":"An amendment, offered by Mr. Good (VA),  numbered 9 printed in Part A of House Report 118-108 to expand the definition of \"major rule\" to include any rule likely to result in increased access to abortion, abortion-related services, or abortion-related travel.","actionTimeStamp":"Wed, 14 Jun 2023 13:00:12 -0400"},{"index":32,"header":"--","actionItem":"On agreeing to the Good (VA) amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 14 Jun 2023 12:59:52 -0400"},{"index":33,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 495, the Committee of the Whole proceeded with 10 minutes of debate on the Good (VA) amendment No. 8.","actionTimeStamp":"Wed, 14 Jun 2023 12:55:13 -0400"},{"index":34,"header":"--","actionItem":"An amendment, offered by Mr. Good (VA),  numbered 8 printed in Part A of House Report 118-108 to create a process for Congress to review all rules currently in effect over a 5 year period.","actionTimeStamp":"Wed, 14 Jun 2023 12:54:53 -0400"},{"index":35,"header":"--","actionItem":"On agreeing to the Gonzales, Tony amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 14 Jun 2023 12:53:57 -0400"},{"index":36,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 495, the Committee of the Whole proceeded with 10 minutes of debate on the Tony Gonzales (TX) amendment No. 7.","actionTimeStamp":"Wed, 14 Jun 2023 12:53:31 -0400"},{"index":37,"header":"--","actionItem":"An amendment, offered by Mr. Gonzales, Tony,  numbered 7 printed in Part A of House Report 118-108 to require any executive agency to submit a constitutional authority statement with any proposed rule.","actionTimeStamp":"Wed, 14 Jun 2023 12:53:18 -0400"},{"index":38,"header":"--","actionItem":"On agreeing to the Good (VA) amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 14 Jun 2023 12:52:48 -0400"},{"index":39,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 495, the Committee of the Whole proceeded with 10 minutes of debate on the Good (VA) amendment No. 6.","actionTimeStamp":"Wed, 14 Jun 2023 12:52:42 -0400"},{"index":40,"header":"--","actionItem":"An amendment, offered by Mr. Good (VA),  numbered 6 printed in Part A of House Report 118-108 to direct the Comptroller General, in consultation with the Director of the Congressional Budget Office, to make a determination on whether an agency action qualifies as a major rule under the definition of this act, if requested in writing by a member of Congress. Also, the amendment codifies in statute existing procedures for the Comptroller General to make a determination on whether an agency action qualifies as a rule under the definition of this act, if requested in writing by a member of Congress.","actionTimeStamp":"Wed, 14 Jun 2023 12:52:36 -0400"},{"index":41,"header":"--","actionItem":"On agreeing to the Hageman amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 14 Jun 2023 12:50:51 -0400"},{"index":42,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 495, the Committee of the Whole proceeded with 10 minutes of debate on the Hageman amendment No. 5.","actionTimeStamp":"Wed, 14 Jun 2023 12:43:42 -0400"},{"index":43,"header":"--","actionItem":"An amendment, offered by Ms. Hageman,  numbered 5 printed in Part A of House Report 118-108 to close a loophole created by the Modernizing Regulatory Review by clarifying that Office of Information and Regulatory Affairs must issue a finding for each rule determining whether the rule has a significant economic impact.","actionTimeStamp":"Wed, 14 Jun 2023 12:43:21 -0400"},{"index":44,"header":"POSTPONED PROCEEDINGS","actionItem":"At conclusion of debate on the Biggs amendment No. 4, the Chair put the question on agreeing to the amendment and by voice vote, announced that the ayes had prevailed. Mr. Nadler demanded a recorded vote and the Chair postponed further proceedings until a time to be announced.","actionTimeStamp":"Wed, 14 Jun 2023 12:42:22 -0400"},{"index":45,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 495, the Committee of the Whole proceeded with 10 minutes of debate on the Biggs amendment No. 4.","actionTimeStamp":"Wed, 14 Jun 2023 12:35:05 -0400"},{"index":46,"header":"--","actionItem":"An amendment, offered by Mr. Biggs,  numbered 4 printed in Part A of House Report 118-108 to lower the threshold for designation as a \"major rule\" to $50 million.","actionTimeStamp":"Wed, 14 Jun 2023 12:34:48 -0400"},{"index":47,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 14 Jun 2023 12:34:26 -0400"},{"index":48,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 495, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 3.","actionTimeStamp":"Wed, 14 Jun 2023 12:32:36 -0400"},{"index":49,"header":"--","actionItem":"An amendment, offered by Mrs. Boebert,  numbered 3 printed in Part A of House Report 118-108 to require the Comptroller General's Congressional Review Report to also be made available to the Congressional committees of jurisdiction.","actionTimeStamp":"Wed, 14 Jun 2023 12:32:20 -0400"},{"index":50,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 14 Jun 2023 12:31:52 -0400"},{"index":51,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 495, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 2.","actionTimeStamp":"Wed, 14 Jun 2023 12:28:42 -0400"},{"index":52,"header":"--","actionItem":"An amendment, offered by Mrs. Boebert,  numbered 2 printed in Part A of House Report 118-108 to require the Comptroller General to publish the GAO Study of Rules on its website.","actionTimeStamp":"Wed, 14 Jun 2023 12:28:22 -0400"},{"index":53,"header":"--","actionItem":"On agreeing to the Boebert amendment; Agreed to by voice vote.","actionTimeStamp":"Wed, 14 Jun 2023 12:28:04 -0400"},{"index":54,"header":"DEBATE","actionItem":"Pursuant to the provisions of H. Res. 495, the Committee of the Whole proceeded with 10 minutes of debate on the Boebert amendment No. 1.","actionTimeStamp":"Wed, 14 Jun 2023 12:21:41 -0400"},{"index":55,"header":"--","actionItem":"An amendment, offered by Mrs. Boebert,  numbered 1 printed in Part A of House Report 118-108 to revise the Comptroller Generals Congressional Review Report to include an estimate of the effect on inflation.","actionTimeStamp":"Wed, 14 Jun 2023 12:21:06 -0400"},{"index":56,"header":"--","actionItem":"The House resolved into Committee of the Whole House on the state of the Union for further consideration.","actionTimeStamp":"Wed, 14 Jun 2023 12:19:08 -0400"},{"index":57,"header":"--","actionItem":"Considered as unfinished business. H.R. 277 — \"To amend chapter 8 of title 5, United States Code, to provide that major rules of the executive branch shall have no force or effect unless a joint resolution of approval is enacted into law.\"","actionTimeStamp":"Wed, 14 Jun 2023 12:18:51 -0400"},{"index":58,"header":"UNANIMOUS CONSENT REQUEST","actionItem":"Mr. Santos asked unanimous consent that the proceedings during the former Members program be printed in the Congressional Record and that all Members and former Members who spoke during the proceedings have the privilege of revising and extending their remarks. Agreed to without objection.","actionTimeStamp":"Wed, 14 Jun 2023 12:16:25 -0400"},{"index":59,"header":"--","actionItem":"Mr. Santos asked unanimous consent that when the House adjourns today, it adjourn to meet at 9:00 a.m. on June 15. Agreed to without objection.","actionTimeStamp":"Wed, 14 Jun 2023 12:16:24 -0400"},{"index":60,"header":"ONE MINUTE SPEECHES","actionItem":"The House proceeded with one minute speeches, which by direction of the Chair, would be limited to 15 per side of the aisle.","actionTimeStamp":"Wed, 14 Jun 2023 12:05:23 -0400"},{"index":61,"header":"--","actionItem":"The House received a message from the Senate. The Senate passed S. 305 and S. 376.","actionTimeStamp":"Wed, 14 Jun 2023 12:04:58 -0400"},{"index":62,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair designated Mrs. Kiggans of VA to lead the Members in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Wed, 14 Jun 2023 12:04:32 -0400"},{"index":63,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Wed, 14 Jun 2023 12:04:19 -0400"},{"index":64,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Wed, 14 Jun 2023 12:02:28 -0400"},{"index":65,"header":"--","actionItem":"The House convened, returning from a recess continuing the legislative day of June 14.","actionTimeStamp":"Wed, 14 Jun 2023 12:00:00 -0400"},{"index":66,"header":"--","actionItem":"The Speaker announced that the House do now recess. The next meeting is scheduled for 12:00 P.M. today.","actionTimeStamp":"Wed, 14 Jun 2023 10:48:48 -0400"},{"index":67,"header":"MORNING-HOUR DEBATE","actionItem":"The House proceeded with Morning-Hour Debate. At the conclusion of Morning-Hour, the House will recess until 12:00 p.m. for the start of legislative business.","actionTimeStamp":"Wed, 14 Jun 2023 10:00:45 -0400"},{"index":68,"header":"--","actionItem":"The Speaker designated the Honorable Beth Van Duyne to act as Speaker pro tempore for today.","actionTimeStamp":"Wed, 14 Jun 2023 10:00:13 -0400"},{"index":69,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Wed, 14 Jun 2023 10:00:00 -0400"}]}