{"retrieved-date":"2024-4-17","actions-date":"Monday, April 15, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Thursday, April 11, 2024,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Thursday, April 11, 2024, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today .","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Monday, April 15)","actionItem":"S. 3858 (Sen. Kelly):\n        A bill to establish within the Office of Land and Emergency Management of the Environmental Protection Agency the Office of Mountains, Deserts, and Plains, and for other purposes.\n\n        -- Passed Senate with amendments by Voice Vote.\n\n\n S. 4072 (Sen. Crapo):\n        A bill to prohibit the use of funds to implement, administer, or enforce certain rules of the Environmental Protection Agency .\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Motion to proceed to measure considered in Senate.\n\n\n S.Res. 174 (Sen. Coons):\n        A resolution condemning the human rights record of the Government of the Kingdom of Eswatini and the brutal killing of Eswatini activist Thulani Maseko on January 21, 2023.\n\n        -- Measure laid before Senate by unanimous consent.\n\n        -- The committee substitute as amended agreed to by Unanimous Consent.\n\n        -- Resolution agreed to in Senate with an amendment and an amended preamble by Unanimous Consent.\n \n\n S.Amdt. 1819 (Sen. Coons):\n        To remove sanctions language.\n\n        --Amendment SA 1819 proposed by Senator Schumer for Senator Coons.\n\n        --Amendment SA 1819 agreed to in Senate by Unanimous Consent.\n\n\n\n\n S.Res. 640 (Sen. Young):\n        A resolution commemorating and supporting the goals of \"World Quantum Day\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 641 (Sen. Sullivan):\n        A resolution designating the week of April 7 through April 13, 2024, as \"National Water Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Monday, April 15)","actionItem":"PN1252:\n        Ramona Villagomez Manglona, of the Northern Mariana Islands, to be Judge for the District Court for the Northern Mariana Islands for a term of ten years\n\n        -- Considered by Senate.\n\n        -- By unanimous consent agreement, mandatory quorum required under Rule XXII waived.\n\n        -- Motion to table the nomination rejected in Senate by Yea-Nay Vote. 39 - 50. Record Vote Number: 125 \n\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 84 - 3. Record Vote Number: 126 \n\n\n        -- By unanimous consent agreement, debate 4/16/2024.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  9:04 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}