{"retrieved-date":"2024-5-1","actions-date":"Tuesday, April 30, 2024","actions-title":"Recent Floor Activity","actions-count":6,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Friday, April 26, 2024,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Friday, April 26, 2024, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, April 30)","actionItem":"H.R. 1042 (Rep. Rodgers):\n        A bill to prohibit the importation into the United States of unirradiated low-enriched uranium that is produced in the Russian Federation, and for other purposes.\n\n        -- Passed Senate without amendment by Unanimous Consent.\n\n\n S. 2116 (Sen. Peters):\n        A bill to require the Secretary of Commerce to produce a report that provides recommendations to improve the effectiveness , efficiency, and impact of Department of Commerce programs related to supply chain resilience and manufacturing and industrial innovation, and for other purposes.\n\n        -- Passed Senate with an amendment by Unanimous Consent.\n\n\n S.Res. 664 (Sen. Markey):\n        A resolution recognizing the designation of April as \"Community College Month\" to celebrate more than 1,000 institutions throughout the United States supporting access to higher education and workforce training, and more broadly sustaining and advancing the economic prosperity of the United States.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 665 (Sen. Moran):\n        A resolution supporting May 3, 2024, as \"National Space Day\" in recognition of the significant positive impact the aerospace community has and will continue to have on the United States of America.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Executive Business (Tuesday, April 30)","actionItem":"PN1458:\n        Georgia N. Alexakis, of Illinois, to be United States District Judge for the Northern District of Illinois\n\n        -- Considered by Senate.\n\n        -- Cloture invoked in Senate by Yea-Nay Vote. 53 - 42. Record Vote Number: 155 \n\n\n        -- By unanimous consent agreement, debate 5/1/2024.","actionTimeStamp":"--"},{"index":6,"header":"Adjournment","actionItem":"By unanimous consent, on the request of Mr. Whitehouse, at  6:48 p.m., the Senate adjourned, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}