{"retrieved-date":"2023-3-7","actions-date":"Fri, 03 Mar 2023 09:04:21 -0500","actions-title":"House Floor Proceedings","actions-count":8,"actions-list":[{"index":1,"header":"--","actionItem":"The Speaker announced that the House do now adjourn. The next meeting is scheduled for 12:00 p.m. on March 7, 2023.","actionTimeStamp":"Fri, 03 Mar 2023 09:04:21 -0500"},{"index":2,"header":"--","actionItem":"The House received a communication from The Honorable Sam Graves, Chairman, Committee on Transportation and Infrastructure. Pursuant to section 3307 of Title 40, United States Code, Mr. Graves notified the Speaker that the Committee on Transportation and Infrastructure met on February 28, 2023 in open session to consider 10 resolutions included in the General Services Administration's Capital Investment and Leasing Programs and that the Committee continues to work to reduce the cost of federal property and leases. The resolutions considered included 2 alteration projects and 8 leases that will result in $382 million in savings from avoided lease costs and space reductions. The resolutions were then referred to the Committee on Appropriations.","actionTimeStamp":"Fri, 03 Mar 2023 09:03:37 -0500"},{"index":3,"header":"--","actionItem":"The House received a message from the Clerk. Pursuant to the permission granted in Clause 2(h) of Rule II of the Rules of the U.S. House of Representatives, the Clerk notified the House that she had received the following message from the Secretary of the Senate on March 2, 2023 at 1:32 p.m.: That the Senate passed S. 227, S. 619, H.J. Res. 30, and agreed to S. Res. 57. Appointments: United States-China Economic and Security Review Commission, Commission on the Future of the Navy, United States Commission on Civil Rights.","actionTimeStamp":"Fri, 03 Mar 2023 09:02:46 -0500"},{"index":4,"header":"PLEDGE OF ALLEGIANCE","actionItem":"The Chair led the House in reciting the Pledge of Allegiance to the Flag.","actionTimeStamp":"Fri, 03 Mar 2023 09:02:25 -0500"},{"index":5,"header":"--","actionItem":"The Speaker announced approval of the Journal.  Pursuant to clause 1, rule I, the Journal stands approved.","actionTimeStamp":"Fri, 03 Mar 2023 09:02:18 -0500"},{"index":6,"header":"--","actionItem":"Today's prayer was offered by the House Chaplain, Chaplain Margaret Grun Kibben.","actionTimeStamp":"Fri, 03 Mar 2023 09:00:47 -0500"},{"index":7,"header":"--","actionItem":"The Speaker designated the Honorable Jennifer A. Kiggans to act as Speaker pro tempore for today.","actionTimeStamp":"Fri, 03 Mar 2023 09:00:25 -0500"},{"index":8,"header":"--","actionItem":"The House convened, starting a new legislative day.","actionTimeStamp":"Fri, 03 Mar 2023 09:00:00 -0500"}]}