{"retrieved-date":"2023-9-27","actions-date":"Tuesday, September 26, 2023","actions-title":"Recent Floor Activity","actions-count":5,"actions-list":[{"index":1,"header":"The Journal","actionItem":"Pursuant to the order of Friday, September 22, 2023,  the Journal of the proceedings of the Senate was deemed approved to date.","actionTimeStamp":"--"},{"index":2,"header":"Certain Procedures Dispensed With","actionItem":"Pursuant to the order of Friday, September 22, 2023, the morning hour being deemed expired, and the times for the recognition of the two leaders being reserved.","actionTimeStamp":"--"},{"index":3,"header":"Transaction of Morning Business","actionItem":"The following transactions of morning business occurred on today.","actionTimeStamp":"--"},{"index":4,"header":"Legislative Business (Tuesday, September 26)","actionItem":"H.R. 3935 (Rep. Graves):\n        A bill to amend title 49, United States Code, to reauthorize and improve the Federal Aviation Administration and other civil aviation programs, and for other purposes.\n\n        -- Motion to proceed to measure considered in Senate.\n\n        -- Cloture on the motion to proceed to the measure invoked in Senate by Yea-Nay Vote. 77 - 19. Record Vote Number: 240 \n\n\n\n S.J.Res. 9 (Sen. Marshall):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the United States Fish and Wildlife Service relating to \"Endangered and Threatened Wildlife and Plants; Lesser Prairie-Chicken; Threatened Status with Section 4(d) Rule for the Northern Distinct Population Segment and Endangered Status for the Southern Distinct Population Segment\".\n\n        -- Veto message received in Senate. Held at the desk.\n\n\n S.J.Res. 24 (Sen. Mullin):\n        A joint resolution providing for congressional disapproval under chapter 8 of title 5, United States Code, of the rule submitted by the United States Fish and Wildlife Service relating to \"Endangered and Threatened Wildlife and Plants; Endangered Species Status for Northern Long-Eared Bat\".\n\n        -- Veto message received in Senate. Held at the desk.\n\n\n S.Res. 365 (Sen. Tester):\n        A resolution honoring the 50th anniversary of the National Cemetery Administration of the Department of Veterans Affairs.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 366 (Sen. Fischer):\n        A resolution designating September 2023 as \"School Bus Safety Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 367 (Sen. Rubio):\n        A resolution designating September 2023 as \"National Spinal Cord Injury Awareness Month\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 368 (Sen. Schatz):\n        A resolution supporting the designation of the week of September 17 through September 23, 2023, as \"Telehealth Awareness Week\".\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.\n\n\n S.Res. 369 (Sen. Scott, of SC):\n        A resolution expressing support for the designation of September 2023 as \"Sickle Cell Disease Awareness Month\" in order to educate communities across the United States about sickle cell disease and the need for research, early detection methods, effective treatments, and preventative care programs with respect to complications from sickle cell disease and conditions related to sickle cell disease.\n\n        -- Submitted in the Senate, considered, and agreed to without amendment and with a preamble by Unanimous Consent.","actionTimeStamp":"--"},{"index":5,"header":"Recess","actionItem":"By unanimous consent, on the request of Mr. Schumer, at  7:04 p.m., the Senate recessed, under its order of today, until 10 a.m. tomorrow.","actionTimeStamp":"--"}]}